//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//							Обработка UnixTime,даты,времени
//
// https://www.oryx-embedded.com/doc/date__time_8c_source.html
// https://stackoverflow.com/questions/7960318/math-to-convert-seconds-since-1970-into-date-and-vice-versa
// http://howardhinnant.github.io/date_algorithms.html#civil_from_days
// https://www.oryx-embedded.com/doc/date__time_8c_source.html
// http://howardhinnant.github.io/date_algorithms.html#civil_from_days
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//=================================================================================================
//						1.Получение времени и даты из системных макросов __TIME__ и __DATE__
//						  при компиляции скетча. 
//=================================================================================================
  void unixSetSystemTimeDate(RT_HW_STRUCT_UNIX_ID &id){
	(void)id;
	#if !defined(RT_HW_PERMIT_COMPACT)
//-----------------1.1. Получение секунд, минут, часов---------------------------------------------
	id.seconds=(((__TIME__[6]-'0')*10)+(__TIME__[7]-'0'));
	id.minutes=(((__TIME__[3]-'0')*10)+(__TIME__[4]-'0'));
	id.hours  =(((__TIME__[0]-'0')*10)+(__TIME__[1]-'0'));
//-----------------1.2. Получение дня--------------------------------------------------------------
	id.day  =((((__DATE__[4] >= '0') ? (__DATE__[4]) : '0')-'0')*10) + (__DATE__[5]-'0');																						
//-----------------1.3. Получение месяца-----------------------------------------------------------
	id.month=1;																							
	if((__DATE__[0] == 'J') && (__DATE__[1] == 'a') && (__DATE__[2] == 'n')){id.month= 1;}
	if((__DATE__[0] == 'F'))												  {id.month= 2;}
	if((__DATE__[0] == 'M') && (__DATE__[1] == 'a') && (__DATE__[2] == 'r')){id.month= 3;}
	if((__DATE__[0] == 'A') && (__DATE__[1] == 'p'))						  {id.month= 4;}
	if((__DATE__[0] == 'M') && (__DATE__[1] == 'a') && (__DATE__[2] == 'y')){id.month= 5;}
	if((__DATE__[0] == 'J') && (__DATE__[1] == 'u') && (__DATE__[2] == 'n')){id.month= 6;}
	if((__DATE__[0] == 'J') && (__DATE__[1] == 'u') && (__DATE__[2] == 'l')){id.month= 7;}
	if((__DATE__[0] == 'A') && (__DATE__[1] == 'u'))						  {id.month= 8;}
	if((__DATE__[0] == 'S'))												  {id.month= 9;}
	if((__DATE__[0] == 'O'))												  {id.month=10;}
	if((__DATE__[0] == 'N'))												  {id.month=11;}
	if((__DATE__[0] == 'D'))												  {id.month=12;}
//-----------------1.4. Получение года (2 младших знака)-------------------------------------------
	id.year4=((((__DATE__[7]-'0')*1000)+((__DATE__[8]-'0')*100)+((__DATE__[9]-'0')*10)+(__DATE__[10]-'0')));
	id.year =id.year4%100;	
//-----------------1.5. Получение дня недели-------------------------------------------------------
//unixSetWeekDay();		  
	#endif
	};
//-------------------------------------------------------------------------------------------------
  void unixSetSystemTimeDate(){unixSetSystemTimeDate(unixID);};

//=================================================================================================
//						2.Установка начальных значений 
//                        (функция для тестирования soft)
//=================================================================================================
  void  unixSetTimeDate(RT_HW_STRUCT_UNIX_ID &id, uint8_t vHour, uint8_t vMinute, uint8_t vSecond, uint8_t vDay, uint8_t vMonth, uint8_t vYear){
		id.hours=vHour; id.minutes=vMinute;	id.seconds=vSecond;
		id.day=vDay;    id.month=vMonth;	id.year=vYear;	id.year4=2000+vYear;};
//-------------------------------------------------------------------------------------------------
  void	unixSetTimeDate(uint8_t vHour, uint8_t vMinute, uint8_t vSecond, uint8_t vDay, uint8_t vMonth, uint8_t vYear){
		unixSetTimeDate(unixID,  vHour, vMinute, vSecond, vDay, vMonth, vYear);};

//=================================================================================================
//						3. Вспомогательная функция
//=================================================================================================
  uint8_t unixGetDim(uint8_t i){return (i < 7) ? ((i == 1) ? 28 : ((i & 1) ? 30 : 31)) : ((i & 1) ? 31 : 30);};

//=================================================================================================
//						4. Фиксация timeUNIX (кол-во секунд с 01.01.1970 по Гринвичу) 
//						   Фиксация timeZone (кол-во секунд с 01.01.1970 по указанному часовому поясу)
//                         из параметров RT_HW_STRUCT_UNIX_ID &id
// Примечание: обычно используется для начальной инициализация timeUnix,timeZone
//=================================================================================================
  void unixSetTimeUNIX(RT_HW_STRUCT_UNIX_ID &id){
	(void)id;
     uint8_t  b0;
     uint16_t w0,w1,w2; 
//-------------------------------------------------------------------------------------------------
	if(abs(id.zone)<=12){w2=id.zone*60;}	//--Пересчет   параметра сдвига часового пояса в мин; 
	else                {w2=id.zone;}		//--Сохранение параметра сдвига часового пояса в мин; 
	id.year4=2000+id.year;				//--Получение  года в формате xxxx;
//-------------------------------------------------------------------------------------------------
	b0 =(id.month >= 3) ? 1 : 0; 
	w0 = id.year4 + b0 - 1970;	 
	w1 =0;
	for(uint8_t i=0; i<(id.month-1); i++){w1 += unixGetDim(i);}
//-------------------------------------------------------------------------------------------------
//				Фиксация timeUNIX (кол-во секунд с 01.01.1970 по Гринвичу)
//-------------------------------------------------------------------------------------------------
	id.timeUNIX=(((id.day - 1 + w1 + ((w0 + 1) / 4) - ((w0 + 69) / 100) + ((w0 + 369) / 100 / 4) 
				+ 365 * (w0-b0)) * 24ul + id.hours) * 60ul + id.minutes - w2) * 60ul + id.seconds;
//-------------------------------------------------------------------------------------------------
//				Фиксация timeZone (кол-во секунд с 01.01.1970 указанному по часовому поясу)
//-------------------------------------------------------------------------------------------------
	id.fresh=1;
//-------------------------------------------------------------------------------------------------
};
//-------------------------------------------------------------------------------------------------
	void unixSetTimeUNIX(){unixSetTimeUNIX(unixID);}

//=================================================================================================
//						5. Фиксация параметров текущего времени (часы,минуты,секунды)
//							           для указанного часового пояса
//=================================================================================================
  void unixSetTime(RT_HW_STRUCT_UNIX_ID &id){
    uint8_t  b0;
    uint32_t d0;
//-------------------------------------------------------------------------------------------------
	d0=id.timeUNIX + (3600*id.zone);	    	//--UNIX время с учетом часового пояса;
//-------------------------------------------------------------------------------------------------
	id.seconds = d0 % 60UL; d0 /= 60UL;		//--Сохранение секунд;
	id.minutes = d0 % 60UL; d0 /= 60UL;		//--Сохранение минут;
	b0         = d0 % 24UL; d0 /= 24UL;		//--Часы;
	id.hours=b0;								//--Сохранение часов;
  };
//-------------------------------------------------------------------------------------------------
	void unixSetTime(){unixSetTime(unixID);}

//=================================================================================================
//						6. Фиксация параметров текущей даты (день недели,день,месяц,год xx, год хххх)
//							           для указанного часового пояса 
//=================================================================================================
	void unixSetDate(RT_HW_STRUCT_UNIX_ID &id){
	  (void)id;
	  uint8_t  b0;
	  uint16_t w0,w1,w2,w3,w4; 
	  uint32_t d0,d1;
//-------------------------------------------------------------------------------------------------
	d0        =(id.timeUNIX+ 3600*id.zone)/86400;	   //--UNIX время с учетом часового пояса;
	id.weekDay=(d0 + 4) % 7;  if (!id.weekDay) {id.weekDay = 7;}
	d1        = d0 + 719468;
	b0        = d1 / 146097ul;
	w0        = d1 - b0 * 146097ul;
	w1        =(w0 - w0 / 1460 + w0 / 36524 - w0 / 146096) / 365;
	w2        = w1 + b0 * 400;
	w3        = w0 - (w1 * 365  + w1 / 4     - w1 / 100);
	w4        =(w3 * 5 + 2) / 153;
	id.day    = w3 - (w4 * 153 + 2) / 5 + 1;
	id.month  = w4 + (w4 < 10 ? 3 : -9);
	w2       +=(id.month <= 2);
	id.year4  = w2;
	id.year   =id.year4%100;
	};
//---------------------------------------------------------------------------------------------------
  void unixSetDate(){unixSetDate(unixID);}

//=================================================================================================
//						7. Фиксация параметров  текущего времени  и  текущей даты
//							           для указанного часового пояса 
// Примечание: является оптимизированной по времени раздельного применения функций
//             фиксации параметров текущего времени и фиксация параметров текущей даты;  
//=================================================================================================
  void unixSetTotal(RT_HW_STRUCT_UNIX_ID &id){
   (void)id;
//-------------------------------------------------------------------------------------------------
	if(id.runEXT){			
		id.runEXT=0;
		id.timeUNIX=id.timeEXT;
		id.freshEXT=1;
    }
		unixSetTime(id);		//--Фиксация параметров текущего времени;	
		unixSetDate(id);		//--Фиксация параметров текущей даты; 
		id.timeMs=millis();	    //--Фиксация события;
		id.fresh=1; 			//--Флаг изменения времени (для использования во внешних функциях);	 
		id.cntFresh++;			//--Увеличение счетчика обновлений;
//--------------------------------------------------------------------------------------------------
  };
//--------------------------------------------------------------------------------------------------
  void unixSetTotal(){unixSetTotal(unixID);};

//=================================================================================================
//						8. Обновление времени (не чаще 2 раз в сек)
//=================================================================================================
  void unixUpdateTime(RT_HW_STRUCT_UNIX_ID &id, uint8_t run=255){
    (void)id; (void)run; //uint8_t idRun=0;
    uint32_t time32,timeEnd;; (void)time32; (void)timeEnd;
//-------------------------------------------------------------------------------------------------
	if(id.agoRun==shed.blink500){return;}
 	   id.agoRun =shed.blink500; 
//-------------------------------------------------------------------------------------------------
	time32=millis();	
	uint16_t diff=getPastTime(id.timeMs, time32);
    uint8_t newSec = diff / 1000;
	if(newSec < 1){return;} 
    id.timeMs = getTimeBack(diff - (newSec * 1000));
	uint32_t tempUnix=id.timeUNIX;
	for (uint8_t i = 0; i < newSec; i++){tempUnix++;}  
    id.timeUNIX=tempUnix;
	id.fresh=1; 				//--Флаг изменения времени (для использования во внешних функциях);
    unixSetTotal(id);			//--Фиксация параметров  текущего времени  и  текущей даты для указанного часового пояса;
  };
//-------------------------------------------------------------------------------------------------
  void unixUpdateTime(){unixUpdateTime(unixID, 255);};

//=================================================================================================
//						9. Установка  текущего времени timeUNIX, timeZone
//		c фиксацией параметров  текущего времени  и  текущей даты для указанного часового пояса;
//=================================================================================================
  void unixSetTimeUNIX(RT_HW_STRUCT_UNIX_ID &id, uint32_t timeUNIX){
	id.timeUNIX=timeUNIX; 	//--Установка timeUNIX (кол-во секунд с 01.01.1970 по Гринвичу);
	unixSetTime(id);		//--Фиксация параметров текущего времени;
	unixSetDate(id);		//--Фиксация параметров текущей даты;
	id.timeMs=millis();		//--Фиксация события;
	id.fresh=1; 			//--Флаг изменения времени (для использования во внешних функциях);
	id.cntFresh++;			//--Увеличение счетчика обновлений;
  };
//-------------------------------------------------------------------------------------------------
  void unixSetTimeUNIX(uint32_t timeUNIX){unixSetTimeUNIX(unixID, timeUNIX);};

//=================================================================================================
//						10. Расчет параметров  текущего дня недели
//						       параметрам день, месяц и год
//=================================================================================================
  uint8_t unixSetWeekDay(uint8_t day, uint8_t month, uint16_t year){
   (void)day; (void)month; (void)year; 
    uint16_t w0;
//-------------------------------------------------------------------------------------------------
	if(year >= 2000) {year -= 2000;}
	w0 = day;
	for(uint8_t i = 1; i < month; ++i){w0 +=unixGetDim(i - 1);}
	if (month > 2 && year % 4 == 0)          {++w0;}
	return (w0 + 365 * year + (year+ 3) / 4 + 4) % 7 + 1;	
//--------------------------------------------------------------------------------------------------
  };

//=================================================================================================
//						11.1. ВСПОМОГАТЕЛЬНАЯ ФУНКЦИЯ: Форматирование строки с параметром времени (час,минута,секунда)
//=================================================================================================
  String unixGetFormatTime(uint8_t vr){if(vr<10) {return String('0')+ String(vr);}  else {return String(vr);}};
//=================================================================================================
//						11.2. ВСПОМОГАТЕЛЬНАЯ ФУНКЦИЯ: Форматирование строки дня недели
// Параметр d: =0 - возвращает пустую строку; =1 - возвращает пробел + день недели; 
//=================================================================================================
  String unixGetFormatWeek(uint8_t vr, uint8_t d=0){if(d)     {return String(' ')+ String(vr);}  else {return "";        }};
//=================================================================================================
//						11.3. ВСПОМОГАТЕЛЬНАЯ ФУНКЦИЯ: Форматирование строки с годлм
//  Параметр d: =0 - возвращает год в формате xx; =1 - возвращает год в формате xxxx (2000+год xx); 
//=================================================================================================
  String unixGetFormatYear(uint8_t vr, uint8_t d=0){
	if(d){return String(2000+vr);}
	if(vr<10) {return (String('0')+ String(vr));}  
	else      {return String(vr);};
  };
//=================================================================================================
//						12. Возвращает строку с текущим временем (длина =8 или =10)
//  Параметр d: =0 - формат xx:xx:xx; =1 - xx:xx:xx y; 
//=================================================================================================
  String unixGetTimeString(RT_HW_STRUCT_UNIX_ID &id, uint8_t d=0){
	String temp=unixGetFormatTime(id.hours)   + String(':') + 
				unixGetFormatTime(id.minutes) + String(':') + 	//--Минуты;
				unixGetFormatTime(id.seconds) + String(' ') + 	//--Секунды; 
				unixGetFormatWeek(id.weekDay,d); 				//--День недели 
    return temp;};
//-------------------------------------------------------------------------------------------------
  String  unixGetTimeString(uint8_t d=0){return  unixGetTimeString(unixID, d);}

//=================================================================================================
//						13. Возвращает строку с текущей датой (длина 8 или 10)
// Параметр d: =0 - формат 01.01.24; =1 формат 01.01.24 1(день недели);
//=================================================================================================
  String unixGetDateString(RT_HW_STRUCT_UNIX_ID &id, uint8_t d=0){
	String temp= unixGetFormatTime(id.day)    + String('.') +  	//--День; 
				 unixGetFormatTime(id.month)  + String('.') +  	//--Месяц;  
				 unixGetFormatYear(id.year,d);				  	//--Год; 
	return temp;};
//-------------------------------------------------------------------------------------------------
  String unixGetDateString(uint8_t d=0){return unixGetDateString(unixID, d);};

//=================================================================================================
//						14. Возвращает строку с моточасами в формате xx00:00:00 из переменной uint32_t
//=================================================================================================
  String unixGetMotoSecString(uint32_t time){
     String temp=  unixGetFormatTime( time/3600UL) + String(':') +  //--Часы;
			  unixGetFormatTime((time/60L) % 60UL) + String(':') + 	//--Минуты;
			  unixGetFormatTime( time      % 60UL) + String(' '); 	//--Секунды;
  return temp;};
//================================================================================================== 
 
 
//=================================================================================================
//						15. Возвращает текущее времени в формате uint32_t 
//                               (для работы с дисплеями и панелями)
//=================================================================================================
  uint32_t unixGetTime(){
		return ((uint32_t)unixID.hours<<16) | ((uint32_t)unixID.minutes<<8) | unixID.seconds;};
//=================================================================================================
//						16. Возвращает текущую дату в формате uint32_t 
//                               (для работы с дисплеями и панелями)
//=================================================================================================
uint32_t unixGetDate(){
		return 	((uint32_t)(unixID.weekDay)<<24) | ((uint32_t)(unixID.day)<<16) | ((uint32_t)(unixID.month)<<8) | (uint32_t)(unixID.year);};


//=================================================================================================
//						16. Преобразование timeUNIX во время и дату.
//=================================================================================================
void   unixGetFromUnixTime(RT_HW_STRUCT_UNIX_ID &id, uint32_t vTimeUNIX, uint8_t vZone){
      (void)id;	(void)vTimeUNIX;
//-------------------------------------------------------------------------------------------------
  uint8_t  b0;
  uint16_t w0,w1,w2,w3,w4; 
  uint32_t d0,d1;
//-------------------------------------------------------------------------------------------------
  id.zone=vZone;							//--Сохранение часового пояса;
  id.timeUNIX=vTimeUNIX;					//--Сохранение timeUNIX (кол-во секунд с 01.01.1970 по Гринвичу);								
  d0=id.timeUNIX + (3600*id.zone); //--Сохранение timeZone (кол-во секунд с 01.01.1970 по указанному часовому поясу);
  id.seconds = d0 % 60UL; d0 /= 60UL;		//--Сохранение секунд;
  id.minutes = d0 % 60UL; d0 /= 60UL;		//--Сохранение минут;
  id.hours   = d0 % 24UL; d0 /= 24UL;		//--Сохранение часов;	  
  id.weekDay =(d0 + 4) % 7; 				//--Сохранение дня недели; 
  if (!id.weekDay) {id.weekDay = 7;} 		
  d1         = d0 + 719468;
  b0         = d1 / 146097ul;
  w0         = d1 - b0 * 146097ul;
  w1         =(w0 - w0 / 1460 + w0 / 36524 - w0 / 146096) / 365;
  w2         = w1 + b0 * 400;
  w3         = w0 -(w1 * 365 + w1 / 4 - w1 / 100);
  w4         =(w3 * 5 + 2) / 153;			
  id.day     = w3 - (w4 * 153 + 2) / 5 + 1;	//--Сохранение дня;
  id.month   = w4 + (w4 < 10 ? 3 : -9);		//--Сохранение месяца;
  w2        +=(id.month <= 2);
  id.year    = w2%100;  					//--Сохранение года;
};

//=================================================================================================
//									UNIX TIME
//=================================================================================================
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//								20. Получение параметров времени и даты 
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//							20.1. Получение строки с текущим временем (длина=8)
// d=0 - 4-x значный формат года; 
// d=1 - 2-x значный формат года;
//=================================================================================================
  void 	unixGetTimeHMSW(String  &str, uint8_t d=0){
	 str="";
	 if(unixID.hours<10)   {str =String('0');} str+=String(unixID.hours); 	str+=String(':');
	 if(unixID.minutes<10) {str+=String('0');} str+=String(unixID.minutes); str+=String(':');
	 if(unixID.seconds<10) {str+=String('0');} str+=String(unixID.seconds);
	 if(d){                       str+=String(' ');  str+=String(unixID.weekDay);}
};
//=================================================================================================
//							20.2. Получение текущей даты формате D:M:Y
// d=0 - 4-x значный формат года; 
// d=1 - 2-x значный формат года;
//=================================================================================================
  void 	unixGetDateDMY(String &str, uint8_t d=0){
	 str="";	 
	 if(unixID.day<10)	   {str =String('0');} str+=String(unixID.day);     str+=String('.');
	 if(unixID.month<10)   {str+=String('0');} str+=String(unixID.month);   str+=String('.');	 
	 if(unixID.year<10)    {str+='0';}
	 if(d){                                          str+=String(unixID.year%100);}
	 else {                                          str+=String(unixID.year);} 
};
//=================================================================================================
//						 	20.3. Получение текущей даты формате Y:M:D
//=================================================================================================
  void 	unixGetDateYMD(String &str, uint8_t d=0){
	 str="";	 
	 if(unixID.year<10)    {str+='0';}
	 if(d){                                          str+=String(unixID.year%100);}
	 else {                                          str+=String(unixID.year);} 
																			str+=String('.');
	 if(unixID.month<10)   {str+=String('0');} str+=String(unixID.month);   str+=String('.');
	 if(unixID.day<10)	   {str+=String('0');} str+=String(unixID.day);    
};
//=================================================================================================
//							20.4. Установка строки с моточасами в формате xx00:00:00 из переменной uint32_t
//=================================================================================================
  void 	unixGetMotoSecHMS(String &str, uint32_t time){
  uint32_t d;
	 d=time/3600UL; 			  	str =String(d) + ':';			//--Часы;
	 d=((time/60L) % 60L); 	if(d>0){str+=String(d);} 				//--Минуты;
							else   {str+=String('0') + String(d);} str+=String(':');
	 d=( time      % 60L); 	if(d>0){str+=String(d);} 				//--Секунды;
							else   {str+=String('0') + String(d);} ;					  
};
//-------------------------------------------------------------------------------------------------
  void 	unixGetMotoSecHMS(String &str){unixGetMotoSecHMS(str, shed.cntSec);};
//=================================================================================================



//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//								40. УСТАРЕВШИЕ ФУНКЦИИ 
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//						40.0.1. Форматирование строки с параметром времени (час,минута,секунда) (вспомогательная функция)
//=================================================================================================
  String getFormatTime(uint8_t vr)             {if(vr<10) {return String('0')+ String(vr);}  else {return String(vr);}};
//=================================================================================================
//						40.0.2. Форматирование строки дня недели (вспомогательная функция)
// Параметр d: =0 - возвращает пустую строку; =1 - возвращает пробел + день недели; 
//=================================================================================================
  String getFormatWeek(uint8_t vr, uint8_t d=0){if(d)     {return String(' ')+ String(vr);}  else {return "";        }};
//=================================================================================================
//						40.0.3. Форматирование строки год (вспомогательная функция)
//  Параметр d: =0 - возвращает год в формате xx; =1 - возвращает год в формате xxxx (2000+год xx); 
//=================================================================================================
  String getFormatYear(uint8_t vr, uint8_t d=0){
	if(d){return String(2000+vr);}
	if(vr<10) {return (String('0')+ String(vr));}  
	else      {return String(vr);};
  };
//=================================================================================================
//						40.1. Возвращает строку с текущим временем (длина =8 или =10)
//  Параметр d: =0 - формат xx:xx:xx; =1 - xx:xx:xx y; 
//=================================================================================================
  String  getTimeString(RT_HW_STRUCT_UNIX_ID &id, uint8_t d=0){
	String temp=getFormatTime(id.hours)   + String(':') + 
			getFormatTime(id.minutes) + String(':') + 	//--Минуты;
			getFormatTime(id.seconds) + String(' ') + 	//--Секунды; 
			getFormatWeek(id.weekDay,d); 				//--День недели 
  return temp;
  };
//-------------------------------------------------------------------------------------------------
String  getTimeString(uint8_t d=0){return  getTimeString(unixID, d);}

//=================================================================================================
//						40.2. Возвращает строку с текущей датой (длина 8 или 10)
// Параметр d: =0 - формат 01.01.24; =1 формат 01.01.24 1(день недели);
//=================================================================================================
  String 	getDateString(RT_HW_STRUCT_UNIX_ID &id, uint8_t d=0){
	String temp= getFormatTime(id.day)    + String('.') +  	//--День; 
			getFormatTime(id.month)  + String('.') +  	//--Месяц;  
			getFormatYear(id.year,d);				  	//--Год; 
	return temp;		
  };
//-------------------------------------------------------------------------------------------------
  String 	getDateString(uint8_t d=0){return getDateString(unixID, d);};

//=================================================================================================
//						40.3 Возвращает строку с моточасами в формате xx00:00:00 из переменной uint32_t
//=================================================================================================
  String  getMotoSecString(uint32_t time){
	String temp= getFormatTime( time/3600UL)      + String(':') +  	//--Часы;
			getFormatTime((time/60L) % 60L)  + String(':') + 	//--Минуты;
			getFormatTime( time      % 60UL) + String(' '); 	//--Секунды;
	return temp;	
  };
//================================================================================================= 