//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//								1. КОДИРОВЩИКИ, ДЕШИФРАТОРЫ
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//================================================================================================= 
//							 1.1. Кодировщик числа в номер бита
//================================================================================================= 
uint8_t  coder8 (uint8_t  v) {if((v==0) || (v>8)) {return 0;} uint8_t  dc=0; bitSet(dc,(v-1)); return dc;};  //-- 8-разрядный;
uint16_t coder16(uint16_t v) {if((v==0) || (v>16)){return 0;} uint16_t dc=0; bitSet(dc,(v-1)); return dc;};  //--16-разрядный;
//=================================================================================================
//							 1.2. Дешифраторы
//=================================================================================================
uint8_t  dc8 (uint8_t v){if((v>0) && (v<= 8)){return (uint8_t)1 <<(v-1);} return 0;} //-- 8-разрядный дешифратор;
uint16_t dc16(uint8_t v){if((v>0) && (v<=16)){return (uint16_t)1<<(v-1);} return 0;} //--16-разрядный дешифратор;
uint32_t dc24(uint8_t v){if((v>0) && (v<=24)){return (uint32_t)1<<(v-1);} return 0;} //--24-разрядный дешифратор;
uint32_t dc32(uint8_t v){if((v>0) && (v<=32)){return (uint32_t)1<<(v-1);} return 0;} //--32-разрядный дешифратор;

