//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//						Предложения по изменениям FLProg.
//								01.02.2025г.
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//--1--------------------------------------------------------------------------
	В профредакторе табуляция воспринимается как перевод строки.
	Это создает неудобства для комментирования.
	В проф редакторе после открывающей фигурной скобки сразу ставляется пробел.
	Это создает неудобства для комментирования.
//--2-------------------------------------------------------------------------	
	В кандидатах нет возможности создавать новые блоки.
	Мне как тестировщику это бывает не удобно.
//--3-------------------------------------------------------------------------
	А можно ли в FLProg отображать версию в которой создан проект.
	И если где в начале в комментах отразить эту информацию в скетче, то будет проще понимать проблемы пользователей, 
	которые часто выкладывают ошибки и непонятно в какой версии создан проект.
//--4-------------------------------------------------------------------------	
	Редактирую старые версии блоков консоли - на их основе делаю прикладные блоки попроще.
	Оказалось очень не просто удалять старые строки в условиях, параметрах и пр. Приходится все время подымматься к верхнему значку "Удалить".
	Упростило бы работу возможность удалять скажем по правой кнопке.
	Конечно бы хорошо было бы групповое удадение (да ис вставка с последующем редактированием) - но предложение на перспективу.
//--16-------------------------------------------------------------------------	
	Редактирую старые верси блоков консоли - на их основе делаю прикладные блоки попроще.
	Оказалось очень не просто удалять старые строки в условиях, ппараметрах и пр. Приходится всв время подымматься к верхекму знаачку удалить.
	Упростило бы работу возможность удалять скажем по правой кнопке.
	Конечно бы хорошо было бы групповое удадение (да ис вставка с последующем редактированием) - но предложение на перспективу.
	

