//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//									УСТАРЕВШАЯ ФУНКЦИЯ !!!													
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//					Функция управления запуском на выполнение внешних функций
//							(сенсоры, расширители и пр.)
// Параметры настройки в структуре RT_HW_STRUCT_SHED_TASK:
//	(uint8_t)periodLimit - ограничение частоты вызова в циклах вхождения в функцию [режимы С,A]; default=5;
//  (uint16_t)periodTask - период вызова в мс [режимы P,T,A] default=1000;
//  Режимы запуска: 
//	 'C'-запуск по внешним условиям(например изменения входных параметров для расширителя) 
//       с ограничением частоты вызова[periodLimit];
//   'P'-периодический безусловный запуск;       
//   'T'-периодический запуск по внешним условиям(как в режиме 'C')
//	 'A'-запуск по внешним условиям(как в режиме'C') или периодически 
//       (обычно с большим периодом для повышения устойчивости проекта); 		
//   'Q'-запуск в каждом цикле по внешним условиям (для быстрых процессов и для тестирования);
//   'E'-запуск в каждом цикле. Может быть использован для управления через вход EN, 
//       в т.ч. для периодического вызова события=1 на входе EN;
//   'F'-однократное выполнение. Для повтора можно установить id.first=1;
//   'N'-запуск отключен;
//  Вход:
//  run-может устанавливаться внешней функцией. run=5 - означает, что функция запущена на выполнение;
//  Выходы
//  run-  =0 нет запуска; 
//        =1 безусловный запуск; 
//        =2 будет запуск по проверке вншней функции (например по изменению выводимого параметра);
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//=================================================================================================
//
//=================================================================================================
  void setTaskID  (RT_HW_STRUCT_SHED_TASK &id, char mode, uint16_t period=1000, uint16_t Period=2500){
	id.mode=mode; 
	id.period=period; 
	id.Period=Period;
	id.custom=1; 
 };	

//=================================================================================================
//
//=================================================================================================
  uint8_t directTask (RT_HW_STRUCT_SHED_TASK &id){
//-------------------------------------------------------------------------------------------------
	if(id.run==5)   {id.cntLimit=0; id.timeBegin=id.TimeBegin=millis();} id.run=0;//-Сброс параметров времени внешней функцией и сброс параметра run;
	if(id.mode=='N'){id.run=0;   return id.run;}					//--Pежим "Отключено";
	if(!id.extEN)   {id.run=0;   id.first=1; return id.run;}		//--Блокировка по входу EN=0, выход run=0;
//--------------------------------------------------------------------------------------------------
	if(id.first==1) {id.first=0; id.agoEN=id.extEN; id.cntLimit=0;	//--Инициализация и сброс параметров; 
					if(id.period<2){id.period=2;}					//--Нормализация периода [P,T,A];                 
					id.cntLimit=0; id.timeBegin=millis(); 			//--Нормализация периода [P,T,A];				 
					id.run=1;   return id.run;} 					//--Выход run=1; 
//-------------------------------------------------------------------------------------------------
	if(id.mode=='F'){            return id.run;} 					//--Выполняется однократно по first=1;
	if(id.mode=='E'){id.run=1;   return id.run;} 					//--Выполняется в каждом цикле;
	if(id.mode=='Q'){id.run=2;   return id.run;} 					//--Выполняется в каждом цикле при изменении во внешней функции;
//-------------------------------------------------------------------------------------------------
	if(id.mode=='C'){if(++id.cntLimit>=id.periodLimit){id.cntLimit=0; 				id.run=2;}   return id.run;}	//--По изменению во внешней функции;
	if(id.mode=='P'){if(++id.cntLimit>=id.periodLimit){id.cntLimit=0; 
					 if(getPastMs(id.timeBegin)>id.period){id.timeBegin=millis();	id.run=1;}}  return id.run;}	//--Периодический безусловный запуск;
	if(id.mode=='T'){if(++id.cntLimit>=id.periodLimit){id.cntLimit=0; 
					 if(getPastMs(id.timeBegin)>id.period){id.timeBegin=millis();	id.run=2;}}  return id.run;}	//--Периодический запуск по изменению во внешней функции; 
	if(id.mode=='A'){if(++id.cntLimit<id.periodLimit)                                           {return id.run;} 	//--По изменению во внешней функции или периодическии;
					 id.cntLimit=0;																					//--
					 if(id.period==0)                                              {id.run=2;    return id.run;} 	//--При period==0              по изменению во внешней функции;
				  	 if(getPastMs(id.timeBegin)>id.period){id.timeBegin=millis();	id.run=2;    return id.run;}	//--При period>0  периодически по изменению во внешней функции;
					 if(id.Period==0)                                              {id.run=1;    return id.run;} 	//--При Period==0 выполнение;
				     if(getPastMs(id.TimeBegin)>id.Period){id.TimeBegin=millis();	id.run=1;    return id.run;}	//--При Period>0  периодически выполнение;
					}
//-------------------------------------------------------------------------------------------------
	return id.run;
  };	//++++END directTask 
//=================================================================================================