//
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//					Функция управления запуском на выполнение внешних функций
//							(сенсоры, расширители и пр.)
//  Режимы запуска: 
//	 'C'-запуск по внешним условиям с ограничением частоты вызова.;
//   'P'-периодический безусловный запуск;       
//   'T'-периодический запуск по внешним условиям(как в режиме 'C')
//	 'A'-запуск по внешним условиям(как в режиме'C') или периодически 
//       (обычно с большим периодом для повышения устойчивости проекта); 		
//   'Q'-запуск в каждом цикле по внешним условиям (для быстрых процессов и для тестирования);
//   'E'-запуск в каждом цикле. Может быть использован для управления через вход EN, 
//       в т.ч. для периодического вызова события=1 на входе EN;
//   'F'-однократное выполнение. Для повтора можно установить id.first=1;
//   'N'-запуск отключен;



//   'E'-запуск в каждом цикле. Может быть использован для управления через вход EN, 
//       в т.ч. для периодического вызова события=1 на входе EN;
//   'F'-однократное выполнение. Для повтора можно установить id.first=1;
//   'P'-периодический безусловный запуск;      
//	 'C'-запуск по внешним условиям(например изменение параметров) с ограничением частоты запуска;
//   'T'-запуск по внешним условиям(например изменение параметров) с ограничением периода запуска;
//	 'A'-запуск по внешним условиям(например изменение параметров) с ограничением периода запуска
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//=================================================================================================
//							1. ЗАПУСК ЗАДАЧИ В КАЖДОМ ЦИКЛЕ (E)
//=================================================================================================
  void directTaskE (RT_HW_STRUCT_DIRECT_TaskE_ID &id, uint8_t extEN=1){
	id.run=0;    
	if(extEN)   {id.run=1;}
  };
//=================================================================================================
//							2. ЗАПУСК ЗАДАЧИ ОДНОКРАТНЫЙ (F)
//=================================================================================================
  void directTaskF (RT_HW_STRUCT_DIRECT_TaskF_ID &id, uint8_t extEN=1){
	id.run=0; 
	if(extEN)   {if(id.agoEN!=extEN){id.agoEN=extEN; id.run=1;}}	
  };
//=================================================================================================
//							3.   ЗАПУСК ЗАДАЧИ ПЕРИОДИЧЕСКИЙ (P)
//=================================================================================================
//-------------------------------------------------------------------------------------------------
//							3.1. Запуск задачи периодический (P) без пропуска событий
//-------------------------------------------------------------------------------------------------
  void directTaskP (RT_HW_STRUCT_DIRECT_TaskP_ID &id, uint16_t period, uint8_t extEN=1){
    id.run=0;
    if(!extEN)         {id.agoEN=extEN;                                  				 return;}
    if(id.agoEN!=extEN){id.agoEN=extEN; 				id.timeBegin=millis(); id.run=1; return;}	
    if(getPastMs(id.timeBegin)>period) {				id.timeBegin=millis(); id.run=1;        }
  };
//-------------------------------------------------------------------------------------------------
//							3.2. Запуск задачи периодический (P) с пропуском событий(qntPass)
//-------------------------------------------------------------------------------------------------
  void directTaskP (RT_HW_STRUCT_DIRECT_TaskP_ID &id, uint8_t qntPass, uint16_t period, uint8_t extEN=1){
	id.run=0;
    if(!extEN)         {id.agoEN=extEN;                                  			     return;}
    if(id.agoEN!=extEN){id.agoEN=extEN; id.cntPass=0; 	id.timeBegin=millis(); id.run=1; return;}	
	if(++id.cntPass<qntPass)															{return;}			     
    id.cntPass=0; 
    if(getPastMs(id.timeBegin)>period) {				id.timeBegin=millis(); id.run=1;        }	
  };
//=================================================================================================
//							4.   ЗАПУСК ЗАДАЧИ ПО ИЗМЕНЕНИЮ ВНЕШНИХ ПЕРЕМЕННЫХ (C) 
//=================================================================================================
//-------------------------------------------------------------------------------------------------
//							4.1. Запуск задачи по изменению внешних перемен(C) без пропуска событий
//-------------------------------------------------------------------------------------------------
  void directTaskC (RT_HW_STRUCT_DIRECT_TaskC_ID &id, uint8_t extEN=1){
	id.run=0;
    if(!extEN)         		 {id.agoEN=extEN;           return;}
    if(id.agoEN!=extEN)		 {id.agoEN=extEN; id.run=1; return;}					     
  };

//-------------------------------------------------------------------------------------------------
//							4.2. Запуск задачи по изменению внешних перемен(C) с пропуском событий
//-------------------------------------------------------------------------------------------------
  void directTaskC (RT_HW_STRUCT_DIRECT_TaskC_ID &id, uint8_t qntPass, uint8_t extEN=1){
	if(id.run==5) {id.cntPass=0;}   					//-Сброс счетчика пропусков внешней функцией;
	id.run=0;
    if(!extEN)         		 {id.agoEN=extEN;                          return;}
    if(id.agoEN!=extEN)		 {id.agoEN=extEN; id.cntPass=0;  id.run=1; return;}	
	if(++id.cntPass>=qntPass){				  id.cntPass=0;  id.run=2; return;}					     
  };
//=================================================================================================
//						5. ЗАПУСК ЗАДАЧИ ПО ИЗМЕНЕНИЮ И/ИЛИ ПЕРИОДИЧЕСКИ(T)
//=================================================================================================  
//-------------------------------------------------------------------------------------------------
//						5.1. Запуск задачи по изменению и/или периодически(T) без пропуска событий
//-------------------------------------------------------------------------------------------------
  void directTaskT (RT_HW_STRUCT_DIRECT_TaskT_ID &id, uint16_t period, uint8_t extEN=1){
	if(id.run==5) {id.cntPass=0; id.timeBegin=millis();}   //-Сброс счетчика пропусков внешней функцией;
	id.run=0;
	if(!extEN)   						{id.run=0;   					  id.first=1; return;}
	if(id.first==1)                   	{id.run=1; id.timeBegin=millis(); id.first=0; return;} 
	if(getPastMs(id.timeBegin)>period)	{id.run=1; id.timeBegin=millis();			  return;}
  };  
//-------------------------------------------------------------------------------------------------
//						5.2.  Запуск задачи по изменению и/или периодически(T) c пропуском событий
//-------------------------------------------------------------------------------------------------
  void directTaskT (RT_HW_STRUCT_DIRECT_TaskT_ID &id, uint8_t qntPass,  uint16_t period, uint8_t extEN=1){
	if(id.run==5) {id.cntPass=0; id.timeBegin=millis();}   //-Сброс счетчика пропусков внешней функцией;
	id.run=0;
	if(!extEN)   					  	{id.run=0;   					              	id.first=1; return;}
	if(id.first==1)                   	{id.run=1; id.timeBegin=millis(); id.cntPass=0; id.first=0; return;} 
	if(++id.cntPass>=qntPass)         	{id.run=2; 						  id.cntPass=0;             return;}
	if(getPastMs(id.timeBegin)>period)	{id.run=1; id.timeBegin=millis();							return;}
  };
//=================================================================================================
//						6. ЗАПУСК ЗАДАЧИ по изменению c пропуском событий и ограничением периода
//=================================================================================================


//=================================================================================================
//						6. Управление запуском по изменению c пропуском событий и ограничением периода
//=================================================================================================
//=================================================================================================
//						6. Управление запуском по изменению c пропуском событий и ограничением периода
//=================================================================================================
  void directTaskA (RT_HW_STRUCT_DIRECT_TaskT_ID &id, uint8_t qntPass,  uint16_t period, uint8_t extEN=1){
  if(id.run==5) {id.cntPass=0; id.timeBegin=millis();}   //-Сброс счетчика пропусков внешней функцией;
  id.run=0;
  if(!extEN)   							{id.run=0;   					                  id.first=1; return;}
  if(id.first==1)                     	{id.run=1; id.cntPass=0; id.timeBegin=millis(); id.first=0;} 
  if(++id.cntPass>=qntPass)           	{id.run=2; id.cntPass=0;                                    return;}
  if(getPastMs(id.timeBegin)>period)	{id.run=1; id.timeBegin=millis();}
  };


//=================================================================================================
