//#################################################################################################
//								ДИСПЕТЧЕР ЗАДАЧ
//			
//#################################################################################################
  #define RT_HW_SHED_periodQuick  (uint16_t)10000		//--Период оперативных задач;
  #define RT_HW_SHED_periodFast   (uint16_t)25000		//--Период быстрых задач;

//=================================================================================================
//										1.Диспетчер задач 					   1	 2	   4	 8      16     32  	 6 4    128
//  uint8_t  shead.event=0;		//--Флаги событий  по времени: bit.x: loop(), 10ms,  25ms, 50ms, 100ms, 250ms, 500ms, 1000ms; 
//  uint8_t  shead.meander=0;	//--Флаги меандров по времени: bit.x: loop(), 10ms,  25ms, 50ms, 100ms, 250ms, 500ms, 1000ms; 
//  uint8_t  shead.run=0; 		//--Флаги запуска задач:       bit.x: frdm,   quick, fast, t50,  back,  slow,  t500,  t1000; 
//=================================================================================================
//=================================================================================================
//										1.Диспетчер задач c внешней структурой
//=================================================================================================
  void sheduler(){
//-------------------------------------------------------------------------------------------------
//										1.1.Сброс состояний
//-------------------------------------------------------------------------------------------------
	shed.ready=1; 
	shed.event=0; 
	shed.quick.num=shed.fast.num=shed.slow.num=shed.back.num=shed.frdm.num=0; shed.eventSec=0;	//--Сброс параметров;
                                                           ++shed.cntCycle;   shed.control^=1; 	//--Контрольный сигнал loop();														   
//-------------------------------------------------------------------------------------------------
//										1.2.Вызов диспетчера задач по програмному таймеру
//-------------------------------------------------------------------------------------------------
	if(shedTask.count()>0){shedTask.pool();}

//-------------------------------------------------------------------------------------------------
//										1.3.Приоритетные задачи (системные)
//-------------------------------------------------------------------------------------------------
	if(++shed.sysQuick.num>shed.sysQuick.qnt){shed.sysQuick.num=1;}
	if(++shed.sysFast.num >shed.sysFast.qnt) {shed.sysFast.num=1;}
	if(++shed.sysSlow.num >shed.sysSlow.qnt) {shed.sysSlow.num=1;}	
//-------------------------------------------------------------------------------------------------
//										1.3.Оперативные задачи 10ms
//	uint8_t  blink1=1,blink10=1,blink25=1,blink50=1,blink100=1,blink250=1,blink500=1,blink1000=1; //--Состояние меандров 10,25,50,100,250,500,1000ms;
//-------------------------------------------------------------------------------------------------
	if(periodUs(shed.timeStart10,10000)) {
		shed.run^=1;        
		shed.event^=1;        
		shed.blink10^=1;   //--event.bit0, blink10;
		if(shed.cntConsole){shed.cntConsole--;}	//--Уменьшение значения счетчика для синхронизации  с консолью;
//-------------------------------------------------------------------------------------------------
//										1.3.1. Секундные события 
//-------------------------------------------------------------------------------------------------
		if(++shed.workSec>=100){
			shed.workSec=0;  					//--Обработка секундных событий; 
			shed.cntSec++;  					//--Счетчик секунд (Мотосекунды проекта);
			shed.eventSec=1; 					//--Обработка секундных событий;
			shed.blink1000^=1;	 				//--Обработка секундного меандра;
			shed.event^=(1<<6); 				//--Установка бит 6 - событие 1000мс; 
			shed.blinkSec^=1;	 				//--Обработка секундного меандра (УСТАРЕВШИЙ);
			shed.cycle=shed.cntCycle;   
			shed.cntCycle=0;  
			shed.smallCycle =(uint16_t)round(((float)shed.cycle)/1000);	//--Обработка быстродействия loop();
			//----------------------------------------------------------------
			if(shed.isLoop1){	 				//--Обработка быстродействия loop1();																				//--Обработка 
				shed.cycle1=shed.cntCycle1; 
				shed.freshSec1=1; 
				shed.smallCycle1=(uint16_t)round(((float)shed.cycle1)/1000);
			};
		}
//- - - - - - - - - - - - - - - - - - -  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
   }	//--END Оперативные задачи 10ms;
//-------------------------------------------------------------------------------------------------
	if(periodUs(shed.timeStart25,25000)){
		shed.run^=(1<<1); 						//--Событие Run -  bit.1
		shed.event^=(1<<1); 					//--Событие 25мс - bit.1
		shed.blink25^=1;   						//--Fast task,blink25  25ms;
        if(!shed.blink25)  {
			shed.blink50^=1; 					//--blink50 50ms;
			shed.event^=(1<<2); 			    //--Событие 50мс - bit.2
		}             
		if(++shed.cnt250 >=10){
			shed.cnt250=0;         
			shed.run^=(1<<2); 
			shed.event^=(1<<4); 				//--Установка бит 4 - событие 250мс; 
			shed.blink250^=1;  					//--Slow task,blink25  25ms;	
            if(!shed.blink250){
				shed.blink500^=1;
				shed.event^=(1<<5); 			//--Установка бит 5 - событие 500мс; 
				unixUpdateTime();				
			}
			
		} 
		if(++shed.cnt100 >= 4){					//--Back task,blink100 100ms;
			shed.cnt100=0;	 	   
			shed.run^=(1<<3); 
			shed.event^=(1<<3); 
			shed.blink100^=1;
		} 		
	}	
//-------------------------------------------------------------------------------------------------
	if(shed.isLoop1){if(++shed.frdm1.cnt  >shed.frdm1.qnt) {shed.frdm1.cnt =1;} shed.frdm1.num =shed.frdm1.cnt;}		//--Генератор номера свободной задачи для loop1(); 
//-------------------------------------------------------------------------------------------------
//											Обработка вызова задач 
//-------------------------------------------------------------------------------------------------
	if(shed.run){
//		if(bitRead(shed.run,4))   {if(++shed.tick.cnt >shed.tick.qnt) {shed.tick.cnt =1;} shed.tick.num=shed.tick.cnt;   bitClear(shed.run,4); return;}
		if(bitRead(shed.run,0))   {if(++shed.quick.cnt>shed.quick.qnt){shed.quick.cnt=1;} shed.quick.num=shed.quick.cnt; bitClear(shed.run,0); return;}
		if(bitRead(shed.run,1))   {if(++shed.fast.cnt >shed.fast.qnt) {shed.fast.cnt =1;} shed.fast.num =shed.fast.cnt;  bitClear(shed.run,1); return;}
		if(bitRead(shed.run,2))   {if(++shed.slow.cnt >shed.slow.qnt) {shed.slow.cnt =1;} shed.slow.num =shed.slow.cnt;  bitClear(shed.run,2); return;}
		if(bitRead(shed.run,3))   {if(++shed.back.cnt >shed.back.qnt) {shed.back.cnt =1;} shed.back.num =shed.back.cnt;  bitClear(shed.run,3); return;}
	}
//-------------------------------------------------------------------------------------------------
	else{  
		 if(++shed.frdm.cnt  >shed.frdm.qnt) {
			  shed.frdm.cnt =1;} 
			  shed.frdm.num =shed.frdm.cnt;                      
			  if(!shed.isLoop1){ shed.frdm1.num=shed.frdm.num;}	//--Для совместимости проектов без loop1();							
		return;
		}
};
//=================================================================================================
//													API sheduler
//=================================================================================================
	uint8_t	 getShedReady()			{return (shed.ready);	   };	//--Готовность диспетчера. Устанавливается после первого вызова диспетчера;
//-------------------------------------------------------------------------------------------------
//			Возвращают события 10,25,50,100,250,500,1000 мс.
//			Только для внутренних функций - в FLProg не рекомендуется к использованию
//-------------------------------------------------------------------------------------------------
	uint8_t  getShedControl()    	{return (shed.control)  &1;};	//--Контроль loop();
	uint8_t  getShedEvent10()    	{return (shed.event)    &1;};	//--Событие 10 мс;
	uint8_t  getShedEvent25()    	{return (shed.event>>1) &1;};	//--Событие 25 мс;
	uint8_t  getShedEvent50()    	{return (shed.event>>2) &1;};	//--Событие 50 мс;
	uint8_t  getShedEvent100()   	{return (shed.event>>3) &1;};	//--Событие 100 мс;
	uint8_t  getShedEvent250()   	{return (shed.event>>4) &1;};	//--Событие 250 мс;
	uint8_t  getShedEvent500()   	{return (shed.event>>5) &1;};	//--Событие 500 мс;
	uint8_t  getShedEvent1000()  	{return (shed.event>>6) &1;};	//--Событие 1000 мс;
//-------------------------------------------------------------------------------------------------
//			Возвращают меандры 10,25,50,100,250,500,1000 мс. Длительность соответствует полупериоду.
//-------------------------------------------------------------------------------------------------
	uint8_t  getShedBlink10()    	{return  shed.blink10;};	//--Меандр 10   мс;
	uint8_t  getShedBlink25()    	{return  shed.blink25;};	//--Меандр 25   мс;
	uint8_t  getShedBlink50()    	{return  shed.blink50;};	//--Меандр 50   мс;
	uint8_t  getShedBlink100()    	{return  shed.blink100;};	//--Меандр 100  мс;
	uint8_t  getShedBlink250()    	{return  shed.blink250;};	//--Меандр 250  мс;
	uint8_t  getShedBlink500()    	{return  shed.blink500;};	//--Меандр 500  мс;
	uint8_t  getShedBlink1000()    	{return  shed.blink1000;};	//--Меандр 1000 мс;	
//-------------------------------------------------------------------------------------------------
//			Возвращают быстродействие CORE0, CORE1  циклах loop() в сек
//-------------------------------------------------------------------------------------------------
	uint32_t getShedSpeed()      	{return shed.cntCycle;};	//--Быстродействие Core0;
	uint32_t getShedSpeed0()     	{return shed.cntCycle;};	//--Быстродействие Core0;		
	uint16_t getShedSpeed_small() 	{return shed.smallCycle;};  //--Быстродействие Core0/1000;
	uint16_t getShedSpeed0_small()	{return shed.smallCycle;};  //--Быстродействие Core0/1000;	
	uint32_t getShedSpeed1()      	{return shed.cntCycle1;};	//--Быстродействие Core1;	
	uint16_t getShedSpeed1_small() 	{return shed.smallCycle1;}; //--Быстродействие Core1/1000;	
//-------------------------------------------------------------------------------------------------
//			Возвращает мото-секунды (время работы процессора в сек)
//-------------------------------------------------------------------------------------------------
	uint32_t getShedMotoSec()   	{return shed.cntSec;};		//--Мотосекунды;		
//=================================================================================================
	
	