#include "RT_HW_BASE.h"
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//									КОНСТРУКТОР
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
RT_HW_BASE:: RT_HW_BASE(){







//=================================================================================================
//							1.Установка базовых параметров:
//                     ID контроллера (случайное число), eth1.MAC базовый,параметров времени 
//=================================================================================================
	#if !defined(RT_HW_PLC_CODE)
		board.mode=10;						//--Корректировка типа платы - PLC;
	#endif
//-------------------------------------------------------------------------------------------------

	#if !defined(RT_HW_PERMIT_COMPACT)
		board.id=genRandom(32);				//--Генератор ID платы (32-битовое случайное число);
	//  ethGenMacAdr(1);					//--Генерация случайного MAC-адреса(buff.mac[6]);
		unixSetSystemTimeDate();			//--Получение параметра времени компиляции
		unixSetTimeUNIX();					//--Получение unixTimе из текущей даты;
		unixID.timeSTART=unixID.timeUNIX; 	//--Сохранение времени загрузки проекта;
		unixID.timeEXT  =unixID.timeUNIX; 	//--Сохранение времени загрузки проекта;  
		unixID.runEXT=1;					//--Установка флага для запуска загрузки времени из unixID.timeEXT;
		unixSetTotal();						//--Установка параметров времени (с учетом состояния unixID.runEXT, сбрасывает его);
	#endif
//=================================================================================================
  
//=================================================================================================
//							8.M5Stack-Core-ESP32:: 
//  DAC сбрасывается для  того, чтобы при загрузке не было лишних звуков из встроеннного пьезо-излучателя;
//=================================================================================================
	#if defined(RT_HW_PERMIT_DAC) && defined(RT_HW_BOARD_M5Stack_Core_ESP32) 
		//  dacWrite(25,0);
	#endif 
 //================================================================================================
//							9.Инициализация параметров устройств связи (UART,i2c,SPI)
//=================================================================================================
	#if defined(RT_HW_LINK_UART)
		uartInitParamAll();		//--Установка и настройка параметров по умолчанию для UART;
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_LINK_I2C)
		i2cInitParamAll();		//--Установка и настройка параметров по умолчанию для i2c;
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_LINK_SPI)
		spiInitParamAll();		//--Установка и настройка параметров по умолчанию для SPI;
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_LINK_SPN)
		spnInitParamAll();		//--Установка и настройка параметров по умолчанию для SPN;
	#endif	
//=================================================================================================
};	//--End КОНСТРУКТОРА	
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							 СОЗДАНИЕ ВНЕШНЕГО ОБЪЕКТА
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
RT_HW_BASE 		RT_HW_Base;									
//-------------------------------------------------------------------------------------------------	