//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//						             RT_HW_BASE.h
// ecoins@mail.ru
// flprog@mail.ru
// 02.03.2020г.
// 10.06.2024г.
// 14.02.2025г. 06.04.2025г. .... 30.07.2025г.
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef   RT_HW_BASE_h
#define   RT_HW_BASE_h
//=================================================================================================
  #define   RT_HW_BASE_VER_NUM    	(uint16_t)648			//--Version number;
  #define   RT_HW_BASE_VER_NAME 	"v.6.4.8 15.09.2025"	//--Version name;
//=================================================================================================
//								1.Connecting basic system libraries
//=================================================================================================
  #if defined(ARDUINO) && (ARDUINO >= 100) 
	#include <Arduino.h>		//--Main Arduino library for new boards;
  #else
	#include <WProgram.h>		//--Main Arduino library for outdated boards;
  #endif
//------------------------------------------------------------------------------------------------
	#include <stdint.h>			//--Standard declaration of integer types and macros;	   
//=================================================================================================

//=================================================================================================
//										0010. МАКРОСЫ, общие массивы в PROGMEM 
//=================================================================================================
  #include "API_0010_DEFINE/DEFINE_0100_GENERAL.hpp"    	//--Макросы общие; 
  #include "API_0010_DEFINE/DEFINE_0110_LINK.hpp"			//--Макросы для коммуникаций [UART,i2c,SPI,CAN]; 
  #include "API_0010_DEFINE/DEFINE_0300_PGM_TOTAL.hpp"		//--Массивы в PROGMEM общие; 
  #include "API_0010_DEFINE/DEFINE_0500_FLPROG.hpp"			//--Макросы для совместимости с FLProg;
//=================================================================================================
//										0100. Выбор CORE (программное ядро для контроллера)
//=================================================================================================
  #include "API_0100_CORE/CORE_0010_STRUCTURE.hpp"					//--Структуры общие;
  #include "API_0100_CORE/CORE_0100_AVR.hpp"						//--CORE AVR;
  #include "API_0100_CORE/CORE_0200_SAM3X.hpp"						//--CORE SAM3X;
  #include "API_0100_CORE/CORE_0400_ESP8266.hpp"					//--CORE ESP8266;
  #include "API_0100_CORE/CORE_0500_ESP32.hpp"	  					//--CORE ESP32;
  #include "API_0100_CORE/CORE_0600_STM32.hpp"						//--CORE STM32;
  #include "API_0100_CORE/CORE_0700_RP2040.hpp"						//--CORE RP2040; 
//-------------------------------------------------------------------------------------------------
  #include "API_0100_CORE/CORE_9000_ANON.hpp"						//--CORE ANON(только функции Arduino);  
//=================================================================================================
//										0200. Выбор PLC
//=================================================================================================
  #include "API_0200_BOARD_PLC/PLC_0100_AVR_MEGA2560_xxxx.hpp"		//--PLC AVR MEGA2560;
  #include "API_0200_BOARD_PLC/PLC_0600_STM32_FLE_xxxx.hpp"			//--PLC FLE;
  #include "API_0200_BOARD_PLC/PLC_0602_STM32_FLE1_xxxx.hpp"		//--PLC FLE1;
  #include "API_0200_BOARD_PLC/PLC_0604_STM32_FLE4_xxxx.hpp"		//--PLC FLE4;
  #include "API_0200_BOARD_PLC/PLC_0610_STM32_FLE4C_30Mx.hpp"		//--PLC FLE4C-30MT, 30MR;
  #include "API_0200_BOARD_PLC/PLC_0620_STM32_FLE4F_xxxx.hpp"		//--PLC FLE4F;
//=================================================================================================
//										0310. Выбор плат AVR
//=================================================================================================
  #include "API_0310_BOARD_AVR/BOARD_0101_AVR_UNO.hpp"				//--AVR UNO;
  #include "API_0310_BOARD_AVR/BOARD_0102_AVR_NANO.hpp"				//--AVR Nano;
  #include "API_0310_BOARD_AVR/BOARD_0103_AVR_MINI.hpp"				//--AVR Mini;
  #include "API_0310_BOARD_AVR/BOARD_0104_AVR_PRO.hpp"				//--AVR Pro;  
  #include "API_0310_BOARD_AVR/BOARD_0105_AVR_MEGA2560.hpp"  		//--AVR MEGA250; 
  #include "API_0310_BOARD_AVR/BOARD_0190_AVR_ANON.hpp"				//--AVR ANON; 
//=================================================================================================
//										0320. Выбор плат SAMX
//=================================================================================================
  #include "API_0320_BOARD_SAM3X/BOARD_0101_SAMX_DUE.hpp"			//--SAMX DUE;
  #include "API_0320_BOARD_SAM3X/BOARD_0190_SAMX_ANON.hpp"			//--SAMX ANON; 
//=================================================================================================
//										0340. Выбор плат ESP8266
//=================================================================================================
  #include "API_0340_BOARD_ESP8266/BOARD_0100_ESP8266_TOTAL.hpp"	//--Общие для ESP8266;
  #include "API_0340_BOARD_ESP8266/BOARD_0101_ESP8266_GENERIC.hpp"	//--ESP8266 GENERIC;   
  #include "API_0340_BOARD_ESP8266/BOARD_0190_ESP8266_ANON.hpp" 	//--ESP8266 ANON; 
//=================================================================================================
//										0351. Выбор плат ESP32S
//=================================================================================================
  #include "API_0351_BOARD_ESP32S/BOARD_0101_ESP32_DEV.hpp"			//--ESP32S;
  #include "API_0351_BOARD_ESP32S/BOARD_0102_ESP32_STAMP_PICO.hpp"	//--ESP32-STAMP-PICO; 
//=================================================================================================
//										0352. Выбор плат ESP32S2
//=================================================================================================
  #include "API_0352_BOARD_ESP32S2/BOARD_0101_ESP32S2_DEV.hpp"		//--ESP32S2;
//=================================================================================================
//										0353. Выбор плат ESP32S3
//=================================================================================================
  #include "API_0353_BOARD_ESP32S3/BOARD_0101_ESP32S3_DEV.hpp"		//--ESP32S3;
//=================================================================================================
//										0354. Выбор плат ESP32C3
//=================================================================================================
  #include "API_0354_BOARD_ESP32C3/BOARD_0101_ESP32C3_DEV.hpp"			//--ESP32C3 Dev Module;
  #include "API_0354_BOARD_ESP32C3/BOARD_0102_ESP32C3_STAMP.hpp"		//--ESP32C3 STAMP-C3,C3U; 
  #include "API_0354_BOARD_ESP32C3/BOARD_0103_ESP32C3_TTGO.hpp"			//--ESP32C3 TTGO; 
  #include "API_0354_BOARD_ESP32C3/BOARD_0104_ESP32C3_LUATOS.hpp"		//--ESP32C3 Luatos USB, Classic;    
  #include "API_0354_BOARD_ESP32C3/BOARD_0109_ESP32C3_SuperMini.hpp"	//--ESP32C3 Super Mini;
//=================================================================================================
//										0358. Выбор плат ESP32C3
//=================================================================================================
  #include "API_0358_BOARD_ESP32_M5/BOARD_0101_ESP32S_M5Stack_CORE.hpp"	//--ESP32-M5StackCore; 
  #include "API_0358_BOARD_ESP32_M5/BOARD_0102_ESP32S_M5_ATOM.hpp"		//--ESP32-ATOM; 

//=================================================================================================
//										0359. Выбор неопознанной плат ESP32-ANON
//=================================================================================================
  #include "API_0359_BOARD_ESP32_ANON/BOARD_0101_ESP32_ANON.hpp"   //--ESP32-ANON;
//=================================================================================================
//										0361. Выбор плат STM32F103Cx
//================================================================================================= 
  #include "API_0361_BOARD_STM32F1/BOARD_0101_STM32F103Cx.hpp"		//--STM32F103Cx;
  #include "API_0361_BOARD_STM32F1/BOARD_0102_STM32F103Rx.hpp"		//--STM32F103Rx;
  #include "API_0361_BOARD_STM32F1/BOARD_0103_STM32F103Vx.hpp"		//--STM32F103Vx;
//=================================================================================================
//										0362. Выбор плат STM32L1
//================================================================================================= 
  #include "API_0362_BOARD_STM32L1/BOARD_0101_STM32L151Cx.hpp"		//--STM32L151Cx;
//=================================================================================================
//										0364. Выбор плат STM32F4x1Cx
//=================================================================================================
  #include "API_0364_BOARD_STM32F4/BOARD_0101_BlackPill_F401Cx.hpp"		//--STM32F401Cx;
  #include "API_0364_BOARD_STM32F4/BOARD_0102_BlackPill_F411CE.hpp"		//--STM32F411Cx;
  #include "API_0364_BOARD_STM32F4/BOARD_0103_STM32F4x1Cx_Generic.hpp"	//--STM32F401C_Generic;
//=================================================================================================
//										0365. Выбор плат STM32F407Vx
//=================================================================================================  
  #include "API_0364_BOARD_STM32F4/BOARD_0104_STM32F407Vx.hpp"			//--STM32F407Vx;  
  #include "API_0364_BOARD_STM32F4/BOARD_0105_STM32F446RETx.hpp"			//--STM32F407Vx;  
//=================================================================================================
//										0367. Выбор плат STM32H7xxx
//================================================================================================= 
  #include "API_0367_BOARD_STM32H7/BOARD_0101_STM32H743Vx.hpp"		//--STM32H743Vx;   
  #include "API_0367_BOARD_STM32H7/BOARD_0102_STM32H750Vx.hpp"		//--STM32H750Vx; 
//=================================================================================================
//										0369. Выбор плат STM32 ANON
//=================================================================================================
  #include "API_0369_BOARD_STM32_ANON/BOARD_0101_STM32_ANON.hpp"	//--STM32 ANON;    
//=================================================================================================
//										0370. Выбор стандартных плат RP2040
//=================================================================================================
  #include "API_0370_BOARD_RP2040/BOARD_0101_RP2040.hpp"			//--RP2040;
//=================================================================================================
//										0390. Выбор платы ANON
//=================================================================================================  
  #include "API_0390_BOARD_ANON/BOARD_0101_MCU_ANON.hpp"			//--MCU ANON; 
//=================================================================================================

//=================================================================================================
//=================================================================================================
//										0500. Управление подключения интерфейсов (для debugging)
//=================================================================================================
  #define RT_HW_LINK_UART					//--Разрешение использования функций UART;
  #define RT_HW_LINK_I2C					//--Разрешение использования функций I2C;
  #define RT_HW_LINK_SPI					//--Разрешение использования функций SPI; 
  #define RT_HW_LINK_SPN					//--Разрешение использования функций SPN; 
  #define RT_HW_PERMIT_TASK_TIMER			//--Разрешение функций прерываний для класса RT_HW_Timer;
//=================================================================================================

//=================================================================================================
//								8.Подключение системных библиотек
//=================================================================================================
  #if defined(RT_HW_CORE_AVR)
		#include <avr/pgmspace.h>			//--Библиотека для работы с PROGMEM;
		#include <util/crc16.h>      		//--Используется для подсчета CRC16 1-Wire;
  #endif
//-------------------------------------------------------------------------------------------------
  #if defined(RT_HW_LINK_UART) && (defined(RT_HW_PERMIT_UART100) || defined(RT_HW_PERMIT_UART101)) 
	 #define  RT_HW_CREATE_UARTS	
		#include <SoftwareSerial.h>	  		//--Библиотека программного UART (SoftwareSerial);
  #endif  
//-------------------------------------------------------------------------------------------------  
  #if defined(RT_HW_LINK_UART) && defined(RT_HW_CORE_ESP32) && defined(RT_HW_PERMIT_UART200)
	 #define  RT_HW_CREATE_UART200_ESP32
	 #define  RT_HW_CREATE_UART200_ESP32_xxx
		#include "BluetoothSerial.h"		//--Библиотека Bluetooth для ESP32;
  #endif
//-------------------------------------------------------------------------------------------------
  #if defined(RT_HW_LINK_I2C) 
		#include <Wire.h>					//--Подключение библиотеки аппаратного i2c (для AVR требуется доп.память 1192/113);
 #endif
//-------------------------------------------------------------------------------------------------
  #if defined(RT_HW_LINK_I2C) && (defined(RT_HW_PERMIT_I2C100) || defined(RT_HW_PERMIT_I2C101))
	 #define  RT_HW_CREATE_I2CS   		
	 #include "SoftWire.h"					//--Подключение     библиотеки     программного i2c;
	 #include "AsyncDelay.h"				//--Вспомогательная библиотека для программного i2c;
  #endif
//-------------------------------------------------------------------------------------------------
  #if defined(RT_HW_LINK_SPI)
		#include <SPI.h>					//--Подключение библиотеки SPI;	  
  #endif
//-------------------------------------------------------------------------------------------------
 
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//									    0500. СТРУКТУРЫ 
//		Примечание: структуры для работа с пинами расположены в файлах CORE
//=================================================================================================
    #include "API_0500_STRUCTURE/STRUCT_0100_TOTAL.hpp" 		//--Структуры для работы с интерефейсами; 
	#include "API_0500_STRUCTURE/STRUCT_0210_GENERATOR.hpp" 	//--Генераторы;
    #include "API_0500_STRUCTURE/STRUCT_0220_COUNTER.hpp" 		//--Счетчики;
    #include "API_0500_STRUCTURE/STRUCT_0300_SHEDULER.hpp" 		//--Диспетчер; 
    #include "API_0500_STRUCTURE/STRUCT_0310_DIRECT_TASK.hpp" 	//--Управление задачами; 	
    #include "API_0500_STRUCTURE/STRUCT_0310_UNIX_TIME.hpp" 	//--UNIX Time; 
    #include "API_0500_STRUCTURE/STRUCT_0400_MESS.hpp" 			//--Для сообщений;
//=================================================================================================
//										0500. СТРУКТУРЫ для управления LINK
//=================================================================================================	
  	#include "API_0500_STRUCTURE/STRUCT_0510_UART.hpp" 			//--Структуры для работы с UART;
  	#include "API_0500_STRUCTURE/STRUCT_0520_I2C.hpp" 			//--Структуры для работы с i2c;
  	#include "API_0500_STRUCTURE/STRUCT_0530_SPI.hpp" 			//--Структуры для работы с SPI;
  	#include "API_0500_STRUCTURE/STRUCT_0540_SPN.hpp" 			//--Структуры для работы с SPN;	
//=================================================================================================
//										0520. Диспетчер задач по программному таймеру
//=================================================================================================	
	#include "API_0520_FUNC_SHED_TIMER/RT_HW_ShedTask.hpp"				//--Диспетчер задач по программному таймеру;

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//									8.КЛАСС   RT_HW_BASE.h
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
class RT_HW_BASE{
public:
//=================================================================================================
//								8.1. Рабочие переменные
//================================================================================================= 
	RT_HW_STRUCT_BOARD_ID		board;						//--Основные параметры платы;
	RT_HW_STRUCT_SHED_ID		shed;						//--Параметры диспетчера;  
	RT_HW_STRUCT_UNIX_ID  		unixID;						//--Время в формате UNIX;
	RT_HW_ShedTask				shedTask;					//--Диспетчер задач по программному таймеру;
//=================================================================================================
//										0610. API РАБОТЫ с PROGMEM и ОБЩИМИ ПАРАМЕТРАМИ
//=================================================================================================
	#include "API_0610_FUNC_DEFINE/API_0100_GET_PGM_TOTAL.hpp" 		//--Получение доступа к массивам PROGMEM;
	#include "API_0610_FUNC_DEFINE/API_0101_GET_PARAM_TOTAL.hpp" 	//--Получение параметров общих;
	#include "API_0610_FUNC_DEFINE/API_0105_GET_PIN_PGM.hpp"		//--Доступ к пинам в массивах PROGMEM;
	#include "API_0610_FUNC_DEFINE/API_0106_GET_PIN_NAME.hpp"		//--Доступ к именам   пинов;
//=================================================================================================
//										0615. API РАБОТЫ с параметрами PLC или BOARD_0100_ESP8266_TOTAL
//=================================================================================================
	#include "API_0615_FUNC_PLC_or_BOARD/API_0120_GET_ETHERNET.hpp" //--Получение доступа к параметрам Ethernet;
//=================================================================================================
//										0620. API РАБОТЫ С PLC (доступ к параметрам, пинам)
//=================================================================================================
	#include "API_0620_FUNC_PLC/API_0110_GET_PLC_PARAM.hpp" 		//--Получение параметров 		  PLC;
	#include "API_0620_FUNC_PLC/API_0111_GET_PLC_PIN_MAIN.hpp"		//--Доступ к основным 		пинам PLC (внешние входы/выходы);
	#include "API_0620_FUNC_PLC/API_0112_GET_PLC_PIN_ADD.hpp"		//--Доступ к дополнительным пинам PLC;
	#include "API_0620_FUNC_PLC/API_0113_GET_PLC_UART.hpp"			//--Доступ к номерам UART;
	#include "API_0620_FUNC_PLC/API_0114_GET_PLC_ETH.hpp"			//--Доступ к параметрам Ethernet;		
//=================================================================================================
//										0630. API РАБОТЫ С ПЛАТАМИ (доступ к параметрам, пинам)
//=================================================================================================
	#include "API_0630_FUNC_BOARD/API_0120_GET_BOARD_PARAM.hpp"		//--Доступ к параметрам платы;
	#include "API_0630_FUNC_BOARD/API_0121_GET_BOARD_PIN_MAIN.hpp"	//--Доступ к всем    		пинам;
	#include "API_0630_FUNC_BOARD/API_0122_GET_BOARD_PIN_ADD.hpp"	//--Доступ к дополнительным пинам PLC;
	#include "API_0630_FUNC_BOARD/API_0123_GET_BOARD_UART.hpp"		//--Доступ к номерам UART;
//	#include "API_0630_FUNC_BOARD/API_0124_GET_BOARD_ETH.hpp"		//--Доступ к параметрам Ethernet;
//=================================================================================================
//										0640. API ФУНКЦИЕ ОБЩИЕ
//=================================================================================================
	#include "API_0640_FUNC_TOTAL/FUNC_TOTAL_0010_TOTAL.hpp"			//--Норм.параметров,поиск свобод.устройств,реверс bit,пр.;   
    #include "API_0640_FUNC_TOTAL/FUNC_TOTAL_0100_TIME_PAST.hpp"		//--Расчет и контроль прошедшего времени; 
    #include "API_0640_FUNC_TOTAL/FUNC_TOTAL_0110_GENERATOR.hpp"		//--Генераторы;
    #include "API_0640_FUNC_TOTAL/FUNC_TOTAL_0120_COUNTER.hpp"			//--Счетчики; 
    #include "API_0640_FUNC_TOTAL/FUNC_TOTAL_0130_DECODER.hpp"			//--КОДИРОВЩИКИ, ДЕШИФРАТОРЫ; 
    #include "API_0640_FUNC_TOTAL/FUNC_TOTAL_0300_UNIX_TIME.hpp"		//--Формирование и обработка UNIX Time;  
//=================================================================================================
//										0650. API ФУНКЦИЕ УПРАВЛЕНИЕ ЗАДАЧАМИ
//=================================================================================================
    #include "API_0650_FUNC_TASK/FUNC_TASK_0100_SHEDULER.hpp"			//--Диспетчер; 
    #include "API_0650_FUNC_TASK/FUNC_TASK_0110_DIRECT_TASK.hpp"		//--Запуск функций по условию;   
    #include "API_0650_FUNC_TASK/FUNC_TASK_0120_DIRECT_TASK_OLD.hpp"	//--УСТАРЕВШАЯ ФУНКЦИЯ !!! 	
//=================================================================================================
//										0660. API GPIO
//=================================================================================================
	#include "API_0660_FUNC_GPIO/FUNC_GPIO_0010_TOTAL.hpp"				//--Общие функции;
    #include "API_0660_FUNC_GPIO/FUNC_GPIO_0100_AVR.hpp"				//--AVR;
    #include "API_0660_FUNC_GPIO/FUNC_GPIO_0200_SAM3X.hpp"				//--SAM3X(DUE);
    #include "API_0660_FUNC_GPIO/FUNC_GPIO_0400_ESP8266.hpp"			//--ESP8266;
    #include "API_0660_FUNC_GPIO/FUNC_GPIO_0500_ESP32.hpp"				//--ESP32;	
    #include "API_0660_FUNC_GPIO/FUNC_GPIO_0600_STM32.hpp"				//--ESP8266;
    #include "API_0660_FUNC_GPIO/FUNC_GPIO_0700_RP2040.hpp"				//--ESP32;		
    #include "API_0660_FUNC_GPIO/FUNC_GPIO_9000_ANON.hpp"				//--ANON;
//=================================================================================================
//										0700. API MESSAGE
//=================================================================================================
    #include "API_0700_FUNC_MESS/FUNC_MESS_0100_SETTING_MESS.hpp"		//--Установка и форматирование параметров;	
//=================================================================================================
//										0900. API UART
//  			Подключение папок с функциями UART в файле RT_HW_BASE_12_01_LinkUART.cpp
//=================================================================================================
	#include "API_0900_FUNC_UART/FUNC_UART_0000_HEAD.hpp"				//--Заголовки функций UART;
	#include "API_0901_FUNC_I2C/FUNC_I2C_0000_HEAD.hpp"					//--Заголовки функций i2c;
	#include "API_0902_FUNC_SPI/FUNC_SPI_0000_HEAD.hpp"					//--Заголовки функций SPI;	
	#include "API_0903_FUNC_SPN/FUNC_SPN_0000_HEAD.hpp"					//--Заголовки функций SPN;	
//-------------------------------------------------------------------------------------------------
RT_HW_BASE();									//--Конструктор;
//private:
};  //---END CLASS RT_HW_BASE.h====================================================================
extern RT_HW_BASE 				RT_HW_Base; 	//--External reference to the RT_HW_Base object;
 
//=================================================================================================
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										9. ДОПОЛНИТЕЛЬНЫЕ КЛАССЫ
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  #include "BASE_0100_FUNC_GLOBAL/GLOBAL_0100_DIRECT_TASK.hpp"	//--Класс управления вызовом функций;
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										10.ФУНКЦИИ ДЛЯ РАБОТЫ С ФИЛЬТРАМИ
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  #include "BASE_0200_FUNC_FILTERS/FUNC_FILTERS_0110_FilterMedian3.hpp"		//--API медианный фильтр 3-го порядка (самый быстрый);
  #include "BASE_0200_FUNC_FILTERS/FUNC_FILTERS_0120_FilterMedian.hpp"		//--API медианный фильтр n-го порядка;
  #include "BASE_0200_FUNC_FILTERS/FUNC_FILTERS_0130_FilterRingAverage.hpp"	//--API фильтр бегущего среднего с кольцевым буфером;
  #include "BASE_0200_FUNC_FILTERS/FUNC_FILTERS_0140_FilterCritical.hpp"	//--API фильтр критических значений;
  #include "BASE_0200_FUNC_FILTERS/FUNC_FILTERS_0150_FilterChatter.hpp"		//--API фильтр дребезга    значений;
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//-------------------------------------------------------------------------------------------------
#endif //---RT_HW_BASE_h===========================================================================
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
