//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//									Получение тестовых UART
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ 
//=================================================================================================
//									1. Получение значения UART консоль
//=================================================================================================
  uint8_t 	getUartConsole(){
	#if defined(RT_HW_BOARD_UART_CONSOLE )
		return  RT_HW_BOARD_UART_CONSOLE ;
	#else
		return 0;	 
	#endif
  };
//=================================================================================================
//									2. Получение значения UART MODBUS1
//=================================================================================================
  uint8_t 	getUartModbus1(){
	#if defined(RT_HW_BOARD_UART_MODBUS1 )
		return  RT_HW_BOARD_UART_MODBUS1 ;
	#else
		return 255;	 
	#endif
  };
  uint8_t vUartModbus1(){return getUartModbus1();}  
//=================================================================================================
//									3. Получение значения UART MODBUS2
//=================================================================================================
  uint8_t 	getUartModbus2(){
	#if defined(RT_HW_BOARD_UART_MODBUS2 )
		return  RT_HW_BOARD_UART_MODBUS2 ;
	#else
		return 255;	 
	#endif
  };
  uint8_t vUartModbus2(){return getUartModbus2();}  
//=================================================================================================
//									4. Получение значения UART MODBUS3
//=================================================================================================
  uint8_t 	getUartModbus3(){
	#if defined(RT_HW_BOARD_UART_MODBUS3 )
		return  RT_HW_BOARD_UART_MODBUS3 ;
	#else
		return 255;	 
	#endif
  };
  uint8_t vUartModbus3(){return getUartModbus3();}  
//=================================================================================================
//									5. Получение значения UART HMI1
//=================================================================================================
  uint8_t 	getUartHMI1(){
	#if defined(RT_HW_BOARD_UART_HMI1 )
		return  RT_HW_BOARD_UART_HMI1 ;
	#else
		return 255;	 
	#endif
  };
  uint8_t vUartHMI1(){return getUartHMI1();}  
//=================================================================================================
//									6. Получение значения UART HMI2
//=================================================================================================
  uint8_t 	getUartHMI2(){
	#if defined(RT_HW_BOARD_UART_HMI2 )
		return  RT_HW_BOARD_UART_HMI2 ;
	#else
		return 255;	 
	#endif
  };
  uint8_t vUartHMI2(){return getUartHMI2();}  
//=================================================================================================
//									7. Получение значения UART моста WiFi
//=================================================================================================
  uint8_t 	getUartWiFi(){
	#if defined(RT_HW_BOARD_UART_WIFI )
		return  RT_HW_BOARD_UART_WIFI ;
	#else
		return 255;	 
	#endif
  };
  uint8_t vUartWiFi(){return getUartWiFi();}   
//=================================================================================================
