//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//									1.Получение системных пинов на плате
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++                                  
//=================================================================================================
//									1.1. Получение значения пина control
//=================================================================================================
  uint8_t getPinControl(){
	#if defined(RT_HW_BOARD_PIN_CONTROL)
		return  RT_HW_BOARD_PIN_CONTROL;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinControl(){return getPinControl();}
//=================================================================================================
//									1.2. Получение значения пина Led
//=================================================================================================
  uint8_t getPinLed(){
	#if defined(RT_HW_BOARD_PIN_LED)
		return  RT_HW_BOARD_PIN_LED;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinLed(){return getPinLed();}

 //=================================================================================================
//									1.3. Получение значения пина WS2812
//=================================================================================================
  uint8_t getPinWS2812(){
	#if defined(RT_HW_BOARD_PIN_WS2812)
		return  RT_HW_BOARD_PIN_WS2812;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinWS2812(){return getPinWS2812();}  
//=================================================================================================
//									1.4. Получение значения пина button
//=================================================================================================
  uint8_t getPinButton(){
	#if defined(RT_HW_BOARD_PIN_BUTTON)
		return  RT_HW_BOARD_PIN_BUTTON;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinButton(){return getPinButton();} 
//=================================================================================================
//									1.5. Получение значения пина ADC
//=================================================================================================
  uint8_t getPinADC(){
	#if defined(RT_HW_BOARD_PIN_ADC)
		return  RT_HW_BOARD_PIN_ADC;
	#else
		return 255;	 
	#endif
  };

//=================================================================================================
//									1.6. Получение значения пина PWM
//================================================================================================
  uint8_t getPinPWM(){
	#if defined(RT_HW_BOARD_PIN_PWM)
		return  RT_HW_BOARD_PIN_PWM;
	#else
		return 255;	 
	#endif
  };
//=================================================================================================
//									1.7. Получение значения пина TEST
//=================================================================================================
  uint8_t getPinTEST(){
	#if defined(RT_HW_BOARD_PIN_TEST)
		return  RT_HW_BOARD_PIN_TEST;
	#else
		return 255;	 
	#endif
  };

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//									2.Получение пинов DAC на плате
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ 
//=================================================================================================
//									2.1. Получение значения пина DAC0
//=================================================================================================
  uint8_t getPinDAC0(){
	#if defined(RT_HW_BOARD_PIN_DAC0)
		return  RT_HW_BOARD_PIN_DAC0;
	#else
		return 255;	 
	#endif
  };
//=================================================================================================
//									2.2. Получение значения пина DAC1
//=================================================================================================
  uint8_t getPinDAC1(){
	#if defined(RT_HW_BOARD_PIN_DAC1)
		return  RT_HW_BOARD_PIN_DAC1;
	#else
		return 255;	 
	#endif
  };

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//									3.Получение пинов CS на плате
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  
//=================================================================================================
//									3.1. Получение значения пина CS0
//=================================================================================================
  uint8_t getPinCS0(){
	#if defined(RT_HW_BOARD_PIN_CS0)
		return  RT_HW_BOARD_PIN_CS0;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinCS0(){return getPinCS0();}
//=================================================================================================
//									3.2. Получение значения пина CS1
//=================================================================================================
  uint8_t getPinCS1(){
	#if defined(RT_HW_BOARD_PIN_CS1)
		return  RT_HW_BOARD_PIN_CS1;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinCS1(){return getPinCS1();}
//=================================================================================================
//									3.3. Получение значения пина CS2
//=================================================================================================
  uint8_t getPinCS2(){
	#if defined(RT_HW_BOARD_PIN_CS2)
		return  RT_HW_BOARD_PIN_CS2;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinCS2(){return getPinCS2();}
//=================================================================================================
//									3.4. Получение значения пина CS3
//=================================================================================================
  uint8_t getPinCS3(){
	#if defined(RT_HW_BOARD_PIN_CS3)
		return  RT_HW_BOARD_PIN_CS3;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinCS3(){return getPinCS3();}

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//									4. Получение пинов тестовых устройств на плате
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ 
//=================================================================================================
//									4.1. Получение значения пина DS1820
//=================================================================================================
  uint8_t getPinDS1820(){
	#if defined(RT_HW_BOARD_PIN_DS1820)
		return  RT_HW_BOARD_PIN_DS1820;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinDS1820() {return getPinDS1820();}  
  uint8_t vPinOneWire(){return getPinDS1820();}    
//=================================================================================================
//									4.2. Получение значения пина DHT22
//=================================================================================================
  uint8_t getPinDHT22(){
	#if defined(RT_HW_BOARD_PIN_DHT22)
		return  RT_HW_BOARD_PIN_DHT22;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinDHT22(){return getPinDHT22();} 
//=================================================================================================
//								  4.3. Получение значения пина HC-SR04
//=================================================================================================
  uint8_t getPinSR05(){
	#if 	defined(RT_HW_BOARD_PIN_SR04)
		return  RT_HW_BOARD_PIN_SR04;
	#elif 	defined(RT_HW_BOARD_PIN_SR05)
		return  RT_HW_BOARD_PIN_SR05;
	#else		
		return 255;	 
	#endif
  };
  uint8_t getPinSR04(){return getPinSR05();};
//=================================================================================================
//								  4.4. Получение значения пина HC-SR04
//=================================================================================================
  uint8_t getPinNST1001(){
	#if 	defined(RT_HW_BOARD_PIN_NST1001)
		return  RT_HW_BOARD_PIN_NST1001;
	#else		
		return 255;	 
	#endif
  };
//=================================================================================================
//								4.5. Получение значения пина SERVO0
//=================================================================================================
  uint8_t getPinServo0(){
	#if defined(RT_HW_BOARD_PIN_SERVO0)
		return  RT_HW_BOARD_PIN_SERVO0;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinServo0(){return getPinServo0();}  
//=================================================================================================
//								4.6. Получение значения пина SERVO1
//=================================================================================================
  uint8_t getPinServo1(){
	#if defined(RT_HW_BOARD_PIN_SERVO1)
		return  RT_HW_BOARD_PIN_SERVO1;
	#else
		return 255;	 
	#endif
  };
  uint8_t vPinServo1(){return getPinServo1();}  
//================================================================================================= 