//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							1.Контроллер типа ESP32S22 Dev module
//
//  USB CDC On Boot: "Enabled"
//  USB Firmware MSC On Boot: "Disabled"
//  USB DFU On Boot: "Disable"
//  Upload Mode: "Internal USB"
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//											Контроллеры ESP32S2
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//											Контроллер ESP32S2
//=================================================================================================
#if !defined(RT_HW_BOARD_CODE) && defined(RT_HW_CORE_ESP32) && (\
     defined(ARDUINO_ESP32S2_DEV) || defined(ARDUINO_ESP32S2_DEV_EIS)) 
//--------------------------------------------------------------------------------------------------
	#define  RT_HW_BOARD_CODE     (uint8_t)52 				//--Идентификатор выбора платы;
//-------------------------------------------------------------------------------------------------			
	#define  RT_HW_BOARD_NAME  	 "ESP32S2 DEV"				//--Наименование платы;
	#define  RT_HW_BOARD_ESP32S2_DEV 						//--Идентификатор типа платы;	
//=================================================================================================
//										1. Ограничение ресурсов контроллера
//=================================================================================================
	#define RT_HW_SPECIFIC_USING_1  "Strapping pins pins 0,5,14,15=PWM; pin.1=debug"
	#define RT_HW_SPECIFIC_USING_2  "Download:: pin.1=1, pin.12=1"
//=================================================================================================
//										2. Системные пины
//const uint8_t PROGMEM RT_HW_PGM_PIN_BRD[]	={13, 15, 14,33,      	    	    RT_HW_PGM_END};	//--Control,LED,Button,ADC,PWM,WS2812
//=================================================================================================
	#define  RT_HW_BOARD_PIN_CONTROL   13		//--Контроль цикла loop();12,  2, 34,36,25,
	#define  RT_HW_BOARD_PIN_LED       15		//--Led на плате;
	#define  RT_HW_BOARD_PIN_BUTTON    14		//--Кнопка на плате;
	#define  RT_HW_BOARD_PIN_ADC       33		//--ADC;
//=================================================================================================
//										3. Пины cs тестовые
//const uint8_t PROGMEM RT_HW_PGM_PIN_CSX[]	={34, 21, 17, 16,	    			RT_HW_PGM_END};	//--SPI: cs0,cs1,cs2,cs3
//=================================================================================================
	#define  RT_HW_BOARD_PIN_CS0       34		//--SPI cs.0;
	#define  RT_HW_BOARD_PIN_CS1       21		//--SPI cs.1;	
	#define  RT_HW_BOARD_PIN_CS2       14		//--SPI cs.2;
	#define  RT_HW_BOARD_PIN_CS3       33		//--SPI cs.3;	
//=================================================================================================
//										4. Пины тестовых устройств
//const uint8_t PROGMEM RT_HW_PGM_TST_DEV[]	={12,255,11,           				RT_HW_PGM_END};	//--Устройства: 1-Wire,DHT22,HC-SR04.trig,HC-SR04.echo,
//=================================================================================================
	#define  RT_HW_BOARD_PIN_DS1820    12		//--Сенсор DS1820;33, 14,13,
	#define  RT_HW_BOARD_PIN_SR04      11		//--Сенсор HC-SR04;
//=================================================================================================
//										5. Номера тестовых UART
//=================================================================================================		
	#define  RT_HW_BOARD_UART_MODBUS1  0		//--Номер UART для MODBUS 1;
	#define  RT_HW_BOARD_UART_HMI  	   1		//--Номер UART для HMI 1;
//=================================================================================================
//										10. Коммуникации
//=================================================================================================
//=================================================================================================
//										10.1. UART
//=================================================================================================
    #define  RT_HW_PERMIT_UART0					//--Разрешение работы с UART0;
    #define  RT_HW_PERMIT_UART1					//--Разрешение работы с UART1;		
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART0_RX   	43
    #define  RT_HW_UART0_TX   	44	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART1_RX   	18
    #define  RT_HW_UART1_TX   	17	
//=================================================================================================
//										10.2. i2c
//=================================================================================================
    #define  RT_HW_PERMIT_I2C0					//--Разрешение работы с i2c0; 
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C0_SCL  	9	
    #define  RT_HW_I2C0_SDA  	8
//=================================================================================================
//										10.3. SPI
//=================================================================================================
    #define  RT_HW_PERMIT_SPI0					//--Разрешение работы с SPI0; 
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI0_SCK  	36
    #define  RT_HW_SPI0_MISO 	37
    #define  RT_HW_SPI0_MOSI 	35
    #define  RT_HW_SPI0_SS    	34	
//=================================================================================================
//										1.10. Доступные пины
//=================================================================================================  
    #define RT_HW_PERMIT_PIN_ALL 	(uint8_t)33	
    #define RT_HW_PERMIT_PIN_DOT 	(uint8_t)33	
    #define RT_HW_PERMIT_PIN_PWM	(uint8_t)33	
    #define RT_HW_PERMIT_PIN_DAC	(uint8_t)2		
    #define RT_HW_PERMIT_PIN_DIN	(uint8_t)33
    #define RT_HW_PERMIT_PIN_ADC	(uint8_t)14		
    #define RT_HW_PERMIT_PIN_SRV	(uint8_t)2			
    #define RT_HW_PERMIT_PIN_INT	(uint8_t)33 
    #define RT_HW_PERMIT_PIN_N5V	(uint8_t)33 	
//--------------------------------Доступные пины контроллера---------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_ALL_ID[]   	={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,
													  20,21,   33,34,35,36,      39,40,41,42,43,44,45,  			RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DOT_ID[] 	={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,
													  20,21,   33,34,35,36,      39,40,41,42,43,44,45,  			RT_HW_PGM_END};												  
	const uint8_t PROGMEM RT_HW_PGM_PIN_PWM_ID[] 	={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,
													  20,21,   33,34,35,36,      39,40,41,42,43,44,45,  			RT_HW_PGM_END};												  
	const uint8_t PROGMEM RT_HW_PGM_PIN_DAC_ID[] 	={17,18,													  	RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DIN_ID[] 	={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,
													  20,21,   33,34,35,36,      39,40,41,42,43,44,45,  			RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_SRV_ID[] 	={17,18,													  	RT_HW_PGM_END};	
	const uint8_t PROGMEM RT_HW_PGM_PIN_ADC_ID[] 	={    1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14, 	            RT_HW_PGM_END};	
	const uint8_t PROGMEM RT_HW_PGM_PIN_INT_ID[] 	={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,
													  20,21, 	33,34,35,36,     39,40,41,42,43,44,45,  			RT_HW_PGM_END};	
	const uint8_t PROGMEM RT_HW_PGM_PIN_N5V_ID[] 	={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,
													  20,21,    33,34,35,36,39,40,41,42,43,44,45,  					RT_HW_PGM_END};	
//=================================================================================================
#endif
//=================================================================================================
