
//=================================================================================================
// RT_HW_PGM_END соответствует 254	
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//									1.ДОСТУП К МАССИВАМ PROGMEM VAR (uint8_t)						
//=================================================================================================
//					1.1. Получение значения по индексу в массиве. Длина массива ограничена sizeArr.
//=================================================================================================
  uint8_t getVarPGM(const uint8_t *arr, uint8_t sizeArr, uint8_t idx){ 
	(void)arr; (void)sizeArr; (void)idx;
	if((sizeArr==0) || (idx>(sizeArr-1))) {return 255;}
	return pgm_read_byte(&arr[idx]);
  };
//=================================================================================================
//					1.2. Проверка наличия значения var в массиве. Длина массива ограничена sizeArr.
//=================================================================================================
  uint8_t checkVarPGM(const uint8_t *arr, uint8_t sizeArr, uint8_t var){ 
    if(sizeArr==0) {return 0;}
    for(uint8_t i=0; i<sizeArr; i++) {if(pgm_read_byte(&arr[i])==var){return 1;}} return 0;
  };    
//=================================================================================================
//					1.3. Получение размера массива в котором последний элемент равен RT_HW_PGM_END.
//=================================================================================================
  uint8_t getSizePGM(const uint8_t *arr){ 
	uint8_t k=0; uint8_t bf=0;  (void)k; (void)bf;
	for(uint8_t i=0; i<255; i++) {
		bf=pgm_read_byte(&arr[i]);
		if(bf==RT_HW_PGM_END){break;} 
		k++; 
	}	
		return k;
  }; 
//=================================================================================================  
