//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//									1. ПОЛУЧЕНИЕ ПАРАМЕТРОВ ПРОГРАММ
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//									1.1. Получение имени версии библиотеки
//=================================================================================================
  String getVerName(){				 	//--Имя версии;	
	#if defined(RT_HW_BASE_VER_NAME) 					
		return  String(RT_HW_BASE_VER_NAME);  
	#else
		return "";
	#endif
  };
  String vVerName(){return getVerName();};
  
//=================================================================================================
//									2.2.1. Получение имени архитектуры
//=================================================================================================
  String getArchName(){							
	#if defined(RT_HW_ARCH_NAME) 					
		return String(RT_HW_ARCH_NAME);  
	#else
		return "";
	#endif
  };
  String vArchName(){return getArchName();};
//=================================================================================================
//									2.2.2. Получение кода архитектуры
//=================================================================================================
  uint8_t getArchCode(){					
	#if defined(RT_HW_ARCH_CODE) 					
		return  RT_HW_ARCH_CODE;  
	#else
		return 255;
	#endif
  };
  uint8_t vArchCode(){return getArchCode();};  
//=================================================================================================
//									2.2.3. Получение имени ядра (CORE)
//=================================================================================================
  String getCoreName(){						
	#if defined(RT_HW_CORE_NAME) 					
		return String(RT_HW_CORE_NAME);  
	#else
		return "";
	#endif
  };
  String vCoreName(){return getCoreName();};  
//=================================================================================================
//									2.3. Получение параметров памяти
//=================================================================================================
  String getBoardMemory(){				
	#if defined(RT_HW_BOARD_MEMORY) 					
		return String(RT_HW_BOARD_MEMORY);  
	#else
		return "";
	#endif
  };
  String vBoardMemory(){return getBoardMemory();};    
//=================================================================================================
//									2.4. Получение частоты процессора
//=================================================================================================
  uint16_t getFCPU(){		
	#if defined(RT_HW_BOARD_FCPU) 					
		return  RT_HW_BOARD_FCPU;  
	#else
		return 16;
	#endif
  };
  uint16_t vFCPU(){return getFCPU();}; 
//=================================================================================================
//									2.5. Получение Vcc
//=================================================================================================
  uint16_t getVcc(){					
	#if defined(RT_HW_BOARD_VCC) 					
		return  RT_HW_BOARD_VCC;  
	#else
		return 3300;
	#endif
  };
  uint16_t vVcc(){return getVcc();};  
//-------------------------------------------------------------------------------------------------



//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//									3. ПОЛУЧЕНИЕ ПАРАМЕТРОВ РАЗРЯДНОСТИ
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//									3.1. Получение разрядности SYSTEM
//=================================================================================================
  uint8_t getDepthSYS(){
	#if defined(RT_HW_DEPTH_SYS)
		return  RT_HW_DEPTH_SYS;
	#else
		return 12;	 
	#endif
  };
//=================================================================================================
//									3.2. Получение разрядности ADC
//=================================================================================================
  uint8_t getDepthADC(){
	#if defined(RT_HW_DEPTH_ADC)
		return  RT_HW_DEPTH_ADC;
	#else
		return 10;	 
	#endif
  };
//=================================================================================================
//									3.3. Получение дрейфа значения ADC
//=================================================================================================
  uint8_t getDriftADC(){
	#if defined(RT_HW_DRIFT_ADC)
		return  RT_HW_DRIFT_ADC;
	#else
		return 10;	 
	#endif
  }; 
//=================================================================================================
//									3.4. Получение дрейфа нуля ADC
//=================================================================================================  
   uint8_t getNullADC(){
	#if defined(RT_HW_NULL_ADC)
		return  RT_HW_NULL_ADC;
	#else
		return 10;	 
	#endif
  }; 
//=================================================================================================
//									3.5. Получение разрядности PWM
//=================================================================================================
  uint8_t getDepthPWM(){
	#if defined(RT_HW_DEPTH_PWM)
		return  RT_HW_DEPTH_PWM;
	#else
		return 8;	 
	#endif
  };
//=================================================================================================
//									3.6. Получение разрядности DAC
//=================================================================================================
  uint8_t getDepthDAC(){
	#if defined(RT_HW_DEPTH_DAC)
		return  RT_HW_DEPTH_DAC;
	#else
		return 8;	 
	#endif
  };
//=================================================================================================
//									2.1.2. Получение разрядности TOUCH (ESP32 CORE 2.x)
//											(УСТАРЕВШАЯ ФУНКЦИЯ !!!)
//=================================================================================================
  uint8_t vDepthTCH(){				//--Разрядность TOUCH(default);	
	#if defined(RT_HW_BOARD_DEPTH_TCH) 					
		return  RT_HW_BOARD_DEPTH_TCH;  
	#else
		return  10;
	#endif
  };
//=================================================================================================

