//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//                          		4. ФУНКЦИИ ДЛЯ НАСТРОЙКИ УСТРОЙСТВ SPI  (DEVICE)
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
// 		    						4.1. Настройка параметров SPI 
//               		для устройства c cs, на шине bus,со скоростью(speed)                               
//=================================================================================================
  uint8_t	RT_HW_BASE::	spiSetParam(RT_HW_STRUCT_SPI_DEV &id, uint8_t _cs, uint8_t _bus, uint32_t _speed){
	if(id.custom==0){
		id.link=id.status=id.codeErr=0; 
		id.cs=_cs; 
		id.bus=_bus; 
		id.speed=_speed; 
		id.custom=1;
	}
	return id.custom;
  };
//=================================================================================================
//									4.2. Настройка пина СS на вывод
//=================================================================================================
  void		RT_HW_BASE::	spiInitCS(RT_HW_STRUCT_SPI_DEV &id){
		id.ddCS.dir=0;
		pinDigitalWrite(id.ddCS,id.cs,1);
//			digitalWrite(id.cs,1);
//			pinMode(id.cs,OUTPUT);
  };
//=================================================================================================
//									4.3. Установка пина СS в LOW
//=================================================================================================	
  void		RT_HW_BASE::	spiBeginCS(RT_HW_STRUCT_SPI_DEV &id){
		if(id.t1){delayMicroseconds(id.t1);} 
		pinDigitalWrite(id.ddCS,id.cs,0);
  };
//=================================================================================================
//									4.4. Установка пина СS в HIGH
//=================================================================================================	  
  void		RT_HW_BASE::	spiEndCS(RT_HW_STRUCT_SPI_DEV &id){
		if(id.t2){delayMicroseconds(id.t2);} 
		pinDigitalWrite(id.ddCS,id.cs,1);	
		if(id.t3){delayMicroseconds(id.t3);}
  };	
//=================================================================================================
//									4.5. Настройка устройства
//				Обрабатываются конфликты доступа к шине при одновременном доступе
//									(RTOS,многопроцессорность и т.п.)
//=================================================================================================
  void		RT_HW_BASE::	spiInitDevice(RT_HW_STRUCT_SPI_DEV &id){
	id.link=0;											 //--Очистка параметра;
	if(id.custom==0){id.codeErr=150;id.link=1; 	return;} //--Выход по ошибке =50, если параметры устройство не настроено;
	if(id.status==1){id.codeErr=0;  id.link=1;	return;} //--Проверка настройки устройства;
	if(id.err==1)   {id.codeErr=151;id.link=1; 	return;} //--Выход, если при прежней инициализации была ошибка;
	id.status=id.codeErr=0;											//--Очистка параметров;
//------------------------------------------------------------------------------------------------
	if(!checkPinDOT(id.cs)) {id.codeErr=152; id.link=1; return;}	//--Проверка допустимости номера пина cs;
	spiInitCS(id);													//--Настройка пина CS на вывод;	
//	pinDigitalWrite(id.ddCS,id.cs,1);								//--Настройка пина CS на вывод;		
	if(!checkPinDOT(id.oe)){id.oe=255;} 							//--Проверка допустимости номера пина oe;
	if(id.oe!=255) {digitalWrite(id.oe,1); pinMode(id.oe,OUTPUT); id.stateOe=1;}	//-Настройка пина oe на вывод;	
//-------------------------------------------------------------------------------------------------
	if(!spiCheckBus(id.bus))	{id.codeErr=153; id.err=1; id.link=1; 	return;}	//--Проверка допустимости номера шины SPI;
	if(!spiBegin(id.bus)){												return;};	//--Инициализация шины SPI как Master.
	if( spiGetStatus(id.bus)!=1){id.codeErr=154; id.err=1; id.link=1; 	return;}	//--Проверка настройки шины i2c как Master;
//-------------------------------------------------------------------------------------------------	
	if(id.speed==0){id.speed=RT_HW_SPI_SPEED;}			//--Установка значения скорости шины по умолчанию;
	id.status=spiGetStatus(id.bus);						//--Установка состояния настройки устройства =Master;;
	id.link=1;											//--Успешный выход;	
  };
//=================================================================================================
//									4.6. Начало транзакции для устройства  
//                                      и установка пина CS LOW с задержкой id.t1            
//=================================================================================================
  void	RT_HW_BASE::	spiBeginTransaction(RT_HW_STRUCT_SPI_DEV &id){
		spiBeginTransaction(id.speed,id.bitOrder,id.dataMode,id.bus);
  };
//=================================================================================================
//									4.7.Завершение транзакции для шины SPI для устройства с ID=id 
//                                      и установка пина CS HIGH с задержками id.t2,id.t3
//=================================================================================================
  void		RT_HW_BASE::	spiEndTransaction(RT_HW_STRUCT_SPI_DEV &id){
		spiEndTransaction(id.bus);
  };
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//                          			ФУНЦИИ ЗАПИСИ-ЧТЕНИЯ С УСТРОЙСТВАМИ 
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//									4.10. Отправка байт tx, возвращает принятый байт;
//=================================================================================================
  uint8_t		RT_HW_BASE::	spiTransferVar(RT_HW_STRUCT_SPI_DEV &id, uint8_t tx){
	uint8_t bf; (void)bf; (void)id; (void)tx;
	id.link=0; 								//--Сброс флага успешной операции;
	if(id.status!=1){id.link=1; return 0;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return 0;};	//--Ожидание освобождение шины и захват шины;   
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;
	bf=spiTransfer(tx,id.bus);	  			//--Обмен байтами;
	spiEndCS(id);							//--Установка CS в HIGH;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
    return bf;								//--
  };

//=================================================================================================
//									4.11. Отправка байта tx, чтение байта в rx;
//=================================================================================================
  void		RT_HW_BASE::	spiTransfer(RT_HW_STRUCT_SPI_DEV &id, uint8_t tx, uint8_t &rx){
	id.link=0; 								//--Сброс флага успешной операции;
	rx=0;									//--Очистка регистра чтения;
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;   
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;
	rx=spiTransfer(tx,id.bus);	  			//--Обмен байтами;
	spiEndCS(id);							//--Установка CS в HIGH;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };	
//=================================================================================================
//									4.12. Запись байта  tx
//=================================================================================================
  void		RT_HW_BASE::	spiWrite(RT_HW_STRUCT_SPI_DEV &id, uint8_t tx){
	id.link=0;								//--Сброс флага успешной операции;
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;   
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;
	spiTransfer(tx,id.bus);	  				//--Запись байта;
	spiEndCS(id);							//--Установка CS в HIGH;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };

//=================================================================================================
//									4.13. Запись регистра reg и байта  tx
//=================================================================================================
  void	RT_HW_BASE::spiWriteReg(RT_HW_STRUCT_SPI_DEV &id, uint8_t reg, uint8_t tx){
	id.link=0;								//--Сброс флага успешной операции;
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;   
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;
	spiTransfer(reg,id.bus);	  			//--Запись байта;
	spiTransfer( tx,id.bus);	  			//--Запись байта;
	spiEndCS(id);							//--Установка CS в HIGH;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };


  
//=================================================================================================
//									4.14. Чтение байта в rx
//=================================================================================================
  void		RT_HW_BASE::	spiRead(RT_HW_STRUCT_SPI_DEV &id, uint8_t &rx){
	id.link=0;								//--Сброс флага успешной операции;	
	rx=0;									//--Очистка регистра чтения;	
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;   
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;
	rx=spiTransfer(0,id.bus);	  			//--Обмен байтами;
	spiEndCS(id);							//--Установка CS в HIGH;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };
//=================================================================================================
//									4.21. Запись qnt байт из массива arr 
//									   со чтением qnt байт  в массив  arr
//=================================================================================================
  void		RT_HW_BASE::	spiTransferArr(RT_HW_STRUCT_SPI_DEV &id, uint8_t *arr, uint8_t qnt){
	id.link=0;								//--Сброс флага успешной операции;	
	if(qnt==0)      {id.link=1; return;}	//--Выход, если qnt=0;
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины; 
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;
	for(int16_t i=0; i<qnt;  i++){			//--Обмен qnt
	  arr[i]=spiTransfer(arr[i],id.bus);} 	// 		байтами;
	spiEndCS(id);							//--Установка CS в HIGH;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };
//=================================================================================================
//									4.22. Обмен между массивами qnt байтами 
//=================================================================================================
  void		RT_HW_BASE::	spiTransferArr(RT_HW_STRUCT_SPI_DEV &id, uint8_t *tx, uint8_t *rx, uint8_t qnt){
	id.link=0;								//--Сброс флага успешной операции;	
	if(qnt==0)      {id.link=1; return;}	//--Выход, если qnt=0;
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины; 
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;
	for(int16_t i=0; i<qnt; i++){			//--Обмен байтами,
	  rx[i] =spiTransfer(tx[i],id.bus);}	//
	spiEndCS(id);							//--Установка CS в HIGH;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };					
//=================================================================================================
//									4.23. spiWriteArr(id)
//=================================================================================================
  void RT_HW_BASE::spiWriteArr(RT_HW_STRUCT_SPI_DEV &id, uint8_t *tx, uint8_t qnt){
	id.link=0;								//--Сброс флага успешной операции;	
	if(qnt==0){      id.link=1; return;}	//--Выход, если qnt=0;
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;   
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;;
	spiBeginCS(id);							//--Установка CS в LOW;
	for(int16_t i=0; i<qnt; i++){ 			//--Запись qnt 
	         spiTransfer(tx[i],id.bus);}   	//    		байт;
	spiEndCS(id);							//--Установка CS в LOW;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };

//=================================================================================================
//									4.24. spiWriteRegArr(id)
//=================================================================================================
  void RT_HW_BASE::spiWriteRegArr(RT_HW_STRUCT_SPI_DEV &id, uint8_t reg, uint8_t *tx, uint8_t qnt){
	id.link=0;								//--Сброс флага успешной операции;	
	if(qnt==0){      id.link=1; return;}	//--Выход, если qnt=0;
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;   
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;;
	spiBeginCS(id);							//--Установка CS в LOW;
	spiTransfer(reg,id.bus);				//--Отправка регистра;			
	for(int16_t i=0; i<qnt; i++){ 			//--Запись qnt 
	         spiTransfer(tx[i],id.bus);}   	//    		байт;
	spiEndCS(id);							//--Установка CS в LOW;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };	
  
//=================================================================================================
//									4.25. spiReadArr(id)
//=================================================================================================
  void		RT_HW_BASE::	spiReadArr(RT_HW_STRUCT_SPI_DEV &id, uint8_t *rx, uint8_t qnt){
	id.link=0;								//--Сброс флага успешной операции;	
	if(qnt==0){id.link=1;    	return;}	//--Выход, если qnt=0;
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;  
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;
	for(int16_t i=0; i<qnt;   i++){			//--Чтение qnt
		rx[i]=spiTransfer(0,id.bus);} 		//          байт;
	spiEndCS(id);							//--Установка CS в LOW;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };		
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//                          		5. ФУНЦИИ ОБМЕНА СЛОВАМИ (qnt=1-4) С УСТРОЙСТВАМИ
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//									5.1. Обмен словами длиной 1,2,3 или 4 байта
//=================================================================================================
  void		RT_HW_BASE::	spiTransferShift(RT_HW_STRUCT_SPI_DEV &id, uint32_t tx, uint32_t &rx, uint8_t qnt){
	(void)id; (void)tx;	(void)rx; (void)qnt;
	id.link=0; 								//--Сброс флага успешной операции;
	rx=0;									//--Очистка регистра чтения;
	if(qnt==0){id.link=1;    	return;}	//--Выход, если количество байтов qnt=0;
	if(qnt>4) {qnt=4;} 						//--Ограничение кол-во байт (qnt<=4);
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;   
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;											 
	if(id.bitOrder){for(int16_t i=qnt-1; i>=0;       i--){rx|= ((uint32_t)spiTransfer((uint8_t)(tx>>(i*8)),id.bus))<<(i*8);}}
	else           {for(int16_t i=0;     i<=(qnt-1); i++){rx|= ((uint32_t)spiTransfer((uint8_t)(tx>>(i*8)),id.bus))<<(i*8);}}
	spiEndCS(id);							//--Установка CS в HIGH;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };	
//=================================================================================================
//									5.2. Запись словами длиной 1,2,3 или 4 байта
//=================================================================================================
  void		RT_HW_BASE::	spiWriteShift(RT_HW_STRUCT_SPI_DEV &id, uint32_t tx, uint8_t qnt){
	(void)id; (void)tx;	 (void)qnt;
	id.link=0; 								//--Сброс флага успешной операции;
  //rx=0;									//--Очистка регистра чтения;
	if(qnt==0){id.link=1;    	return;}	//--Выход, если количество байтов qnt=0;
	if(qnt>4) {qnt=4;} 						//--Ограничение кол-во байт (qnt<=4);
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;   
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;											 
	if(id.bitOrder){for(int16_t i=qnt-1; i>=0;       i--){uint8_t v=tx>>(i*8);  spiTransfer(v,id.bus);}}
	else           {for(int16_t i=0;     i<=(qnt-1); i++){uint8_t v=tx>>(i*8);  spiTransfer(v,id.bus);}}
	spiEndCS(id);							//--Установка CS в HIGH;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };	
//=================================================================================================
//									5.3.  Чтение словами длиной 1,2,3 или 4 байта
//=================================================================================================
  void		RT_HW_BASE::	spiReadShift(RT_HW_STRUCT_SPI_DEV &id,  uint32_t &rx, uint8_t qnt){
	id.link=0; 								//--Сброс флага успешной операции;
    rx=0;									//--Очистка регистра чтения;
	if(qnt==0){id.link=1;    	return;}	//--Выход, если количество байтов qnt=0;
	if(qnt>4) {qnt=4;} 						//--Ограничение кол-во байт (qnt<=4);
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;   
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;											 
	if(id.bitOrder){for(int16_t i=qnt-1; i>=0;       i--){rx|= ((uint32_t)spiTransfer(0,id.bus))<<(i*8);}}
	else           {for(int16_t i=0;     i<=(qnt-1); i++){rx|= ((uint32_t)spiTransfer(0,id.bus))<<(i*8);}}
	spiEndCS(id);							//--Установка CS в HIGH;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };
  
/*  
//=================================================================================================
//									5.20. 74HC165
//=================================================================================================
  void		RT_HW_BASE::	spi74HC165(RT_HW_STRUCT_SPI_DEV &id,   uint32_t &rx, uint8_t qnt){
	id.link=0; 								//--Сброс флага успешной операции;
	rx=0;									//--Очистка регистра чтения;
	if(qnt==0){id.link=1;    	return;}	//--Выход, если количество байтов qnt=0;
	if(qnt>4){qnt=4;} 						//--Ограничение кол-во байт (qnt<=4);
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;    
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id.speed,id.bitOrder,id.dataMode,id.bus);
//-------------------------------------------------------------------------------------------------
	spiBeginCS(id);							//--Установка CS в LOW;
	spiEndCS(id);							//--Установка CS в HIGH;
//-------------------------------------------------------------------------------------------------
	if(id.bitOrder){for(int8_t i=qnt-1; i>=0;       i--){rx|=(uint32_t)(spiTransfer(0,id.bus))>>(i*8);}}
	else           {for(int8_t i=0;     i<=(qnt-1); i++){rx|=(uint32_t)(spiTransfer(0,id.bus))>>(i*8);}}
//-------------------------------------------------------------------------------------------------
	spiEndTransaction(id.bus);				//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
 };	
//=================================================================================================
//									5.21. 74HC595
//=================================================================================================
  void		RT_HW_BASE::	spi74HC595(RT_HW_STRUCT_SPI_DEV &id,   uint32_t  tx, uint8_t qnt){
	id.link=0;								//--Сброс флага успешной операции;
	if(qnt==0){id.link=1;    	return;}	//--Выход, если количество байтов qnt=0;
	if(qnt>4) {qnt=4;} 						//--Ограничение кол-во байт (qnt<=4);
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;    
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
//-------------------------------------------------------------------------------------------------											 
	if(id.bitOrder){for(int8_t i=qnt-1; i>=0;       i--){spiTransfer((tx>>(i*8))&0xFF,id.bus);}}
	else           {for(int8_t i=0;     i<=(qnt-1); i++){spiTransfer((tx>>(i*8))&0xFF,id.bus);}}
//	if(id.bitOrder){for(int8_t i=qnt-1; i>=0;       i--){spiTransfer((tx>>(i)),id.bus);}}
//	else           {for(int8_t i=0;     i<=(qnt-1); i++){spiTransfer((tx>>(i)),id.bus);}}
//-------------------------------------------------------------------------------------------------
	spiBeginCS(id);							//--Установка CS в LOW;	
	spiEndCS(id);							//--Установка CS в HIGH;
	if(id.stateOe=1){digitalWrite(id.oe,0);  id.stateOe=2;}	//--Разрешить передачу на выходные пины (отключение третьего состояния);
//-------------------------------------------------------------------------------------------------
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };
*/  
//=================================================================================================
//									5.22. DM13C x2
//=================================================================================================
  void		RT_HW_BASE::	spiDM13C  (RT_HW_STRUCT_SPI_DEV &id,   uint32_t  tx, uint32_t &rx, uint8_t qnt){
	id.link=0; 								//--Сброс флага успешной операции;
	rx=0;									//--Очистка регистра чтения;
	if(qnt==0){id.link=1;    	return;}	//--Выход, если количество байтов qnt=0;
	if(qnt>2){qnt=2;} 						//--Ограничение кол-во байт (qnt<=4);
	qnt<<=2;								//--Умножение x2;
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;    
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;
	for(int16_t i=qnt-1; i>=0; i--){rx|=spiTransfer((tx>>(i*8))&0xFF,id.bus)<<(i*8);}
	spiEndCS(id);							//--Установка CS в HIGH;
	if(id.stateOe==1){digitalWrite(id.oe,0);  id.stateOe=2;}	//--Разрешить передачу на выходные пины (отключение третьего состояния);
//-------------------------------------------------------------------------------------------------
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;								//--Установка флага успешной операции;
  };	
//=================================================================================================



//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//                          		 8.ФУНЦИИ ДЛЯ РАБОТЫ С УСТРОЙСТВАМИ на шине SPI
//												УСТАРЕВШИЕ ФУНКЦИИ
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/*
//=================================================================================================
//									8.1.spiTransfer(id) qnt	(DM13Cx2)
//=================================================================================================
  void		RT_HW_BASE::	spiTransfer(RT_HW_STRUCT_SPI_DEV &id, uint32_t tx, uint32_t &rx, uint8_t qnt){
	id.link=0; rx=0;
	if(qnt==0){id.link=1;    	return;}	//--Выход, если количество байтов qnt=0;
	if(qnt>4){qnt=4;} 						//--Ограничение кол-во байт (qnt<=4);
	if(id.status!=1){id.link=1; return;}	//--Выход, если устройство не настроено;
	if(!spiSetBusy(id.bus))    {return;};	//--Ожидание освобождение шины и захват шины;	
//-------------------------------------------------------------------------------------------------
	spiBeginTransaction(id);				//--Начало транзакции;
	spiBeginCS(id);							//--Установка CS в LOW;
	rx=0;
	for(id.idx=qnt-1; id.idx>=0; id.idx--){rx|=spiTransfer((tx>>(id.idx*8))&0xFF,id.bus)<<(id.idx*8);}
	spiEndCS(id);							//--Установка CS в HIGH;
	spiEndTransaction(id);					//--Окончание транзакции;
//-------------------------------------------------------------------------------------------------
	spiClearBusy(id.bus);					//--Освобождение шины;
	id.link=1;
  };				
//=================================================================================================
//									8.4.spiWrite(id) запись слова (1,2,3,4 байт) из tx (74HC595x4)
//=================================================================================================
  void		RT_HW_BASE::	spiWrite(RT_HW_STRUCT_SPI_DEV &id, uint32_t tx, uint8_t qnt=1){spiTransfer(id,tx,id.bf32,qnt);};
//=================================================================================================
//									7.3.spiRead(id)  чтение слова (1,2,3,4 байт) в id.bf32 (MAX6675 и др.)
//=================================================================================================
  void		RT_HW_BASE::	spiRead (RT_HW_STRUCT_SPI_DEV &id,              uint8_t qnt=1){spiTransfer(id, 0,id.bf32,qnt);};
*/  
//=================================================================================================
//									7.4.spiREAD(id) [Gag - read register]
//=================================================================================================
//void  spiREAD(RT_HW_STRUCT_SPI_DEV &id,  uint8_t reg){spiTransfer(id,(uint32_t)reg,id.bf32,1);};
//=================================================================================================
//									7.5.spiReadRegs(id) [Gag - read qnt register]
//=================================================================================================
//void  spiREADArr(RT_HW_STRUCT_SPI_DEV &id, uint8_t reg, uint8_t *arr, uint8_t qnt=1){id.bf32=reg; id.idx=qnt;  arr[0]=id.link=1;};
