//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//							 	1. Arduino SAMX3X DUE
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if	!defined(RT_HW_BOARD_CODE) && defined(RT_HW_CORE_SAMX) && (defined(ARDUINO_SAM_DUE) || defined(__SAM3X8E__))	
	#define  RT_HW_BOARD_CODE     (uint8_t)20 					//--Идентификатор выбора платы;
	#define  RT_HW_BOARD_NAME     "Arduino DUE" 				//--Наименование платы;
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_BOARD_MEMORY	"FLASH=512Kb,RAM=64kB+32kB"		//--Параметры памяти;
	#define  RT_HW_BOARD_FCPU     (uint16_t)84 					//--Частота процессора;	
	#define  RT_HW_BOARD_VCC      (uint16_t)3300				//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_BOARD_SAM3X_DUE								//--Идентификатор типа платы;
//==================================================================================================
//								1.1.Ограничение ресурсов контроллеа
//==================================================================================================

//==================================================================================================
//								1.2. Системные пины
//==================================================================================================
	#define  RT_HS_BOARD_PIN_CONTROL   (uint8_t)42		//--Контроль цикла loop();
	#define  RT_HS_BOARD_PIN_LED       (uint8_t)13		//--Led на плате;
	#define  RT_HS_BOARD_PIN_BUTTON    (uint8_t)12		//--Кнопка на плате;
	#define  RT_HS_BOARD_PIN_ADC       (uint8_t)54		//--ADC;
	#define  RT_HS_BOARD_PIN_PWM       (uint8_t)5		//--PWM;	
	#define  RT_HS_BOARD_PIN_CS0       (uint8_t)46		//--SPI cs.0;
	#define  RT_HS_BOARD_PIN_CS1       (uint8_t)47		//--SPI cs.1;	
	#define  RT_HS_BOARD_PIN_CS2       (uint8_t)48		//--SPI cs.2;
	#define  RT_HS_BOARD_PIN_CS3       (uint8_t)49		//--SPI cs.3;	
//==================================================================================================
//								1.3. Тестовые устройства
//==================================================================================================
	#define  RT_HS_BOARD_PIN_DS1820     (uint8_t)7		//--Сенсор DS1820;
	#define  RT_HS_BOARD_PIN_SR04       (uint8_t)3		//--Сенсор HC-SR04;
	#define  RT_HS_BOARD_PIN_SERVO      (uint8_t)2		//--Серво-двигатель;
 	#define  RT_HS_BOARD_UART_MODBUS_1  (uint8_t)1		//--Номер UART для MODBUS 1;
	#define  RT_HS_BOARD_UART_MODBUS_2  (uint8_t)2		//--Номер UART для MODBUS 2;
	#define  RT_HS_BOARD_UART_HMI		(uint8_t)3		//--Номер UART для панели HMI;	
//==================================================================================================
//								1.4. Коммуникации
//==================================================================================================
    #define  RT_HS_PERMIT_UART0					//--Разрешение работы с UART0; 
    #define  RT_HS_PERMIT_UART1					//--Разрешение работы с UART1; 
    #define  RT_HS_PERMIT_UART2					//--Разрешение работы с UART2; 
    #define  RT_HS_PERMIT_UART3					//--Разрешение работы с UART3; 	
    #define  RT_HS_PERMIT_I2C0					//--Разрешение работы с i2c0; 
    #define  RT_HS_PERMIT_SPI0					//--Разрешение работы с SPI0; 
    #define  RT_HS_PERMIT_SPN					//--Разрешение работы с SPN; 	
//-------------------------------------------------------------------------------------------------
    #define  RT_HS_UART0_RX   0
    #define  RT_HS_UART0_TX   1	
    #define  RT_HS_UART1_RX  19
    #define  RT_HS_UART1_TX  18	
    #define  RT_HS_UART2_RX  17
    #define  RT_HS_UART2_TX  16	
    #define  RT_HS_UART3_RX  15
    #define  RT_HS_UART3_TX  14	
//-------------------------------------------------------------------------------------------------
    #define  RT_HS_UARTS_RX  68
    #define  RT_HS_UARTS_TX  69	
//-------------------------------------------------------------------------------------------------
    #define  RT_HS_I2C0_SCL  21	
    #define  RT_HS_I2C0_SDA  20
//-------------------------------------------------------------------------------------------------
    #define  RT_HS_SPI0_SCK  52
    #define  RT_HS_SPI0_MISO 50
    #define  RT_HS_SPI0_MOSI 51
    #define  RT_HS_SPI0_SS   53	
//-------------------------------------------------------------------------------------------------
    #define  RT_HS_SPN_SCK   8
    #define  RT_HS_SPN_MISO  9
    #define  RT_HS_SPN_MOSI  10
    #define  RT_HS_SPN_SS    11	
//==================================================================================================
//								1.5. Доступные пины
//==================================================================================================  
    #define RT_HS_PERMIT_PIN_ALL 		(uint8_t)70	
    #define RT_HS_PERMIT_PIN_DOT 		(uint8_t)70	
    #define RT_HS_PERMIT_PIN_PWM		(uint8_t)15	   
    #define RT_HS_PERMIT_PIN_DIN		(uint8_t)70
    #define RT_HS_PERMIT_PIN_ADC		(uint8_t)16	
    #define RT_HS_PERMIT_PIN_INT		(uint8_t)6
//---------------------------------------------------------------------------------------------------
    const uint8_t PROGMEM RT_HS_PGM_PIN_ALL_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,
												  24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,
												  48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69, 		RT_HS_PGM_END};
    const uint8_t PROGMEM RT_HS_PGM_PIN_DOT_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,
												  24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,
												  48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,		RT_HS_PGM_END};
    const uint8_t PROGMEM RT_HS_PGM_PIN_PWM_ID[]={ 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,44,45,46,	                       		RT_HS_PGM_END}; 
    const uint8_t PROGMEM RT_HS_PGM_PIN_DIN_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,
												  24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,
												  48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69, 		RT_HS_PGM_END}; 
    const uint8_t PROGMEM RT_HS_PGM_PIN_ADC_ID[]={54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,	                   		RT_HS_PGM_END}; 
	const uint8_t PROGMEM RT_HS_PGM_PIN_INT_ID[]={ 2, 3,18,19,20,21,				                                   		RT_HS_PGM_END};
//-------------------------------------------------------------------------------------------------	
//=================================================================================================
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
