//=================================================================================================

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//									4. БАЗОВЫЕ ФУНКЦИИ SPN
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
// 		    						4.1. Настройка устройства c oe
//=================================================================================================
  uint8_t	RT_HW_BASE::	spnSetParam(RT_HW_STRUCT_SPN_DEV &id, uint8_t sck, uint8_t miso, uint8_t mosi, uint8_t cs, uint8_t oe, uint8_t speed){
	(void) oe;
	if(id.custom==0){
		id.link=id.status=id.codeErr=0; 
		id.sck=sck; id.miso=miso; id.mosi=mosi; id.cs=cs; 
		id.oe=oe;
		id.speed=speed; 
		id.custom=1;
	} 
	return id.custom;
  };
//-------------------------------------------------------------------------------------------------
  uint8_t	RT_HW_BASE::	spnSetParam(RT_HW_STRUCT_SPN_DEV &id, uint8_t sck, uint8_t miso, uint8_t mosi, uint8_t cs, uint8_t speed){
	if(id.custom==0){
		id.link=id.status=id.codeErr=0; 
		id.sck=sck; id.miso=miso; id.mosi=mosi; id.cs=cs; 
		id.speed=speed; 
		id.custom=1;
	} 
	return id.custom;
  };
//=================================================================================================
//									4.5. spnInitDevice(id)
//=================================================================================================
  void		RT_HW_BASE::	spnInitDevice(RT_HW_STRUCT_SPN_DEV &id){ 
	id.link=1;
	if(id.custom==0){id.codeErr=50; return;} 
	if(id.status==1){id.codeErr=0;  return;}
	id.status=id.codeErr=0;
//-------------------------------------------------------------------------------------------------
	if(!checkPinDOT(id.sck)) {id.codeErr=150; return;}	//--Ошибка пина SCK;
	if(!checkPinDOT(id.cs))  {id.codeErr=151; return;}	//--Ошибка пина SCK;
//-------------------------------------------------------------------------------------------------
					                           digitalWrite(id.sck, 0); pinMode(id.sck, OUTPUT);
					                           digitalWrite(id.cs,  1); pinMode(id.cs,  OUTPUT);
//-------------------------------------------------------------------------------------------------
	if( checkPinDIN(id.miso)){id.permitMISO=1;                          pinMode(id.miso,INPUT_PULLUP);}	//--Разрешение MISO, если допустимый пин;	
	if( checkPinDOT(id.mosi)){id.permitMOSI=1; digitalWrite(id.mosi,0); pinMode(id.mosi,OUTPUT); }		//--Разрешение MOSI, если допустимый пин;			
	if( checkPinDOT(id.oe))  {id.permitOE  =1; digitalWrite(id.oe,  1); pinMode(id.oe,  OUTPUT);}		//--Разрешение   OE, если недопустимый пин;			
//-------------------------------------------------------------------------------------------------
	if(id.speed>100){id.speed=100;} id.time=10-(id.speed/10);	
//-------------------------------------------------------------------------------------------------
	id.custom=id.status=id.link=1;	
  };
//=================================================================================================
//									4.10. Запись байта tx, возвращает прочитанный байт;
//=================================================================================================
  uint8_t	RT_HW_BASE::	spnTransferVar(RT_HW_STRUCT_SPN_DEV &id, uint8_t tx){				 
	uint8_t rx=0; (void)rx; (void)id; (void)tx;
	if((!id.permitMISO) || (!id.permitMOSI)){id.codeErr=201; id.link=1; return 1;} //--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------
	id.link=0;													//--Сброс флага успешного завершения;
	digitalWrite(id.sck,0);										//  0--->SCK;	
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.cs,0);										//  0--->CS; 								
//-------------------------------------------------------------------------------------------------
		for(int8_t i=7; i>=0; i--){								//--Побитовые операции;							
			digitalWrite(id.mosi,(tx & (1<<i)));				//--Побитовый вывод;	
			digitalWrite(id.sck,1); 							//  1--->SCK;
			RT_HW_DELAY(id.time);								//--Задержка;                            
			if(digitalRead(id.miso)){rx |=(1<<i);} 				//--Побитовый ввод; 
			digitalWrite(id.sck,0); 							//  0--->SCK;
			RT_HW_DELAY(id.time);								//--Задержка;   			
		}														//--END for();																					
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,1);										//  1--->CS; 
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.sck, 0);									//  0--->SCK;  
	digitalWrite(id.mosi,0);									//  0--->MOSI;
	id.link=1;													//--Установка флага успешного завершения;
	return rx;													//--Возвращает прочитанный байт;
  };
//=================================================================================================
//									4.11. Запись байта tx, чтение байта в rx;
//=================================================================================================
  void		RT_HW_BASE::	spnTransfer(RT_HW_STRUCT_SPN_DEV &id, uint8_t tx, uint8_t &rx){				 
	(void)id; (void)tx; (void)rx;
	if((!id.permitMISO) || (!id.permitMOSI)){id.codeErr=202; id.link=1; return;} //--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------
	id.link=0;													//--Сброс флага успешного завершения;
	digitalWrite(id.sck,0);										//  0--->SCK;	
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.cs,0);										//  0--->CS; 								
//-------------------------------------------------------------------------------------------------
		for(int8_t i=7; i>=0; i--){								//--Побитовые операции;					
			digitalWrite(id.mosi,(tx & (1<<i)));				//--Побитовый вывод;	
			digitalWrite(id.sck,1); 							//  1--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;                           
			if(digitalRead(id.miso)){rx|=(1<<i);}				//--Побитовый ввод; 
			digitalWrite(id.sck,0); 							//  0--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;  			
		}														//--END for(i);																						
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,1);										//  1--->CS; 
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.sck,0);										//  0--->SCK;  
	digitalWrite(id.mosi,0);									//  0--->MOSI;
	id.link=1;													//--Установка флага успешного завершения;
  };
//=================================================================================================
//									4.12. Запись байта tx;
//=================================================================================================
  void		RT_HW_BASE::	spnWrite(RT_HW_STRUCT_SPN_DEV &id, uint8_t tx){				 
	(void)id; (void)tx;
	if(!id.permitMOSI){id.codeErr=203; id.link=1; return;} 		//--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------
	id.link=0;													//--Сброс флага успешного завершения;
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.sck,0);										//  0--->SCK;	
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.cs,0);										//  0--->CS; 								
//-------------------------------------------------------------------------------------------------
		for(int8_t i=7; i>=0; i--){								//--Побитовые операции;					
		    digitalWrite(id.mosi,(tx & (1<<i)));				//--Побитовый вывод;	
			digitalWrite(id.sck,1); 							//  1--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;                           
			digitalWrite(id.sck,0); 							//  0--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;  			
		}														//--END for(i);																						
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,1);										//  1--->CS;
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.sck, 0);									//  0--->SCK;  
	digitalWrite(id.mosi,0);									//  0--->MOSI;
	id.link=1;													//--Установка флага успешного завершения;
  };
 //=================================================================================================
//									4.13. Чтение байта rx;
//=================================================================================================
  void		RT_HW_BASE::	spnRead(RT_HW_STRUCT_SPN_DEV &id, uint8_t &rx){				 
	(void)id; (void)rx;
	if(!id.permitMISO){id.codeErr=204; id.link=1; return;} 		//--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------
	id.link=0;													//--Сброс флага успешного завершения;
	digitalWrite(id.sck,0);										//  0--->SCK;	
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.cs,0);										//  0--->CS; 								
//-------------------------------------------------------------------------------------------------
		for(int8_t i=7; i>=0; i--){								//--Побитовые операции;					
			digitalWrite(id.sck,1); 							//  1--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;                           
		    if(digitalRead(id.miso)){rx|=(1<<i);}				//-Побитовый ввод; 
			digitalWrite(id.sck,0); 							//  0--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;  			
		}														//--END for(i);																						
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,1);										//  1--->CS; 
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.sck,0);										//  0--->SCK;  
	digitalWrite(id.mosi,0);									//  0--->MOSI;
	id.link=1;													//--Установка флага успешного завершения;
  }; 		
//=================================================================================================
//									4.14. Запись qnt байт из arr[] и чтение в  arr[]
//=================================================================================================
  void		RT_HW_BASE::	spnTransferArr(RT_HW_STRUCT_SPN_DEV &id, uint8_t *arr, uint8_t qnt){				 
	(void)id; (void)arr; (void)qnt;
	if((!id.permitMISO) || (!id.permitMOSI)){id.codeErr=205; id.link=1; return;} //--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
	id.link=0;													//--Сброс флага успешного завершения;
	digitalWrite(id.sck,0);										//  0--->SCK;	
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,0);										//  0--->CS; 
//-------------------------------------------------------------------------------------------------
//	for(int8_t d=qnt-1; d>=0; d--){								//--Побайтовый перебор массивов;
	for(int8_t d=0; d<qnt; d++){								//--Побайтовый перебор массивов;
		arr[d]=0;												//--Очистка выходного регистра;
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -							
		for(int8_t i=7; i>=0; i--){								//--Побитовые операции;					
		    digitalWrite(id.mosi,(arr[d] &(1<<i)));				//--Побитовый вывод;	
			digitalWrite(id.sck,1); 							//  1--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;                           
		    if(digitalRead(id.miso)){arr[d] |=(1<<i);}			//--Побитовый ввод; 
			digitalWrite(id.sck,0); 							//  0--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;  			
		}														//--END for(i);																						
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	}															//--END for(d);
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,1);										//  1--->CS; 
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.sck,0);										//  0--->SCK;  
	digitalWrite(id.mosi,0);									//  0--->MOSI;
	id.link=1;													//--Установка флага успешного завершения;
  };
//=================================================================================================
//									4.15. Запись qnt байт из  tx[] и чтение в  rx[]
//=================================================================================================
  void		RT_HW_BASE::	spnTransferArr(RT_HW_STRUCT_SPN_DEV &id, uint8_t *tx, uint8_t *rx, uint8_t qnt){				 
	(void)id; (void)tx; (void)rx; (void)qnt;
	if((!id.permitMISO) || (!id.permitMOSI)){id.codeErr=206; id.link=1; return;} //--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
	id.link=0;													//--Сброс флага успешного завершения;
	digitalWrite(id.sck,0);										//  0--->SCK;	
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,0);										//  0--->CS; 
//-------------------------------------------------------------------------------------------------
//	for(int8_t d=qnt-1; d>=0; d--){								//--Побайтовый перебор массивов;
	for(int8_t d=0; d<qnt; d++){								//--Побайтовый перебор массивов;
		rx[d]=0;												//--Очистка выходного регистра;
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -								
		for(int8_t i=7; i>=0; i--){								//--Побитовые операции;					
		    digitalWrite(id.mosi,(tx[d] &(1<<i)));				//--Побитовый вывод;	
			digitalWrite(id.sck,1); 							//  1--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;                           
		    if(digitalRead(id.miso)){rx[d] |=(1<<i);}			//--Побитовый ввод; 
			digitalWrite(id.sck,0); 							//  0--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;  			
		}														//--END for(i);																						
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	}															//--END for(d);
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,1);										//  1--->CS; 
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.sck,0);										//  0--->SCK;  
	digitalWrite(id.mosi,0);									//  0--->MOSI;
	id.link=1;													//--Установка флага успешного завершения;
  };
//=================================================================================================
//									4.16. Запись qnt байт из  tx[]
//=================================================================================================
  void		RT_HW_BASE::	spnWriteArr(RT_HW_STRUCT_SPN_DEV &id, uint8_t *tx, uint8_t qnt){				 
	(void)id; (void)tx; (void)qnt;
	if(!id.permitMOSI){id.codeErr=205; id.link=1; return;} 		//--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
	id.link=0;													//--Сброс флага успешного завершения;
	digitalWrite(id.sck,0);										//  0--->SCK;	
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,0);										//  0--->CS; 	
//-------------------------------------------------------------------------------------------------
//	for(int8_t d=qnt-1; d>=0; d--){								//--Побайтовый перебор массивов;
	for(int8_t d=0; d<qnt; d++){								//--Побайтовый перебор массивов;
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -							
		for(int8_t i=7; i>=0; i--){								//--Побитовые операции;					
		    digitalWrite(id.mosi,(tx[d] &(1<<i)));				//--Побитовый вывод;	
			digitalWrite(id.sck,1); 							//  1--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;                           
			digitalWrite(id.sck,0); 							//  0--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;  			
		}														//--END for(i);																						
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	}															//--END for(d);
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,1);										//  1--->CS;
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.sck,0);										//  0--->SCK;  
	digitalWrite(id.mosi,0);									//  0--->MOSI;
	id.link=1;													//--Установка флага успешного завершения;
  };  
//=================================================================================================
//									4.17. Чтение qnt байт в  rx[]
//=================================================================================================
  void		RT_HW_BASE::	spnReadArr(RT_HW_STRUCT_SPN_DEV &id, uint8_t *rx, uint8_t qnt){				 
	(void)id;  (void)rx; (void)qnt;
	if(!id.permitMISO){id.codeErr=206; id.link=1; return;} 		//--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
	id.link=0;													//--Сброс флага успешного завершения;
	digitalWrite(id.sck,0);										//  0--->SCK;	
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,0);										//  0--->CS; 
//-------------------------------------------------------------------------------------------------
//	for(int8_t d=qnt-1; d>=0; d--){								//--Побайтовый перебор массивов;
	for(int8_t d=0; d<qnt; d++){								//--Побайтовый перебор массивов;
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
		digitalWrite(id.cs,0);									//  0--->CS; 								
		for(int8_t i=7; i>=0; i--){								//--Побитовые операции;					
			digitalWrite(id.sck,1); 							//  1--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;                           
		    if(digitalRead(id.miso)){rx[d] |=(1<<i);}			//--Побитовый ввод; 
			digitalWrite(id.sck,0); 							//  0--->SCK
			RT_HW_DELAY(id.time);								//--Задержка;  			
		}														//--END for(i);																						
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	}															//--END for(d);
//-------------------------------------------------------------------------------------------------	
	digitalWrite(id.cs,1);										//  1--->CS; 
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.sck,0);										//  0--->SCK;  
	digitalWrite(id.mosi,0);									//  0--->MOSI;
	id.link=1;													//--Установка флага успешного завершения;
  };   

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//									5.ФУНЦИИ ОБМЕНА СЛОВАМИ (qnt=1-4)
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//									5.1.Обмен  словами длиной 1,2,3 или 4 байта;
//=================================================================================================
  void		RT_HW_BASE::	spnTransferShift(RT_HW_STRUCT_SPN_DEV &id, uint32_t tx, uint32_t &rx, uint8_t qnt){				 
	(void)id; (void)tx;	(void)rx; (void)qnt;
	if((!id.permitMISO) || (!id.permitMOSI)){id.codeErr=207; id.link=1; return;} //--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
	id.link=0; 													//--Сброс флага успешной операции;
	rx=0;														//--Очистка регистра чтения;
	if(qnt==0){id.link=1;    	return;}						//--Выход, если количество байтов qnt=0;
	if(qnt>4) {qnt=4;} 											//--Ограничение кол-во байт (qnt<=4);
	qnt=qnt*8;													//--Длина слова в битах;  
	digitalWrite(id.sck,0);										//  0--->SCK;	
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
		digitalWrite(id.cs,0);									//  0--->CS; 										
		if(id.bitOrder)	{for(int8_t i=qnt-1; i>=0; i--){			//--Побитовые операции;					
							digitalWrite(id.mosi,(tx & (1<<i)));//--Побитовый вывод;	
							digitalWrite(id.sck,1); 			//  1--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;                           
							if(digitalRead(id.miso)){rx|=(1<<i);}//-Побитовый ввод; 
							digitalWrite(id.sck,0); 			//  0--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;  			
						}										//--END for(i);	
		}
		//------------------------------------------------------------------------------------------------
		else			{for(int8_t i=0; i<=qnt-1; i++){		//--Побитовые операции;					
							digitalWrite(id.mosi,(tx & (1<<i)));	//--Побитовый вывод;	
							digitalWrite(id.sck,1); 				//  1--->SCK
							RT_HW_DELAY(id.time);					//--Задержка;                           
							if(digitalRead(id.miso)){rx |=(1<<i);} 	//--Побитовый ввод; 
							digitalWrite(id.sck,0); 				//  0--->SCK
							RT_HW_DELAY(id.time);					//--Задержка;  			
						}										//--END for(i);
		}				
		//------------------------------------------------------------------------------------------------
		digitalWrite(id.cs,1);									//  1--->CS; 
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.sck, 0);									//  0--->SCK;  
	digitalWrite(id.mosi,0);									//  0--->MOSI;
	id.link=1;													//--Установка флага успешного завершения;
  };
//=================================================================================================
//									5.2. Запись  словами длиной 1,2,3 или 4 байта;
//=================================================================================================
  void		RT_HW_BASE::	spnWriteShift(RT_HW_STRUCT_SPN_DEV &id, uint32_t tx, uint8_t qnt){				 
	(void)id; (void)tx;	(void)qnt;
	if(!id.permitMOSI){id.codeErr=208; id.link=1; return;} 		//--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
	id.link=0; 													//--Сброс флага успешной операции;
	if(qnt==0){id.link=1;    	return;}						//--Выход, если количество байтов qnt=0;
	if(qnt>4) {qnt=4;} 											//--Ограничение кол-во байт (qnt<=4);
	qnt=qnt*8;													//--Длина слова в битах;  
	digitalWrite(id.sck,0);										//  0--->SCK;	
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
		digitalWrite(id.cs,0);									//  0--->CS; 										
		if(id.bitOrder) {for(int8_t i=qnt-1; i>=0; i--){		//--Побитовые операции;					
							digitalWrite(id.mosi,(tx & (1<<i)));//--Побитовый вывод;	
							digitalWrite(id.sck,1); 			//  1--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;                           
							digitalWrite(id.sck,0); 			//  0--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;  			
						}										//--END for(i);	
		}
		//------------------------------------------------------------------------------------------------
		else		    {for(int8_t i=0; i<=qnt-1; i++){		//--Побитовые операции;					
							digitalWrite(id.mosi,(tx & (1<<i)));//--Побитовый вывод;	
							digitalWrite(id.sck,1); 			//  1--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;                           
							digitalWrite(id.sck,0); 			//  0--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;  			
						}										//--END for(i);
		}				
		//------------------------------------------------------------------------------------------------
		digitalWrite(id.cs,1);									//  1--->CS; 
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.sck, 0);									//  0--->SCK;  
	digitalWrite(id.mosi,0);									//  0--->MOSI;
	id.link=1;													//--Установка флага успешного завершения;
  };  
//=================================================================================================
//									5.3. Чтение  словами длиной 1,2,3 или 4 байта;
//=================================================================================================
  void		RT_HW_BASE::	spnReadShift(RT_HW_STRUCT_SPN_DEV &id, uint32_t &rx, uint8_t qnt){				 
	(void)id; (void)rx; (void)qnt;
	if(!id.permitMISO){id.codeErr=209; id.link=1; return;} 		//--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
	id.link=0; 								//--Сброс флага успешной операции;
	rx=0;									//--Очистка регистра чтения;
	if(qnt==0){id.link=1;    	return;}	//--Выход, если количество байтов qnt=0;
	if(qnt>4) {qnt=4;} 						//--Ограничение кол-во байт (qnt<=4);
	qnt=qnt*8;								//--Длина слова в битах;  
	digitalWrite(id.sck,0);					//  0--->SCK;	
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
		digitalWrite(id.cs,0);									//  0--->CS; 										
		if(id.bitOrder)	{for(int8_t i=qnt-1; i>=0; i--){		//--Побитовые операции;					
							digitalWrite(id.sck,1); 			//  1--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;                           
							if(digitalRead(id.miso)){rx|=(1<<i);}//-Побитовый ввод; 
							digitalWrite(id.sck,0); 			//  0--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;  			
						}										//--END for(i);	
		}
		//------------------------------------------------------------------------------------------------
		else			{for(int8_t i=0; i<=qnt-1; i++){		//--Побитовые операции;						
							digitalWrite(id.sck,1); 			//  1--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;                           
							if(digitalRead(id.miso)){rx|=(1<<i);}//-Побитовый ввод; 
							digitalWrite(id.sck,0); 			//  0--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;  			
						}										//--END for(i);
		}				
		//------------------------------------------------------------------------------------------------
		digitalWrite(id.cs,1);									//  1--->CS; 
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.sck,	0);									//  0--->SCK;  
	digitalWrite(id.mosi,0);									//  0--->MOSI;
	id.link=1;													//--Установка флага успешного завершения;
  };
//=================================================================================================  
  
  
  
  
  
/*
//=================================================================================================
//									5.20. 74HC165
//=================================================================================================
  void		RT_HW_BASE::	spn74HC165(RT_HW_STRUCT_SPN_DEV &id, uint32_t &rx, uint8_t qnt){
	(void)id; (void)rx; (void)qnt;
	if(!id.permitMISO){id.codeErr=210; id.link=1; return;} 		//--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
	id.link=0; 													//--Сброс флага успешной операции;
	rx=0;														//--Очистка регистра чтения;
	if(qnt==0){id.link=1;    	return;}						//--Выход, если количество байтов qnt=0;
	if(qnt>4) {qnt=4;} 											//--Ограничение кол-во байт (qnt<=4);
	qnt=qnt*8;													//--Длина слова в битах;  
	digitalWrite(id.sck,0);										//  0--->SCK;	
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
		digitalWrite(id.cs,0);									//  0--->CS; 										
		if(id.bitOrder)	{for(int8_t i=qnt-1; i>=0; i--){		//--Побитовые операции;					
							digitalWrite(id.sck,1); 			//  1--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;                           
							if(digitalRead(id.miso)){rx|=(1<<i);}//Побитовый ввод; 
							digitalWrite(id.sck,0); 			//  0--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;  			
						}										//--END for(i);
		}				
		//------------------------------------------------------------------------------------------------
		else			{for(int8_t i=0; i<=qnt-1; i++){		//--Побитовые операции;						
							digitalWrite(id.sck,1); 			//  1--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;                           
							if(digitalRead(id.miso)){rx|=(1<<i);}//-Побитовый ввод; 
							digitalWrite(id.sck,0); 			//  0--->SCK
							RT_HW_DELAY(id.time);				//--Задержка;  			
						}										//--END for(i);	
		}				
		//------------------------------------------------------------------------------------------------
		digitalWrite(id.cs,1);									//  1--->CS; 
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	digitalWrite(id.sck,1);										//  1--->SCK; 
	id.link=1;													//--Установка флага успешного завершения;
  };
*/  
/*
//=================================================================================================
//									5.21. 74HC595
//=================================================================================================
	void	RT_HW_BASE::	spn74HC595(RT_HW_STRUCT_SPN_DEV &id, uint32_t tx, uint8_t qnt){
 	(void)id; (void)tx; (void)qnt;     
	if((!id.permitMISO) || (!id.permitMOSI)){id.codeErr=211; id.link=1; return;} //--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
		id.link=0;													//--Сброс флага успешной операции;
		if(qnt==0){id.link=1;    	return;}						//--Выход, если количество байтов qnt=0;
		if(qnt>4) {qnt=4;} 											//--Ограничение кол-во байт (qnt<=4);
		uint8_t b=qnt*8-1;		//--Длина слова в битах; 
//-------------------------------------------------------------------------------------------------------
		RT_HW_PIN_DIR_ID idSCK;	 idSCK.bitMask =RT_HW_PIN_TO_BITMASK(id.sck); 	idSCK.baseReg =RT_HW_PIN_TO_BASEREG(id.sck);
		RT_HW_PIN_DIR_ID idMOSI; idMOSI.bitMask=RT_HW_PIN_TO_BITMASK(id.mosi); 	idMOSI.baseReg=RT_HW_PIN_TO_BASEREG(id.mosi);
		RT_HW_PIN_DIR_ID idCS;	 idCS.bitMask  =RT_HW_PIN_TO_BITMASK(id.cs); 	idCS.baseReg  =RT_HW_PIN_TO_BASEREG(id.cs);	

		RT_HW_DIRECT_WRITE_LOW(idSCK.baseReg,idSCK.bitMask);	//--SCK->0;
		RT_HW_DIRECT_WRITE_LOW(idMOSI.baseReg,idMOSI.bitMask);	//--MOSI->0;
		uint8_t v;	
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -										
		for(int8_t i=0; i<=b; i++){		//--Побитовые операции;					
		  if(id.bitOrder){v=bitRead(tx,b-i);}
		  else		   {v=bitRead(tx,i);}
		  if(v){RT_HW_DIRECT_WRITE_HIGH(idMOSI.baseReg,idMOSI.bitMask);}		//--Запись
		  else {RT_HW_DIRECT_WRITE_LOW (idMOSI.baseReg,idMOSI.bitMask);}		//		бита MOSI;
				RT_HW_DIRECT_WRITE_HIGH(idSCK.baseReg, idSCK.bitMask);	RT_HW_DELAY(id.time);	//--Строб SCK;   
				RT_HW_DIRECT_WRITE_LOW (idSCK.baseReg, idSCK.bitMask);	RT_HW_DELAY(id.time);	//		c задержкой;     			
		}			
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -		
				RT_HW_DIRECT_WRITE_LOW (idCS.baseReg, idCS.bitMask);	//--Строб	
				RT_HW_DIRECT_WRITE_HIGH(idCS.baseReg, idCS.bitMask);	//		cs;
				RT_HW_DIRECT_WRITE_LOW(idMOSI.baseReg,idMOSI.bitMask);	//--MOSI->0;
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -	
	if(id.stateOe==1){				//--Разрешить передачу на выходные пины (отключение третьего состояния);
		RT_HW_PIN_DIR_ID idOE;	 idOE.bitMask =RT_HW_PIN_TO_BITMASK(id.oe); 	idOE.baseReg =RT_HW_PIN_TO_BASEREG(id.oe);		
		RT_HW_DIRECT_WRITE_LOW (idOE.baseReg,idOE.bitMask);
		id.stateOe=2;
	}
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -		
		id.link=1;													//--Установка флага успешного завершения;
 } ;
*/ 
//=================================================================================================
//									5.22. DM13C x2
//=================================================================================================
  void		RT_HW_BASE::	spnDM13C(RT_HW_STRUCT_SPN_DEV &id, uint32_t tx, uint32_t &rx, uint8_t qnt){
 	(void)id; (void)tx; (void)rx; (void)qnt;   
	if((!id.permitMISO) || (!id.permitMOSI)){id.codeErr=212; id.link=1; return;} //--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
	id.link=0; 													//--Сброс флага успешной операции;
	rx=0;														//--Очистка регистра чтения;
	if(qnt==0){id.link=1;    	return;}						//--Выход, если количество байтов qnt=0;
	if(qnt>2){qnt=2;} 											//--Ограничение кол-во байт (qnt<=4);
	qnt<<=2;													//--Умножение x2;
	qnt=qnt*8;													//--Длина слова в битах;     
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
		digitalWrite(id.cs,0);									//  0--->CS; 										
		if(id.bitOrder){for(int8_t i=qnt-1; i>=0; i--){			//--Побитовые операции;					
						digitalWrite(id.mosi,(tx & (1<<i)));	//--Побитовый вывод;	
						digitalWrite(id.sck,1); 				//  1--->SCK
						RT_HW_DELAY(id.time);					//--Задержка;                           
						if(digitalRead(id.miso)){rx |=(1<<i);}	//--Побитовый ввод; 
						digitalWrite(id.sck,0); 				//  0--->SCK
						RT_HW_DELAY(id.time);					//--Задержка;  			
						}										//--END for(i);	
		}
		//------------------------------------------------------------------------------------------------
		else			{for(int8_t i=0; i<=qnt-1; i++){		//--Побитовые операции;					
						digitalWrite(id.mosi,(tx & (1<<i)));	//--Побитовый вывод;	
						digitalWrite(id.sck,1); 				//  1--->SCK
						RT_HW_DELAY(id.time);					//--Задержка;                           
						if(digitalRead(id.miso)){rx |=(1<<i);} 	//--Побитовый ввод; 
						digitalWrite(id.sck,0); 				//  0--->SCK
						RT_HW_DELAY(id.time);					//--Задержка;  			
						}										//--END for(i);
		}				
		//------------------------------------------------------------------------------------------------
		digitalWrite(id.cs,1);									//  1--->CS; 
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	if(id.stateOe==1){				//--Разрешить передачу на выходные пины (отключение третьего состояния);
		RT_HW_PIN_DIR_ID idOE;	 idOE.bitMask =RT_HW_PIN_TO_BITMASK(id.oe); 	idOE.baseReg =RT_HW_PIN_TO_BASEREG(id.oe);		
		RT_HW_DIRECT_WRITE_LOW (idOE.baseReg,idOE.bitMask);
		id.stateOe=2;
	}
//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -		
		id.link=1;													//--Установка флага успешного завершения;												//--Установка флага успешного завершения;
  };	
//=================================================================================================
