//#################################################################################################
//
//                        				API.h для SPN
//ecoins@mail.ru 02.01.2025г.
//=================================================================================================
//=================================================================================================
// 											0. Объекты UART
//=================================================================================================
	#if     defined(RT_HW_PERMIT_SPN0)
		RT_HW_STRUCT_SPN_DEV LinkSPN0;	   
	#endif 
//-------------------------------------------------------------------------------------------------
	#if     defined(RT_HW_PERMIT_SPN1)
		RT_HW_STRUCT_SPN_DEV LinkSPN1;	   
	#endif
//-------------------------------------------------------------------------------------------------
	#if     defined(RT_HW_PERMIT_SPN2)
		RT_HW_STRUCT_SPN_DEV LinkSPN2;	   
	#endif 
//-------------------------------------------------------------------------------------------------
	#if     defined(RT_HW_PERMIT_SPN3)
		RT_HW_STRUCT_SPN_DEV LinkSPN3;	   
	#endif 	
//-------------------------------------------------------------------------------------------------
	#if     defined(RT_HW_PERMIT_SPN4)
		RT_HW_STRUCT_SPN_DEV LinkSPN4;	   
	#endif 
//-------------------------------------------------------------------------------------------------
	#if     defined(RT_HW_PERMIT_SPN5)
		RT_HW_STRUCT_SPN_DEV LinkSPN5;	   
	#endif
//-------------------------------------------------------------------------------------------------
	#if     defined(RT_HW_PERMIT_SPN6)
		RT_HW_STRUCT_SPN_DEV LinkSPN7;	   
	#endif  	
//=================================================================================================

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										3. ФУНКЦИИ ОБМЕНА С SPI
//									FUNC_SPI_0020_CPP_COMMON_MCU_1.hpp
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  uint8_t 	spnGetPinSCK (					uint8_t bus=0);		//--3.1.Получение пина SCK  из объекта 	LinkSPIn;
  uint8_t 	spnGetPinMISO(					uint8_t bus=0);		//--3.2.Получение пина MISO из объекта 	LinkSPIn;
  uint8_t 	spnGetPinMOSI (					uint8_t bus=0);		//--3.3.Получение пина MOSI из объекта 	LinkSPIn;
  uint8_t 	spnGetPinCS0(					uint8_t bus=0);		//--3.4.Получение пина CS 	из объекта 	LinkSPIn; 
  uint8_t 	spnGetPinCS1(					uint8_t bus=0);		//--3.5.Получение пина CS1 	из объекта 	LinkSPIn;  
  uint8_t 	spnGetPinOE(					uint8_t bus=0);		//--3.6.Получение пина OE 	из объекта 	LinkSPIn;  
  void   	spnInitParam(					uint8_t bus=0);		//--3.7.Иниц.параметров (и пинов) по умолчанию для SPIn;
  void 		spnInitParamAll();									//--3.8.Иниц.параметров (и пинов) по умолчанию для всех SPI;
//-------------------------------------------------------------------------------------------------
  uint8_t	spnCheckBus  (					uint8_t bus=0);		//--3.9.Проверка наличия на плате   	SPIn;
//-------------------------------------------------------------------------------------------------
  void     	spnSetCodeErr(uint8_t codeErr,  uint8_t bus=0);		//--3.10.Установка кода ошибки 			SPIn;
  uint8_t  	spnGetCodeErr(                  uint8_t bus=0);		//--3.11.Чтение    кода ошибки 			SPIn;
//-------------------------------------------------------------------------------------------------
  void     	spnSetSpeed  (uint8_t speed,   uint8_t bus=0);		//--3.12.Установка скорости 			SPIn;
  uint8_t	spnGetSpeed  (                  uint8_t bus=0);		//--3.13.Чтение    скорости 			SPIn;
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										4. ФУНКЦИИ ОБМЕНА С УСТРОЙСТВАМИ SPN
//										FUNC_SPN_0030_CPP_COMMON_DEVICE.hpp
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//-------------------------------------------------------------------------------------------------
  uint8_t 	spnSetParam  	(RT_HW_STRUCT_SPN_DEV &id, uint8_t sck, uint8_t miso, uint8_t mosi, uint8_t cs, uint8_t oe, uint8_t speed);
  uint8_t 	spnSetParam  	(RT_HW_STRUCT_SPN_DEV &id, uint8_t sck, uint8_t miso, uint8_t mosi, uint8_t cs, uint8_t speed=0);
  void  	spnInitDevice	(RT_HW_STRUCT_SPN_DEV &id); 										//--4.3.Настройка устройства;
//-------------------------------------------------------------------------------------------------
  uint8_t   spnTransferVar	(RT_HW_STRUCT_SPN_DEV &id, uint8_t  tx);							//--4.4.Запись байта tx, возвращает принятый байт;
  void  	spnTransfer   	(RT_HW_STRUCT_SPN_DEV &id, uint8_t  tx, uint8_t &rx);				//--4.5.Запись байта tx, чтение байта в rx;
  void    	spnWrite	  	(RT_HW_STRUCT_SPN_DEV &id, uint8_t  tx); 							//--4.6.Запись байта   tx;
  void  	spnRead		  	(RT_HW_STRUCT_SPN_DEV &id,              uint8_t &rx);				//--4.8.Чтение байта в rx;
//-------------------------------------------------------------------------------------------------
  void  	spnTransferArr	(RT_HW_STRUCT_SPN_DEV &id, uint8_t *arr,             uint8_t qnt=1);//--4.9. Запись qnt байт из arr[] и чтение в arr[];
  void  	spnTransferArr	(RT_HW_STRUCT_SPN_DEV &id, uint8_t *tx, uint8_t *rx, uint8_t qnt=1);//--4.10.Запись qnt байт из  tx[] и чтение в  rx[];
  void      spnWriteArr   	(RT_HW_STRUCT_SPN_DEV &id, uint8_t *tx,              uint8_t qnt=1);//--4.11.Запись qnt байт из  tx[];
  void  	spnReadArr    	(RT_HW_STRUCT_SPN_DEV &id, uint8_t *rx,              uint8_t qnt=1);//--4.12.Чтение qnt байт                   в  rx[];
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										3. ФУНКЦИИ ОБМЕНА С SPN
//									FUNC_SPN_0020_CPP_COMMON_MCU_1.hpp
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//                          			5.ФУНЦИИ ОБМЕНА СЛОВАМИ (qnt=1-4)
//										FUNC_UART_0030_CPP_COMMON_DEVICE.hpp
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  void  	spnTransferShift(RT_HW_STRUCT_SPN_DEV &id, uint32_t tx, uint32_t &rx,uint8_t qnt=1);//--5.1.Обмен  словами длиной 1,2,3 или 4 байта;
  void  	spnWriteShift	(RT_HW_STRUCT_SPN_DEV &id, uint32_t tx, 			 uint8_t qnt=1);//--5.2.Запись словами длиной 1,2,3 или 4 байта;
  void  	spnReadShift	(RT_HW_STRUCT_SPN_DEV &id, 				uint32_t &rx,uint8_t qnt=1);//--5.3.Чтение словами длиной 1,2,3 или 4 байта;
//-------------------------------------------------------------------------------------------------  
//  void	spn74HC165		(RT_HW_STRUCT_SPN_DEV &id, 				uint32_t &rx,uint8_t qnt=1);//--5.10.Чтение из 74HC165;	
//  void	spn74HC595		(RT_HW_STRUCT_SPN_DEV &id, uint32_t tx, 			 uint8_t qnt=1);//--5.11.Запись  в 74HC595;	 
  void		spnDM13C		(RT_HW_STRUCT_SPN_DEV &id, uint32_t tx, uint32_t &rx,uint8_t qnt=1);//--5.12.Запись  в DM13C;
 //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ 
 
 

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//                          				УСТАРЕВШИЕ ФУНКЦИИ
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

/*
//=================================================================================================
//									4.1.spnTransferVar(tx,&rx)
//=================================================================================================
void  spnTransfer(RT_HW_STRUCT_SPN_DEV &id, uint32_t tx, uint32_t &rx, uint8_t qnt=1){				 
	(void)id; 	(void)tx;	(void)rx;	(void)qnt;
	if((!id.permitMISO) || (!id.permitMOSI)){id.codeErr=206; id.link=1; return;} //--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
	id.link=0;													//--Сброс флага успешного завершения;
	rx=0;
//-------------------------------------------------------------------------------------------------
	if(qnt==0){id.link=1;    return;}		//--Exit for qnt=0;
	if(qnt>4){qnt=4;} 							//--Limitation for qnt;//
//-------------------------------------------------------------------------------------------------
for(int8_t i=qnt-1; i>=0; i--){
//-------------------------------------------------------------------------------------------------
				digitalWrite(id.sck,0);		//--SCK  set to LOW;	
				digitalWrite(id.cs,0);		//--CS   set to LOW; 								
//-------------------------------------------------------------------------------------------------
for(id.idb=7; id.idb>=0; id.idb--){														//--Bit I/O;
//-------------------------------------------------------------------------------------------------
if(id.permitMOSI){  digitalWrite(id.mosi,(tx & (1<<(id.idb+(8*id.idx)))));}	//--Bit Output;
                    digitalWrite(id.sck,1); RT_HW_DELAY(id.time);			//--Strobe SCK;                              
//-------------------------------------------------------------------------------------------------
if(id.permitMISO){if(digitalRead(id.miso)){rx |=(1<<(id.idb+(8*id.idx)));}}  //--Bit Input;
					 digitalWrite(id.sck,0); RT_HW_DELAY(id.time);			//--Strobe SCK;
//-------------------------------------------------------------------------------------------------
}}																					
//-------------------------------------------------------------------------------------------------
				  digitalWrite(id.cs,1);		//--SCK  set to LOW; 
				  digitalWrite(id.sck,0);		//--CS   set to HIGH;;  
if(id.permitMOSI){digitalWrite(id.mosi,0);}	//--MOSI set to LOW;
id.link=1;};
//=================================================================================================
//									4.2.spnWrite
//=================================================================================================
void  spnWrite(RT_HW_STRUCT_SPN_DEV &id, uint32_t tx, uint8_t qnt=1){id.userTX=1; id.userRX=0; spnTransfer(id,tx,id.bf32,qnt);};
//=================================================================================================
//									4.3.spnRead(id)
//=================================================================================================
void  spnRead (RT_HW_STRUCT_SPN_DEV &id, uint8_t qnt=1){id.userTX=0; id.userRX=1; spnTransfer(id, 0,id.bf32,qnt);};
//=================================================================================================
//									4.4.spnReadReg(id) [Gag]
//=================================================================================================
void  spnREAD(RT_HW_STRUCT_SPN_DEV &id,  uint8_t reg){id.userTX=0; id.userRX=1; spnTransfer(id,(uint32_t)reg,id.bf32,1);};
//=================================================================================================
//									4.5.spnReadRegs(id) [Gag]
//=================================================================================================
void  spnREADArr(RT_HW_STRUCT_SPN_DEV &id, uint8_t reg, uint8_t *arr, uint8_t qnt=1){id.bf32=reg; id.idx=qnt;  arr[0]=id.link=1;};

//=================================================================================================
//									4.6.spiRead74HC165(id)
//=================================================================================================
  void  spnRead74HC165(RT_HW_STRUCT_SPN_DEV &id, uint8_t qnt){
	(void)id; (void)qnt;
	if(!id.permitMISO){id.codeErr=205; id.link=1; return;} //--Недопустимые параметры;
//-------------------------------------------------------------------------------------------------	
	id.link=0; id.bf32=0;
//-------------------------------------------------------------------------------------------------
	if(qnt==0){id.link=1;    return;}	//--Exit for qnt=0;
	if(qnt>4){qnt=4;} 						//--Limitation for qnt;
//-------------------------------------------------------------------------------------------------
	digitalWrite(id.cs,0);		//--CS   set to LOW;
	delayMicroseconds(2);
	digitalWrite(id.cs,1); 		//--CS   set to HIGH; 
	for(id.idx=qnt-1; id.idx>=0; id.idx--){
//-------------------------------------------------------------------------------------------------
		for(id.idb=7; id.idb>=0; id.idb--){														//--Bit I/O;
//-------------------------------------------------------------------------------------------------
			if(id.permitMISO){if(digitalRead(id.miso)){id.bf32 |=(1<<(id.idb+(8*id.idx)));}
								 digitalWrite(id.sck,1);  RT_HW_DELAY(id.time);	//--Strobe SCK
								 digitalWrite(id.sck,0);  RT_HW_DELAY(id.time);	//		with delay;
			}   //--Bit Input;
//-------------------------------------------------------------------------------------------------
		}
	}																					
//-------------------------------------------------------------------------------------------------
								digitalWrite(id.sck,0);		//--SCK  set to LOW; 
	id.link=1;
  };
*/  
  
//=================================================================================================
