//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										Контроллер ESP32S ANON
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//										Контроллер ESP32S ANON
//=================================================================================================
#if !defined(RT_HW_BOARD_CODE) && defined(RT_HW_CORE_ESP32)
	#define  RT_HW_BOARD_CODE     (uint8_t)50 					//--Идентификатор выбора платы;
    #define  RT_HW_BOARD_NAME  	  "ESP32 ANON"     				//--Наименование платы;	
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_BOARD_MEMORY   "FLASH=1310Kb; RAM=328Kb; Ext_FLASH=4/16Mb;"//--Параметры памяти;
	#define  RT_HW_BOARD_FCPU     (uint16_t)80					//--Частота процессора;	
	#define  RT_HW_BOARD_VCC   	  3300							//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_ESP32_DEV_ANON  						//--Идентификатор типа платы;
//=================================================================================================
//										1. Ограничение ресурсов контроллера
//=================================================================================================

//=================================================================================================
//										2. Системные пины
//=================================================================================================
	#define  RT_HW_BOARD_PIN_CONTROL   12		//--Контроль цикла loop();12,  2, 34,36,25,
	#define  RT_HW_BOARD_PIN_LED        2		//--Led на плате;
	#define  RT_HW_BOARD_PIN_BUTTON    34		//--Кнопка на плате;
	#define  RT_HW_BOARD_PIN_ADC       36		//--ADC;	
	#define  RT_HW_BOARD_PIN_PWM       26		//--PWM;	9	
//=================================================================================================
//										3. Пины cs тестовые
//=================================================================================================
	#define  RT_HW_BOARD_PIN_CS0        5		//--SPI cs.0;  5,  4, 15, 2,
	#define  RT_HW_BOARD_PIN_CS1        4		//--SPI cs.1;	
	#define  RT_HW_BOARD_PIN_CS2       15		//--SPI cs.2;
	#define  RT_HW_BOARD_PIN_CS3        2		//--SPI cs.3;	
//=================================================================================================
//										4. Пины тестовых устройств
//=================================================================================================
	#define  RT_HW_BOARD_PIN_DS1820    33		//--Сенсор DS1820;33, 14,13,
	#define  RT_HW_BOARD_PIN_SR04      13		//--Сенсор HC-SR04;
	#define  RT_HW_BOARD_PIN_SERVO0    12		//--Серво-двигатель;
	#define  RT_HW_BOARD_PIN_SERVO1    14		//--Серво-двигатель 1;
//=================================================================================================
//										5. Номера тестовых UART
//=================================================================================================	
	#define  RT_HW_BOARD_UART_MODBUS1  1		//--Номер UART для MODBUS 1;
	#define  RT_HW_BOARD_UART_HMI  	   2		//--Номер UART для HMI 1;
//=================================================================================================
//										10. Коммуникации
//=================================================================================================
//=================================================================================================
//										10.1. UART
//=================================================================================================
    #define  RT_HW_PERMIT_UART0					//--Разрешение работы с UART0;
//    #define  RT_HW_PERMIT_UART1				//--Разрешение работы с UART1;
//  #define  RT_HW_PERMIT_UART2					//--Разрешение работы с UART2;			
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART0_RX   	3
    #define  RT_HW_UART0_TX   	4	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART1_RX   	14
    #define  RT_HW_UART1_TX   	27	
//------------------------------------------------------------------------------------------------- 
	#define  RT_HW_UART2_RX   	16
    #define  RT_HW_UART2_TX   	17	
//=================================================================================================
//										10.2. i2c
//=================================================================================================
//    #define  RT_HW_PERMIT_I2C0					//--Разрешение работы с i2c0; 
//    #define  RT_HW_PERMIT_I2C1					//--Разрешение работы с i2c0;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C0_SCL  	22	
    #define  RT_HW_I2C0_SDA  	21
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C1_SCL  	32	
    #define  RT_HW_I2C1_SDA  	33
//=================================================================================================
//										10.3. SPI
//=================================================================================================
//    #define  RT_HW_PERMIT_SPI0					//--Разрешение работы с SPI0; 
//    #define  RT_HW_PERMIT_SPI1					//--Разрешение работы с SPI1;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI0_SCK  18
    #define  RT_HW_SPI0_MISO 19
    #define  RT_HW_SPI0_MOSI 23
    #define  RT_HW_SPI0_SS    5	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI1_SCK  14
    #define  RT_HW_SPI1_MISO 12
    #define  RT_HW_SPI1_MOSI 13
    #define  RT_HW_SPI1_SS   15	
//=================================================================================================
//									1.10. Доступные пины
//=================================================================================================  
    #define RT_HW_PERMIT_PIN_ALL 	(uint8_t)39	
    #define RT_HW_PERMIT_PIN_DOT 	(uint8_t)29	
    #define RT_HW_PERMIT_PIN_PWM	(uint8_t)29	   
    #define RT_HW_PERMIT_PIN_DIN	(uint8_t)29
    #define RT_HW_PERMIT_PIN_ADC	(uint8_t)6		
    #define RT_HW_PERMIT_PIN_SRV	(uint8_t)2			
    #define RT_HW_PERMIT_PIN_INT	(uint8_t)33 
    #define RT_HW_PERMIT_PIN_N5V	(uint8_t)39 	
    #define RT_HW_PERMIT_PIN_TCH	(uint8_t)10 
    #define RT_HW_PERMIT_PIN_HAL	(uint8_t)1 	
//--------------------------------Доступные пины контроллера---------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_ALL_ID[] ={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,
													20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,39,	 	RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DOT_ID[] ={ 0, 1, 2, 3, 4, 5,12,13,14,15,16,17,18,19,
													20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,				RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_PWM_ID[] ={ 0, 1, 2, 3, 4, 5,12,13,14,15,16,17,18,19,
													20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,			 	RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DIN_ID[] ={ 0, 1, 2, 3, 4, 5,12,13,14,15,16,17,18,19,
													20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,39, 	  	RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_ADC_ID[] ={36,39,32,33,34,35, 	  		  							  	RT_HW_PGM_END};	
    const uint8_t PROGMEM RT_HW_PGM_PIN_SRV_ID[] ={12,14,														RT_HW_PGM_END};		
	const uint8_t PROGMEM RT_HW_PGM_PIN_TCH_ID[] ={ 4, 0, 2,15,13,12,14,27,33,32,							  	RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DAC_ID[] ={25,26,													  	RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_INT_ID[] ={ 0, 1, 2, 3, 4, 5,12,13,14,15,16,17,18,19,
													20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,39,     	RT_HW_PGM_END};	
	const uint8_t PROGMEM RT_HW_PGM_PIN_N5V_ID[] ={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,
													20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,39,     	RT_HW_PGM_END};	
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++