//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//						1.МАКРОСЫ ДЛЯ РАБОТЫ С UART
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//						1.1.UART: коды типы
//=================================================================================================
#define RT_HW_TYPE_UART_USB   	0		//--USB;
#define RT_HW_TYPE_UART_UART  	1		//--UART
#define RT_HW_TYPE_UART_USART  	2		//--USART;
//=================================================================================================
//						1.2.UART: коды скоростей
//=================================================================================================
#define RT_HW_SPEED_300         0
#define RT_HW_SPEED_600         1
#define RT_HW_SPEED_1200        2
#define RT_HW_SPEED_2400        3
#define RT_HW_SPEED_4800        4
#define RT_HW_SPEED_9600        5
#define RT_HW_SPEED_14400       6
#define RT_HW_SPEED_19200       7
#define RT_HW_SPEED_28800       8
#define RT_HW_SPEED_38400       9
#define RT_HW_SPEED_57600      10
#define RT_HW_SPEED_115200     11
#define RT_HW_SPEED_230400     12
#define RT_HW_SPEED_460800     13
#define RT_HW_SPEED_921600     14
#define RT_HW_SPEED_1500000    15
#define RT_HW_SPEED_2000000    16
//=================================================================================================
//						 1.3.UART: коды стоповых битов(1,2), четности посылки, длиг.
//=================================================================================================
#define RT_HW_PORT_STOP_BITS_1   1		//--Один стоповый бит;
#define RT_HW_PORT_STOP_BITS_2   2		//--Два стоповых бита;
//-------------------------------------------------------------------------------------------------
#define RT_HW_PORT_DATA_BITS_5 	 5		//--Длина данных 5 битов;
#define RT_HW_PORT_DATA_BITS_6   6		//--Длина данных 6 битов;
#define RT_HW_PORT_DATA_BITS_7   7		//--Длина данных 7 битов;
#define RT_HW_PORT_DATA_BITS_8   8		//--Длина данных 8 битов;
//-------------------------------------------------------------------------------------------------
#define RT_HW_PORT_PARITY_NONE   0		//--Без контроля четности/нечетности;
#define RT_HW_PORT_PARITY_EVEN   1		//--Контроль четности;
#define RT_HW_PORT_PARITY_ODD    2		//--Контроль нечетности;

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//						3.Макросы для SPI
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define RT_HW_SPI_MSBFIRST       1
#define RT_HW_SPI_LSBFIRST       0
#define RT_HW_SPI_MODE0          0
#define RT_HW_SPI_MODE1          1
#define RT_HW_SPI_MODE2          2
#define RT_HW_SPI_MODE3          3
//=================================================================================================





