//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//						   					МАКРОСЫ 
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//											1.ОБЩИЕ
//=================================================================================================
//-------------------------------------------------------------------------------------------------
//						1.1. Макросы для совместимости функций micros(),millis()
//-------------------------------------------------------------------------------------------------
#define RT_HW_MICROS				micros()				//--Макрос измерения времени в mcs;
#define RT_HW_MILLIS				millis()				//--Макрос измерения времени в ms;

//-------------------------------------------------------------------------------------------------
//						1.2. Макросы чтения из массивов PROGMEM
//-------------------------------------------------------------------------------------------------
#define RT_HW_READ_BYTE_PGM(arr,n) 	pgm_read_byte(&arr[n])	//--Чтение из массива arr n байта;

//-------------------------------------------------------------------------------------------------
//						1.1. Макросы чтения из массивов PROGMEM
//-------------------------------------------------------------------------------------------------
    #define RT_HW_READ_BYTE_PGM(arr,n) 	pgm_read_byte(&arr[n])	//--Чтение из массива arr n байта;
//-------------------------------------------------------------------------------------------------
//						1.2. Макросы программной задержки (для быстрых процессов)
//-------------------------------------------------------------------------------------------------
    #define RT_HW_DELAY(x) if(x>0){do{for(int i=0;i<x;i++) {asm volatile("nop");}}while(0);}  //--Задержка в у.е.
//-------------------------------------------------------------------------------------------------
//						1.3. Макросы min, max (рекомендуется к применению)	
// Примечание: не применяйте макросы Arduino max() / min() поскольку они могут конфликтовать c C++(для некоторых версий)
//-------------------------------------------------------------------------------------------------
    #define RT_HW_MIN(a,b)     ((a)<(b)?(a):(b))  
    #define RT_HW_MAX(a,b)     ((a)>(b)?(a):(b))
    #define RT_HW_MIDLE(a,b,c) ((a < b) ? ((b < c) ? b : ((c < a) ? a : c)) : ((a < c) ? a : ((c < b) ? b : c)))
//-------------------------------------------------------------------------------------------------
//						1.4. Макросы ускоренных битовых операций
// коды для битов 0-7: ->1,2,4,6,8,16,32,64,128
//-------------------------------------------------------------------------------------------------
    #define RT_HW_BIT_SET(state,code)               (state) |= (code)			//--Установка битов;
    #define RT_HW_BIT_CLEAR(state,code)             (state) &=~(code)			//--Очистка битов;			
    #define RT_HW_BIT_BLINK(state,code)             (state) ^= (code)			//--Инверсия битов;
    #define RT_HW_BIT_READ(state,code)        (bool((state) &  (code)))			//--Чтение бита;
    #define RT_HW_BIT_WRITE(state,code,val) if(val){(state) |= (code);} else {(state) &=~(code);} 	//--Запись битов;
//-------------------------------------------------------------------------------------------------
    #define RT_HW_BIT_0 	1
    #define RT_HW_BIT_1 	2
    #define RT_HW_BIT_2 	4
    #define RT_HW_BIT_3 	8
    #define RT_HW_BIT_4 	16
    #define RT_HW_BIT_5 	32
    #define RT_HW_BIT_6 	64
    #define RT_HW_BIT_7 	128
//-------------------------------------------------------------------------------------------------
    #define RT_HW_CNV_ABCD_CDAB(P) ((uint32_t)P[0]<<8 | P[1] | P[2]<<24 | P[3]<<16 )  //--Изменение порядка байтов uint32 
//-------------------------------------------------------------------------------------------------
//						1.5. Макросы для работы с пинами
//-------------------------------------------------------------------------------------------------
    #define RT_HW_PGM_END    254  //--Признак завершения таблицы пинов (используется в описании плат);
    #define RT_HW_NOT_PIN    255  //--Признак отсутствия пина;

//-------------------------------------------------------------------------------------------------
//						1.6. Макросы для работы со строками
//-------------------------------------------------------------------------------------------------
	#define RT_HW_BREAK_CHAR	'~'						//--Блокирующий символ для работы со строками;
	#define RT_HW_BLANK_CHAR	' '						//--Cимвол для заполнения свободного поля в строках;



//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//						1.7. Макросы для работы с UNIX-временем
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	#define RT_HW_UNIX_CORRECTION_1900 2208988800UL; //--Разница в сек между датами 01.01.1990 и 01.01.1970; 

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//						1.7. Макросы для RT_HW_MESS.hpp
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	#define   RT_HW_MESS_BREAK    	(char)'~'
	#define   RT_HW_MESS_BLANK		(char)' '
	#define   RT_HW_MESS_LF	    	(char)10


	#define   RT_HW_UART_BREAK	char('~')	//--Блокирующий символ для работы со строками (пользовательский конец строки);
	#define   RT_HW_UART_BLANK	char(' ')	//--Cимвол для заполнения свободного поля в строках;
	#define   RT_HW_UART_LF		char(0x0a)	//--Cимвол перевода строки;
//=================================================================================================





