//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//								1.Контроллеры RP2040
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//								1. Контроллер RP2040 оригинальный
//=================================================================================================
#if !defined(RT_HW_BOARD_CODE) && defined(RT_HW_CORE_RP2040) &&\
	(defined(ARDUINO_RASPBERRY_PI_PICO)   || defined(ARDUINO_ADAFRUIT_KB2040_RP2040) || \
	 defined(ARDUINO_RASPBERRY_PI_PICO_W) || defined(ARDUINO_ARCH_RASPBERRY_PI)      || \
	 defined(ARDUINO_RASPBERRY_PI_PICO_EIS))
//-------------------------------------------------------------------------------------------------
	#if defined(ARDUINO_RASPBERRY_PI_PICO_EIS)
		#define  RT_HW_BOARD_CODE     (uint8_t)71 					//--Идентификатор выбора платы;
		#define  RT_HW_BOARD_NAME  	  "FLProg: RP2040"     			//--Наименование платы;	
		#define  RT_HW_BOARD_MEMORY   "FLASH=2000kB; RAM=264Kb;"	//--Параметры памяти;
		#define  RT_HW_BOARD_FCPU     (uint16_t)133					//--Частота процессора;	
		#define  RT_HW_BOARD_VCC   	  3300							//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------	
	#else
		#define  RT_HW_BOARD_CODE     (uint8_t)70 					//--Идентификатор выбора платы;
		#define  RT_HW_BOARD_NAME  	  "RP2040"     					//--Наименование платы;	
		#define  RT_HW_BOARD_MEMORY   "FLASH=2000kB; RAM=264Kb;"	//--Параметры памяти;
		#define  RT_HW_BOARD_FCPU     (uint16_t)133					//--Частота процессора;	
		#define  RT_HW_BOARD_VCC   	  3300							//--Значение Vсс процессора;
	#endif	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_RP2040  									//--Идентификатор типа платы;
//==================================================================================================
//								1.1. Ограничение ресурсов контроллера
//==================================================================================================

//==================================================================================================
//								1.2. Системные пины
//==================================================================================================
	#define  RT_HW_BOARD_PIN_CONTROL   28		//--Контроль цикла loop();28,255,22,26,27,
	#define  RT_HW_BOARD_PIN_LED       25		//--Led на плате;
	#define  RT_HW_BOARD_PIN_BUTTON    26		//--Кнопка на плате;
	#define  RT_HW_BOARD_PIN_ADC       27		//--ADC;
	#define  RT_HW_BOARD_PIN_PWM       10		//--PWM;
//	#define  RT_HW_BOARD_PIN_WS2812     7		//--WS2812;	
	#define  RT_HW_BOARD_PIN_CS0       17		//--SPI cs.0;17,20,21,22
	#define  RT_HW_BOARD_PIN_CS1       20		//--SPI cs.1;	
	#define  RT_HW_BOARD_PIN_CS2       21		//--SPI cs.2;
	#define  RT_HW_BOARD_PIN_CS3       22		//--SPI cs.3;	
//==================================================================================================
//								1.3. Тестовые устройства
//==================================================================================================
	#define  RT_HW_BOARD_PIN_DS1820    10		//--Сенсор DS1820;
	#define  RT_HW_BOARD_PIN_SR04      11		//--Сенсор HC-SR04;	
	#define  RT_HW_BOARD_PIN_TEST      28		//--Пин тестовый;			
//=================================================================================================
//								1.4. Тестовые UART
//=================================================================================================	
 	#define  RT_HW_BOARD_UART_CONSOLE  210		//--Номер UART для консоли;	
	#define  RT_HW_BOARD_UART_MODBUS1   1		//--Номер UART для MODBUS 1;
	#define  RT_HW_BOARD_UART_MODBUS2   2		//--Номер UART для MODBUS 2;
	#define  RT_HW_BOARD_UART_HMI1		3		//--Номер UART для панели HMI;	
//==================================================================================================
//								1.5.1. Коммуникации UART
//==================================================================================================
    #define  RT_HW_PERMIT_UART0					//--Разрешение работы с UART0; 
    #define  RT_HW_PERMIT_UART1					//--Разрешение работы с UART1; 
    #define  RT_HW_PERMIT_UART2					//--Разрешение работы с UART2; 
    #define  RT_HW_PERMIT_UART3					//--Разрешение работы с UART3;
    #define  RT_HW_PERMIT_UART4					//--Разрешение работы с UART4; 
    #define  RT_HW_PERMIT_UART5					//--Разрешение работы с UART5; 	
    #define  RT_HW_PERMIT_UART6					//--Разрешение работы с UART6; 		
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_CREATE_UART2					//--Разрешение создание объекта UART2; 
    #define  RT_HW_CREATE_UART3					//--Разрешение создание объекта UART3; 
    #define  RT_HW_CREATE_UART4					//--Разрешение создание объекта UART4; 
    #define  RT_HW_CREATE_UART5					//--Разрешение создание объекта UART5; 
    #define  RT_HW_CREATE_UART6					//--Разрешение создание объекта UART6; 
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART0_RX  			47
    #define  RT_HW_UART0_TX  			46	
    #define  RT_HW_UART1_RX   			1
    #define  RT_HW_UART1_TX   			0	
    #define  RT_HW_UART2_RX   			9
    #define  RT_HW_UART2_TX   			8	
    #define  RT_HW_UART3_RX 			13
    #define  RT_HW_UART3_TX 			12
    #define  RT_HW_UART4_RX  			15
    #define  RT_HW_UART4_TX  			14	
    #define  RT_HW_UART5_RX   			7
    #define  RT_HW_UART5_TX   			6	
    #define  RT_HW_UART6_RX  			27
    #define  RT_HW_UART6_TX  			26
//=================================================================================================
//								1.5.1. Коммуникации UART
//=================================================================================================
    #define  RT_HW_PERMIT_I2C0					//--Разрешение работы с i2c0; 
    #define  RT_HW_PERMIT_I2C1					//--Разрешение работы с i2c1;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C0_SDA   			4
    #define  RT_HW_I2C0_SCL   			5	
    #define  RT_HW_I2C1_SDA  			26
    #define  RT_HW_I2C1_SCL  			27

//=================================================================================================
//								1.5.3. Коммуникации SPI
//=================================================================================================
    #define  RT_HW_PERMIT_SPI0					//--Разрешение работы с SPI0; 
    #define  RT_HW_PERMIT_SPI1					//--Разрешение работы с SPI1; 	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI0_SCK  			18
    #define  RT_HW_SPI0_MISO 			16
    #define  RT_HW_SPI0_MOSI 			19
    #define  RT_HW_SPI0_SS   			17	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI1_SCK  			14
    #define  RT_HW_SPI1_MISO 			12
    #define  RT_HW_SPI1_MOSI 			15
    #define  RT_HW_SPI1_SS   			13	
//==================================================================================================
//								1.10. Доступные пины
//==================================================================================================  
    #define RT_HW_PERMIT_PIN_ALL 	(uint8_t)30	 	//--Доступные
    #define RT_HW_PERMIT_PIN_DOT 	(uint8_t)30		//--Дискретный выход;	
    #define RT_HW_PERMIT_PIN_PWM	(uint8_t)30		//--PWM   
    #define RT_HW_PERMIT_PIN_DIN	(uint8_t)70
    #define RT_HW_PERMIT_PIN_ADC	(uint8_t)16	
	#define RT_HW_PERMIT_PIN_SRV	(uint8_t)2	
    #define RT_HW_PERMIT_PIN_INT	(uint8_t)6
//---------------------------------------------------------------------------------------------------
    const uint8_t PROGMEM RT_HW_PGM_PIN_ALL_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,
	  										      16,17,18,19,20,21,22,23,24,25,26,27,28,29,		RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PIN_DOT_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,
												  16,17,18,19,20,21,22,23,24,25,26,27,28,29,	    RT_HW_PGM_END};	
    const uint8_t PROGMEM RT_HW_PGM_PIN_PWM_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,
											      16,17,18,19,20,21,22,23,24,25,26,27,28,29,		RT_HW_PGM_END}; 
    const uint8_t PROGMEM RT_HW_PGM_PIN_DIN_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,
											      16,17,18,19,20,21,22,23,24,25,26,27,28,29,		RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PIN_ADC_ID[]={26,27,28,29,   									RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PIN_SRV_ID[]={ 9,10,											RT_HW_PGM_END};	    
//-------------------------------------------------------------------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_INT_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,
											      16,17,18,19,20,21,22,23,24,25, 26,27,28,29,		RT_HW_PGM_END};	
	const uint8_t PROGMEM RT_HW_PGM_PIN_N5V_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,
											      16,17,18,19,20,21,22,23,24,25, 26,27,28,29,		RT_HW_PGM_END};													  												  
//-------------------------------------------------------------------------------------------------
//=================================================================================================
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
