//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//									Контроллер STM32F411CE
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================						
//									Контроллер STM32F411CE
//=================================================================================================
#if !defined(RT_HW_BOARD_CODE) && defined(ARDUINO_BLACKPILL_F411CE)
//-------------------------------------------------------------------------------------------------
    #define	 RT_HW_BOARD_CODE  		(uint16_t)73  				//--Идентификатор выбора платы c кодом платы;
//-------------------------------------------------------------------------------------------------                           
	#define  RT_HW_BOARD_NAME     "BlackPill F411CE"		//--Наименование платы;		
	#define	 RT_HW_BOARD_MEMORY	  "Flash=512Kb; SRAM=System(112+16+64)+Backup(4)Kb;"//--Параметры памяти;	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_FCPU       (uint16_t)100 		//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      	(uint16_t)3300		//--Значение Vсс процессора; 
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_CORE_STM32F4							//--Допол.идентификатор программной среды;
	#define  RT_HW_CORE_STM32F4C						//--Допол.идентификатор программной среды;
//=================================================================================================
//										1. Ограничение ресурсов контроллера
//=================================================================================================

//=================================================================================================
//										2. Системные пины
//=================================================================================================
	#define  RT_HW_BOARD_PIN_CONTROL   		PB5			//--Контроль цикла loop();
	#define  RT_HW_BOARD_PIN_LED       		PC13		//--Led на плате;
	#define  RT_HW_BOARD_PIN_BUTTON    		PA1			//--Button на плате;
	#define  RT_HW_BOARD_PIN_ADC       		PA0			//--ADC;
	#define  RT_HW_BOARD_PIN_PWM       		PB4			//--PWM;
//=================================================================================================
//										3. Пины cs тестовые
//=================================================================================================
	#define  RT_HW_BOARD_PIN_CS0       		PB12		//--SPI cs.0;
	#define  RT_HW_BOARD_PIN_CS1       		PB13		//--SPI cs.1;
	#define  RT_HW_BOARD_PIN_CS2       		PB14		//--SPI cs.2;	
	#define  RT_HW_BOARD_PIN_CS3       		PB15		//--SPI cs.3;
//=================================================================================================
//										4. Пины тестовых устройств
//=================================================================================================
	#define  RT_HW_BOARD_PIN_DS1820    		PB8			//--Сенсор DS1820;
	#define  RT_HW_BOARD_PIN_SR04      		PB9			//--Сенсор HC-SR04;
	#define  RT_HW_BOARD_PIN_TEST      		PA8		//--Пин тестовый;		
//=================================================================================================
//										5. Номера тестовых UART
//=================================================================================================	
	#define  RT_HW_BOARD_UART_CONSOLE   	210			//--Консоль через USB;
	#define  RT_HW_BOARD_UART_MODBUS1   	1			//--Номер UART для MODBUS 1;
	#define  RT_HW_BOARD_UART_HMI1			2			//--Номер UART для панели HMI;	
//=================================================================================================
//										10. Коммуникации
//=================================================================================================
//=================================================================================================
//										10.1. UART
//=================================================================================================
    #define  RT_HW_PERMIT_UART0							//--Разрешение работы с UART0;
    #define  RT_HW_PERMIT_UART1							//--Разрешение работы с UART1;
    #define  RT_HW_PERMIT_UART2							//--Разрешение работы с UART2;	
    #define  RT_HW_PERMIT_UART6							//--Разрешение работы с UART6;	
//-------------------------------------------------------------------------------------------------
	#define RT_HW_CREATE_UART2							//--Разрешение создания объекта Serial1;
	#define RT_HW_CREATE_UART6							//--Разрешение создания объекта Serial6;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART0_RX   		PA12
    #define  RT_HW_UART0_TX   		PA11	
    #define  RT_HW_UART1_RX   		PA10
    #define  RT_HW_UART1_TX   		PA9	
    #define  RT_HW_UART2_RX   		PA3
    #define  RT_HW_UART2_TX   		PA2	
    #define  RT_HW_UART6_RX  		PA12
    #define  RT_HW_UART6_TX   		PA11
//=================================================================================================
//										10.2. i2c
//=================================================================================================
    #define  RT_HW_PERMIT_I2C0							//--Разрешение работы с i2c0; 
    #define  RT_HW_PERMIT_I2C1							//--Разрешение работы с i2c1;
//-------------------------------------------------------------------------------------------------
	#define RT_HW_CREATE_I2C1							//--Разрешение создания объекта i2c1;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C0_SCL   		PB6
    #define  RT_HW_I2C0_SDA   		PB7
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C1_SCL  		PB10
    #define  RT_HW_I2C1_SDA  		PB3
//=================================================================================================
//										10.3. SPI
//=================================================================================================
    #define  RT_HW_PERMIT_SPI0							//--Разрешение работы с SPI0; 
    #define  RT_HW_PERMIT_SPI1							//--Разрешение работы с SPI1; 
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_CREATE_SPI1							//--Разрешение создания объекта SPI1
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI0_SCK   		PA5
    #define  RT_HW_SPI0_MISO  		PA6
    #define  RT_HW_SPI0_MOSI  		PA7
    #define  RT_HW_SPI0_SS   		PA4	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI1_SCK   		PB13
    #define  RT_HW_SPI1_MISO  		PB14
    #define  RT_HW_SPI1_MOSI  		PB15
    #define  RT_HW_SPI1_SS   		PB12
//=================================================================================================
//									10.4. CAN
//================================================================================================

//=================================================================================================
//									10.5. Коммуникации ETHERNET,CAN
//=================================================================================================
  //#define RT_HW_PERMIT_ETH							//--Разрешение работы с ETH;

//==================================================================================================
//									20. Доступные пины
//==================================================================================================  
    #define RT_HW_PERMIT_PIN_ALL 	(uint8_t)32	 		//--Доступные
    #define RT_HW_PERMIT_PIN_DOT 	(uint8_t)32			//--Дискретный выход;	
    #define RT_HW_PERMIT_PIN_PWM	(uint8_t)25			//--PWM;  	
    #define RT_HW_PERMIT_PIN_DIN	(uint8_t)29			//--Дискретный
    #define RT_HW_PERMIT_PIN_ADC	(uint8_t)17			//--ADC;	
    #define RT_HW_PERMIT_PIN_INT	(uint8_t)28			//--Прерывания;
//--------------------------------Доступные пины контроллера---------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_ALL_ID[] ={PA0,PA1,PA2,PA3,PA4,PA5,PA6,PA7,PA8,PA9,PA10,PA11,PA12,PA13,PA14,PA15,
										           PB0,PB1,PB2,PB3,PB4,PB5,PB6,PB7,PB8,PB9,PB10, 255,PB12,PB13,PB14,PB15,
										                                                                  PC13,PC14,PC15, RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DOT_ID[] ={PA0,PA1,PA2,PA3,PA4,PA5,PA6,PA7,PA8,PA9,PA10,PA11,PA12, 255, 255,PA15,
												   PB0,PB1,PB2,PB3,PB4,PB5,PB6,PB7,PB8,PB9,PB10, 255,PB12,PB13,PB14,PB15,
										                                                                  PC13,PC14,PC15, RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_PWM_ID[] ={PA0,PA1,PA2,PA3,255,PA5,PA6,PA7,PA8,PA9,PA10,PA11, 255, 255, 255,PA15,
										           PB0,PB1,255,PB3,PB4,PB5,PB6,PB7,PB8,PB9,PB10, 255, 255,PB13,PB14,PB15, RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DIN_ID[] ={PA0,PA1,PA2,PA3,PA4,PA5,PA6,PA7,PA8,PA9,PA10,PA11,PA12, 255, 255,PA15,
												   PB0,PB1,PB2,PB3,PB4,PB5,PB6,PB7,PB8,PB9,PB10, 255,PB12,PB13,PB14,PB15, RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_ADC_ID[] ={PA0,PA1,PA2,PA3,PA4,PA5,PA6,PA7,PA8,PB0,PB1,		  					 RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PIN_INT_ID[] ={PA0,PA1,PA2,PA3,PA4,PA5,PA6,PA7,PA8,PA9,PA10,PA11,PA12,PA13, 255, 255,
										           PB0,PB1,255,PB3,PB4,PB5,PB6,PB7,PB8,PB9,PB10, 255,PB12,PB13,PB14,PB15, RT_HW_PGM_END};	
//-------------------------------------------------------------------------------------------------
#endif
//=================================================================================================