//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//											Контроллеры STM3F103Cx
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================						
//								Контроллеры STM32F103C BluePill, BlackPill
//=================================================================================================
#if !defined(RT_HW_BOARD_CODE) && defined(RT_HW_CORE_STM32) && \
    (defined(ARDUINO_BLUEPILL_F103C6)  || defined(ARDUINO_BLUEPILL_F103C8) || defined(ARDUINO_BLUEPILL_F103CB) ||\
     defined(ARDUINO_BLACKPILL_F103C8) || defined(ARDUINO_BLACKPILL_F103CB))
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_BOARD_CODE     (uint8_t)70 					//--Идентификатор выбора платы;	 
//------------------------------------------------------------------------------------------------- 
    #define  RT_HW_BOARD_FCPU     72 							//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      3300							//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
//										0.1. BLUEPILL F103C6
//-------------------------------------------------------------------------------------------------
	#if  defined(ARDUINO_BLUEPILL_F103C6)                              
		#define  RT_HW_BOARD_NAME     "BluePill F103C6"			//--Наименование платы;		
		#define	 RT_HW_BOARD_MEMORY	  "FLASH=32Kb,RAM=20Kb"		//--Параметры памяти;
		#define  RT_HW_BOARD_BLUEPILL_F103C6 					//--Идентификатор MCU;	
	#endif
//-------------------------------------------------------------------------------------------------
//										0.2. BLUEPILL F103C8
//-------------------------------------------------------------------------------------------------
	#if  defined(ARDUINO_BLUEPILL_F103C8)                              
		#define  RT_HW_BOARD_NAME     "BluePill F103C8"			//--Наименование платы;		
		#define	 RT_HW_BOARD_MEMORY	  "FLASH=64Kb,RAM=20Kb"		//--Параметры памяти;
		#define  RT_HW_BOARD_BLUEPILL_F103C8 					//--Идентификатор MCU;	
	#endif
//-------------------------------------------------------------------------------------------------
//										0.3. BLUEPILL F103CB
//-------------------------------------------------------------------------------------------------
	#if  defined(ARDUINO_BLUEPILL_F103CB)                              
		#define  RT_HW_BOARD_NAME     "BluePill F103CB"			//--Наименование платы;		
		#define	 RT_HW_BOARD_MEMORY	  "FLASH=128Kb,RAM=20Kb"	//--Параметры памяти;
		#define  RT_HW_BOARD_BLUEPILL_F103CB 					//--Идентификатор MCU;	
	#endif
//-------------------------------------------------------------------------------------------------
//										0.4. BLUEPILL F103C8
//-------------------------------------------------------------------------------------------------
	#if  defined(ARDUINO_BLACKPILL_F103C8)                              
		#define  RT_HW_BOARD_NAME     "BlackPill F103C8"		//--Наименование платы;		
		#define	 RT_HW_BOARD_MEMORY	  "FLASH=64Kb,RAM=20Kb"		//--Параметры памяти;
		#define  RT_HW_BOARD_BLACKPILL_F103C6 					//--Идентификатор MCU;	
	#endif
//-------------------------------------------------------------------------------------------------
//										0.5. BLACKPILL F103CB
//-------------------------------------------------------------------------------------------------
	#if  defined(ARDUINO_BLACKPILL_F103CB)                              
		#define  RT_HW_BOARD_NAME     "BlackPill F103CB"		//--Наименование платы;		
		#define	 RT_HW_BOARD_MEMORY	  "FLASH=128Kb,RAM=20Kb"	//--Параметры памяти;
		#define  RT_HW_BOARD_BLACKPILL_F103CB 					//--Идентификатор MCU;	
	#endif
//-------------------------------------------------------------------------------------------------
		#define  RT_HW_CORE_STM32F1								//--Идентификатор программной среды;
		#define  RT_HW_CORE_STM32F1C							//--Идентификатор программной среды;
//==================================================================================================
//										1. Ограничение ресурсов контроллеа
//==================================================================================================

//=================================================================================================
//										2. Системные пины
//=================================================================================================
	#define  RT_HW_BOARD_PIN_CONTROL   		PB5			//--Контроль цикла loop();
	#define  RT_HW_BOARD_PIN_LED       		PC13		//--Led на плате;
	#define  RT_HW_BOARD_PIN_BUTTON    		PA0			//--Button на плате;
	#define  RT_HW_BOARD_PIN_ADC       		PA1			//--ADC;
	#define  RT_HW_BOARD_PIN_PWM       		PB1			//--PWM;
//=================================================================================================
//										3. Пины cs тестовые
//=================================================================================================
	#define  RT_HW_BOARD_PIN_CS0       		PB12		//--SPI cs.0;
	#define  RT_HW_BOARD_PIN_CS1       		PB13		//--SPI cs.1;
	#define  RT_HW_BOARD_PIN_CS2       		PB14		//--SPI cs.2;	
	#define  RT_HW_BOARD_PIN_CS3       		PB15		//--SPI cs.3;
//=================================================================================================
//										4. Пины тестовых устройств
//=================================================================================================
	#define  RT_HW_BOARD_PIN_DS1820    		PB8			//--Сенсор DS1820;
	#define  RT_HW_BOARD_PIN_SR04      		PB9			//--Сенсор HC-SR04;
	#define  RT_HW_BOARD_PIN_TEST      		PA8			//--Пин тестовый;		
//=================================================================================================
//										5. Номера тестовых UART
//=================================================================================================		
	#define  RT_HW_BOARD_UART_CONSOLE   	210			//--Консоль через USB;
	#define  RT_HW_BOARD_UART_MODBUS1   	1			//--Номер UART для MODBUS 1;
	#define  RT_HW_BOARD_UART_MODBUS2   	2			//--Номер UART для MODBUS 2;
	#define  RT_HW_BOARD_UART_HMI1			3			//--Номер UART для панели HMI;	
//=================================================================================================
//										10. Коммуникации
//=================================================================================================
//=================================================================================================
//										10.1. UART
//=================================================================================================
    #define  RT_HW_PERMIT_UART0							//--Разрешение работы с UART0;
    #define  RT_HW_PERMIT_UART1							//--Разрешение работы с UART1;
    #define  RT_HW_PERMIT_UART2							//--Разрешение работы с UART2;
    #define  RT_HW_PERMIT_UART3							//--Разрешение работы с UART3;	
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_CREATE_UART2							//--Разрешение создания объекта UART2;
	#define  RT_HW_CREATE_UART3							//--Разрешение создания объекта UART3;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART0_RX   		PA12
    #define  RT_HW_UART0_TX   		PA11	
    #define  RT_HW_UART1_RX   		PA10
    #define  RT_HW_UART1_TX   		PA9	
    #define  RT_HW_UART2_RX   		PA3
    #define  RT_HW_UART2_TX   		PA2
    #define  RT_HW_UART3_RX  		PB11
    #define  RT_HW_UART3_TX   		PB10	
//=================================================================================================
//										10.2. i2c
//=================================================================================================
    #define  RT_HW_PERMIT_I2C0							//--Разрешение работы с i2c0; 
    #define  RT_HW_PERMIT_I2C1							//--Разрешение работы с i2c1;
//  #define  RT_HW_PERMIT_I2C100						//--Разрешение работы с i2c100;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_CREATE_I2C1							//--Разрешение создания объекта i2c1;
    #define  RT_HW_CREATE_I2C100						//--Разрешение создания объекта i2c100;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C0_SDA   		PB7
    #define  RT_HW_I2C0_SCL   		PB6	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C1_SDA  		PB11
    #define  RT_HW_I2C1_SCL  		PB10
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C100_SDA   	PA13
    #define  RT_HW_I2C100_SCL   	PA15	
//-------------------------------------------------------------------------------------------------
//=================================================================================================
//										10.3. SPI
//=================================================================================================
    #define  RT_HW_PERMIT_SPI0							//--Разрешение работы с SPI0; 
    #define  RT_HW_PERMIT_SPI1							//--Разрешение работы с SPI1; 
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_CREATE_SPI1							//--Разрешение создания объекта SPI1
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI0_SCK   		PA5
    #define  RT_HW_SPI0_MISO  		PA6
    #define  RT_HW_SPI0_MOSI  		PA7
    #define  RT_HW_SPI0_SS   		PA4	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI1_SCK   		PB13
    #define  RT_HW_SPI1_MISO  		PB14
    #define  RT_HW_SPI1_MOSI  		PB15
    #define  RT_HW_SPI1_SS   		PB12
//=================================================================================================
//									10.4. CAN
//================================================================================================
//	#define  RT_HW_PERMIT_CAN					//--Разрешение работы с CAN;
//-------------------------------------------------------------------------------------------------
//  #define  RT_HW_CAN_RX			PD0
//  #define  RT_HW_CAN_TX			PD1
//=================================================================================================
//									10.5. Коммуникации ETHERNET,CAN
//=================================================================================================
  //#define RT_HW_PERMIT_ETH							//--Разрешение работы с ETH;
	
//==================================================================================================
//									20. Доступные пины
//==================================================================================================  
    #define RT_HW_PERMIT_PIN_ALL 	(uint8_t)35	 	//--Доступные пины
    #define RT_HW_PERMIT_PIN_DOT 	(uint8_t)32		//--Дискретный выход;	
    #define RT_HW_PERMIT_PIN_PWM	(uint8_t)15		//--PWM;  
	#define RT_HW_PERMIT_PIN_DAC	(uint8_t)2		//--DAC;	
    #define RT_HW_PERMIT_PIN_DIN	(uint8_t)33		//--Дискретный
    #define RT_HW_PERMIT_PIN_ADC	(uint8_t)11		//--ADC;	
    #define RT_HW_PERMIT_PIN_INT	(uint8_t)30		//--Прерывания;
	#define RT_HW_PERMIT_PIN_SRV	(uint8_t)2		//--Серво;
//--------------------------------Доступные пины контроллера---------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_ALL_ID[]={PA0, PA1,PA2,PA3,PA4,PA5,PA6,PA7,PA8,PA9,PA10,PA11,PA12,PA13,PA14,PA15,
												  PB0, PB1,PB2,PB3,PB4,PB5,PB6,PB7,PB8,PB9,PB10,PB11,PB12,PB13,PB14,PB15,
										          PC13,PC14,PC15, 															RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DOT_ID[]={PA0, PA1,PA2,PA3,PA4,PA5,PA6,PA7,PA8,PA9,PA10,PA11,PA12, 255, 255,PA15,
										          PB0, PB1,PB2,PB3,PB4,PB5,PB6,PB7,PB8,PB9,PB10,PB11,PB12,PB13,PB14,PB15,
										          PC13,PC14,PC15,															RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_PWM_ID[]={PA0, PA1,PA2,PA3,PA6,PA7,PA8,PA9,PA10,PB0,PB1,PB6,PB7,PB8,PB9,			RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DAC_ID[]={PA4, PA5,																	RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DIN_ID[]={PA0, PA1,PA2,PA3,PA4,PA5,PA6,PA7,PA8,PA9,PA10,PA11,PA12, 255, 255,PA15,
										          PB0, PB1,PB2,PB3,PB4,PB5,PB6,PB7,PB8,PB9,PB10,PB11,PB12,PB13,PB14,PB15, 	RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_ADC_ID[]={PA0, PA1,PA2,PA3,PA4,PA5,PA6,PA7,PA8,PB0,PB1,		  					 	RT_HW_PGM_END};								
	const uint8_t PROGMEM RT_HW_PGM_PIN_INT_ID[]={PA0, PA1,PA2,PA3,PA4,PA5,PA6,PA7,PA8,PA9,PA10,PA11,PA12, 255, 255,PA15,
										          PB0, PB1,PB2,PB3,PB4,PB5,PB6,PB7,PB8,PB9,PB10,PB11,PB12,PB13,PB14,PB15,	RT_HW_PGM_END};	
//-------------------------------------------------------------------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_N5V_ID[]={PA0,PA1,PA2,PA3,PA4,PA5,PA6,PA7,PB0,PB1,PB5,PC13,PC14,PC15,				RT_HW_PGM_END};	
	const uint8_t PROGMEM RT_HW_PGM_PIN_SRV_ID[]={PB14,PB15,  																RT_HW_PGM_END};
//=================================================================================================							   
#endif
//=================================================================================================


