#include "RT_HW_BASE.h"	 
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										3. ФУНКЦИИ ОБМЕНА С UART
//									FUNC_UART_0020_CPP_COMMON_MCU_1.hpp
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


//=================================================================================================
// 											1.x. Set pin RX УСТАРЕВШАЯ ФУНКЦИЯ !!!
//=================================================================================================
  void     RT_HW_BASE:: uartSetPinRX(uint8_t rx, uint8_t num){
  (void)rx; (void)num;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)	
		     if(num==0) {LinkUART0.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_PERMIT_UART1)	
		     if(num==1) {LinkUART1.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_PERMIT_UART2)	
		     if(num==2) {LinkUART2.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_PERMIT_UART3)	
		     if(num==3) {LinkUART3.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_PERMIT_UART4)	
		     if(num==4) {LinkUART4.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_PERMIT_UART5)	
		     if(num==5) {LinkUART5.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART6)	
		     if(num==6) {LinkUART6.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART7)	
		     if(num==7) {LinkUART7.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART8)	
		     if(num==8) {LinkUART8.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART9)	
		     if(num==9) {LinkUART9.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART10)	
		     if(num==10) {LinkUART10.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART11)	
		     if(num==11) {LinkUART11.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)	
		     if(num==100) {LinkUART100.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)	
		     if(num==101) {LinkUART101.rx=rx;}
	#endif
//-------------------------------------------------------------------------------------------------
  };
//=================================================================================================
// 											1.x. Set pin TX УСТАРЕВШАЯ ФУНКЦИЯ !!!
//=================================================================================================
  void     RT_HW_BASE:: uartSetPinTX(uint8_t tx, uint8_t num){
  (void)tx; (void)num;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)	
		     if(num==0) {LinkUART0.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_PERMIT_UART1)	
		     if(num==1) {LinkUART1.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_PERMIT_UART2)	
		     if(num==2) {LinkUART2.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_PERMIT_UART3)	
		     if(num==3) {LinkUART3.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_PERMIT_UART4)	
		     if(num==4) {LinkUART4.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_PERMIT_UART5)	
		     if(num==5) {LinkUART5.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART6)	
		     if(num==6) {LinkUART6.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART7)	
		     if(num==7) {LinkUART7.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART8)	
		     if(num==8) {LinkUART8.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART9)	
		     if(num==9) {LinkUART9.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART10)	
		     if(num==10) {LinkUART10.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------		
	#if defined(RT_HW_PERMIT_UART11)	
		     if(num==11) {LinkUART11.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)	
		     if(num==100) {LinkUART100.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)	
		     if(num==101) {LinkUART101.tx=tx;}
	#endif
//-------------------------------------------------------------------------------------------------
  };

//=================================================================================================
// 										3.1. Получение пина RX из объекта Linkn 
//=================================================================================================
  uint8_t	RT_HW_BASE:: 	uartGetPinRX(uint8_t num){
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART0)	
		if(num==0)  {return 	LinkUART0.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART1)	
		if(num==1)  {return 	LinkUART1.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART2)	
		if(num==2)  {return 	LinkUART2.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART3)	
		if(num==3)  {return 	LinkUART3.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART4)	
		if(num==4)  {return 	LinkUART4.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART5)	
		if(num==5)  {return 	LinkUART5.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART6)	
		if(num==6)  {return 	LinkUART6.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART7)	
		if(num==7)  {return 	LinkUART7.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART8)	
		if(num==8)  {return 	LinkUART8.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART9)	
		if(num==9)  {return 	LinkUART9.rx;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART10)	
		if(num==10) {return 	LinkUART10.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART11)	
		if(num==11) {return 	LinkUART11.rx;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART100)	
		if(num==100){return 	LinkUART100.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART101)	
		if(num==101){return 	LinkUART101.rx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART200)	
		if(num==200){return 	0;}
	#endif	
//-------------------------------------------------------------------------------------------------
		return 255;
  };
//=================================================================================================
// 										3.2. Получение пина TX из объекта Linkn
//=================================================================================================
  uint8_t	RT_HW_BASE:: 	uartGetPinTX(uint8_t num){
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART0)	
		if(num==0)  {return 	LinkUART0.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART1)	
		if(num==1)  {return 	LinkUART1.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART2)	
		if(num==2)  {return 	LinkUART2.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART3)	
		if(num==3)  {return 	LinkUART3.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART4)	
		if(num==4)  {return 	LinkUART4.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART5)	
		if(num==5)  {return 	LinkUART5.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART6)	
		if(num==6)  {return 	LinkUART6.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART7)	
		if(num==7)  {return 	LinkUART7.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART8)	
		if(num==8)  {return 	LinkUART8.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART9)	
		if(num==9)  {return 	LinkUART9.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART10)	
		if(num==10) {return 	LinkUART10.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART11)	
		if(num==11) {return 	LinkUART11.tx;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART100)	
		if(num==100){return 	LinkUART100.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART101)	
		if(num==101){return 	LinkUART101.tx;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if        defined(RT_HW_PERMIT_UART200)	
		if(num==200){return 	0;}
	#endif	
//-------------------------------------------------------------------------------------------------
		return 255;
};
//=================================================================================================
// 		    							3.3. Инициализация параметров (и пинов) по умолчанию для UART num
//=================================================================================================
  void		RT_HW_BASE:: 	uartInitParam (uint8_t num){
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)							
		if(num==0)      {LinkUART0.rx=RT_HW_UART0_RX;		LinkUART0.tx=RT_HW_UART0_TX;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)							
		if(num==1)      {LinkUART1.rx=RT_HW_UART1_RX;		LinkUART1.tx=RT_HW_UART1_TX;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART2)							
		if(num==2)      {LinkUART2.rx=RT_HW_UART2_RX;		LinkUART2.tx=RT_HW_UART2_TX;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART3)							
		if(num==3)      {LinkUART3.rx=RT_HW_UART3_RX;		LinkUART3.tx=RT_HW_UART3_TX;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART4)							
		if(num==4)      {LinkUART4.rx=RT_HW_UART4_RX;		LinkUART4.tx=RT_HW_UART4_TX;		return;}
	#endif   
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART5)							
		if(num==5)      {LinkUART5.rx=RT_HW_UART5_RX;		LinkUART5.tx=RT_HW_UART5_TX;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART6)							
		if(num==6)  	{LinkUART6.rx=RT_HW_UART6_RX;		LinkUART6.tx=RT_HW_UART6_TX;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART7)							
		if(num==7)      {LinkUART7.rx=RT_HW_UART7_RX;		LinkUART7.tx=RT_HW_UART7_TX;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART8)							
		if(num==8)      {LinkUART8.rx=RT_HW_UART8_RX;		LinkUART8.tx=RT_HW_UART8_TX;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART9)							
		if(num==9)      {LinkUART9.rx=RT_HW_UART9_RX;		LinkUART9.tx=RT_HW_UART9_TX;		return;}
	#endif   
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)							
		if(num==10)     {LinkUART10.rx=RT_HW_UART10_RX;		LinkUART10.tx=RT_HW_UART10_TX;		return;}
	#endif 
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART11)							
		if(num==11)     {LinkUART11.rx=RT_HW_UART11_RX;		LinkUART11.tx=RT_HW_UART11_TX;		return;}
	#endif 
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART100)							
		if(num==100)    {LinkUART100.rx=RT_HW_UART100_RX;	LinkUART100.tx=RT_HW_UART100_TX;	return;}
	#endif 
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)							
		if(num==101)    {LinkUART101.rx=RT_HW_UART101_RX;	LinkUART101.tx=RT_HW_UART101_TX;	return;}
	#endif 	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)							
		if(num==200){																			return;}
	#endif 	
//-------------------------------------------------------------------------------------------------
  };
//=================================================================================================
// 		    							3.4. Инициализация параметров (и пинов) по умолчанию для всех UART
//=================================================================================================
  void 		RT_HW_BASE::	uartInitParamAll(){
		for(uint8_t i=0; i<=12; i++){uartInitParam(i); }	//--Установка и настройка пинов RX,TX по умолчанию;
									 uartInitParam((uint8_t)100);
									 uartInitParam((uint8_t)101);
									 uartInitParam((uint8_t)200);
  };
//=================================================================================================
// 										3.5. Проверка наличия на плате UARTn c заданным номером 
//=================================================================================================
  uint8_t	RT_HW_BASE::	uartCheckNum  (uint8_t num){
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)
		if(num==0)  {return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)
		if(num==1)  {return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART2)
		if(num==2)  {return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART3)
		if(num==3)  {return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART4)
		if(num==4)  {return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART5)
		if(num==5)  {return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART6)
		if(num==6)  {return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART7)
		if(num==7)  {return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART8)
		if(num==8)  {return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART9)
		if(num==9)  {return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)
		if(num==10) {return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART11)
		if(num==11) {return 1;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART100)
		if(num==100){return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)
		if(num==101){return 1;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)
		if(num==200){return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	return 0;
  }; 
//=================================================================================================
// 										3.6. Проверка флага настройки UARTn (функцией Serialx.begin)
//=================================================================================================
  uint8_t	RT_HW_BASE::	uartCheckBegin(uint8_t num){
	if(num==100){return bitRead(uart.begin,13);}
	if(num==101){return bitRead(uart.begin,14);}
	if(num==200){return bitRead(uart.begin,15);}										
	if(num > 15){return 0;}
				 return bitRead(uart.begin,num);
  };
//=================================================================================================
// 										3.7. Установка флага настройки UARTn					
//=================================================================================================
  void		RT_HW_BASE::	uartSetBegin(uint8_t num){
	if(num==100){bitSet(uart.begin,13); 	return;}
	if(num==101){bitSet(uart.begin,14); 	return;}
	if(num==200){bitSet(uart.begin,15); 	return;}										
	if(num > 15){							return;}
			     bitSet(uart.begin,num);
  };
//=================================================================================================
// 										3.8. Чтение регистра настройки UARTn
//=================================================================================================
  uint16_t	RT_HW_BASE::	uartGetBegin(){
				 return uart.begin;
 };
//=================================================================================================
// 										3.9. Проверка готовности UARTn (функцией !uartSerial(num))
//=================================================================================================
  uint8_t	RT_HW_BASE::	uartCheckReady(uint8_t num){
	if(num==100){return bitRead(uart.ready,13);}
	if(num==101){return bitRead(uart.ready,14);}
	if(num==200){return bitRead(uart.ready,15);}										
	if(num >15) {return 0;}
				 return bitRead(uart.ready,num);
  }; 
//=================================================================================================
// 										3.10. Установка флага готовности UARTn				
//=================================================================================================
  void		RT_HW_BASE::	uartSetReady(uint8_t num){
	if(num==100){bitSet(uart.ready,13);		return;}
	if(num==101){bitSet(uart.ready,14);		return;}
	if(num==200){bitSet(uart.ready,15);		return;}										
	if(num > 15){							return;}
				 bitSet(uart.ready,num);
  };
//=================================================================================================
// 										3.11. Чтение регистра готовности UARTn
//=================================================================================================
  uint16_t 	RT_HW_BASE::	uartGetReady(){return uart.ready;};
//=================================================================================================
// 										3.12. Проверка флага   занятости UARTn 
//=================================================================================================
  uint8_t	RT_HW_BASE::	uartCheckBusy (uint8_t num){
	if(num==100){return bitRead(uart.busy,13);}
	if(num==101){return bitRead(uart.busy,14);}
	if(num==200){return bitRead(uart.busy,15);}										
	if(num > 15){return 1;} 
			     return bitRead(uart.busy,num);
  };	
//=================================================================================================
// 										3.13. Установка флага  занятости UARTn					
//=================================================================================================
  void		RT_HW_BASE::	uartSetBusy (uint8_t num){
	if(num==100){bitSet(uart.busy,13);		return;}
	if(num==101){bitSet(uart.busy,14); 		return;}
	if(num==200){bitSet(uart.busy,15); 		return;}										
	if(num > 15){							return;}
				bitSet(uart.busy,num);
  };	
//=================================================================================================
// 										3.14. Очистка   флага  занятости UARTn					
//=================================================================================================
  void     RT_HW_BASE:: 	uartClearBusy(uint8_t num){
	if(num==100){bitClear(uart.busy,13); 	return;}
	if(num==101){bitClear(uart.busy,14); 	return;}
	if(num==200){bitClear(uart.busy,15); 	return;}										
	if(num > 15){							return;}
	         bitClear(uart.busy,num);
  };
//=================================================================================================
// 										3.15. Чтение регистра занятости UARTn 
//=================================================================================================
  uint16_t	RT_HW_BASE:: 	uartGetBusy() {return  uart.busy;};
//=================================================================================================
// 										3.16. Установка статуса UARTn (status: no init=0; Master=1; Slave=2;)
//=================================================================================================
  void		RT_HW_BASE::	uartSetStatus (uint8_t status,	uint8_t num){
	(void)status; (void)num;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)	
		if(num==0)      {LinkUART0.status=status; 		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)	
		if(num==1)      {LinkUART1.status=status; 		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART2)	
		if(num==2)      {LinkUART2.status=status; 		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART3)	
		if(num==3)      {LinkUART3.status=status; 		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART4)	
		if(num==4)      {LinkUART4.status=status; 		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART5)	
		if(num==5)      {LinkUART5.status=status; 		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART6)	
		if(num==6)      {LinkUART6.status=status; 		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART7)	
		if(num==7)      {LinkUART7.status=status; 		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART8)	
		if(num==8)      {LinkUART8.status=status; 		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART9)	
		if(num==9)      {LinkUART9.status=status; 		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)	
		if(num==10)     {LinkUART10.status=status; 		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART11)	
		if(num==11)     {LinkUART11.status=status;		return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART100)	
		if(num==100)     {LinkUART100.status=status; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)	
		if(num==100)    {LinkUART101.status=status;		return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)	
		if(num==200)    {LinkUART200.status=status; 	return;}
	#endif
  };
//=================================================================================================
// 										3.17. Получение статуса UARTn
//=================================================================================================
  uint8_t 	RT_HW_BASE:: 	uartGetStatus (               	uint8_t num){
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART0)	
		if(num==0)  {return LinkUART0.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART1)	
		if(num==1)  {return LinkUART1.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART2)	
		if(num==2)  {return LinkUART2.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART3)	
		if(num==3)  {return LinkUART3.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART4)	
		if(num==4)  {return LinkUART4.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART5)	
		if(num==5)  {return LinkUART5.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART6)	
		if(num==6)  {return LinkUART6.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART7)	
		if(num==7)  {return LinkUART7.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART8)	
		if(num==8)  {return LinkUART8.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART9)	
		if(num==9)  {return LinkUART9.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART10)	
		if(num==10) {return LinkUART10.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART11)	
		if(num==11) {return LinkUART11.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART100)	
		if(num==100){return LinkUART100.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART101)	
		if(num==101){return LinkUART101.status;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART200)	
		if(num==200){return LinkUART200.status;}
	#endif
//-------------------------------------------------------------------------------------------------
	return 0;
  };
//=================================================================================================
// 										3.18. Установка кода ошибки UARTn
//=================================================================================================
  void    	RT_HW_BASE:: 	uartSetCodeErr(uint8_t codeErr,	uint8_t num){
   (void)codeErr; (void)num;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)	
		if(num==0)      {LinkUART0.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)	
		if(num==1)		{LinkUART1.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART2)	
		if(num==2)      {LinkUART2.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART3)	  
		if(num==3)      {LinkUART3.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART4)	
		if(num==4)      {LinkUART4.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART5)	
		if(num==5)      {LinkUART5.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART6)	
		if(num==6)      {LinkUART6.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART7)	
		if(num==7) 		{LinkUART7.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART8)	
		if(num==8)      {LinkUART8.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART9)	
		if(num==9)      {LinkUART9.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)	
		if(num==10)     {LinkUART10.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART11)	
		if(num==11)     {LinkUART11.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART100)	
		if(num==100)    {LinkUART100.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)	
		if(num==101)    {LinkUART101.codeErr=codeErr; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)	
		if(num==200)    {LinkUART200.codeErr=codeErr; 	return;}
	#endif	
  };
//=================================================================================================
// 										3.19. Чтение кода ошибки UARTn
//=================================================================================================
  uint8_t 	RT_HW_BASE:: 	uartGetCodeErr(                	uint8_t num){
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART0)	
		if(num==0) {return LinkUART0.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART1)	
		if(num==1)  {return LinkUART1.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART2)	
		if(num==2)  {return LinkUART2.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART3)	
		if(num==3)  {return LinkUART3.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART4)	
		if(num==4)  {return LinkUART4.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART5)	
		if(num==5)  {return LinkUART5.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART6)	
		if(num==6)  {return LinkUART6.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART7)	
		if(num==7)  {return LinkUART7.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART8)	
		if(num==8)  {return LinkUART8.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART9)	
		if(num==9)  {return LinkUART9.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART10)	
		if(num==10) {return LinkUART10.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART11)	
		if(num==11) {return LinkUART11.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART100)	
		if(num==100){return LinkUART100.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART101)	
		if(num==101){return LinkUART101.codeErr;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART200)	
		if(num==200){return 0;}
	#endif
//-------------------------------------------------------------------------------------------------
	return 0;
  };
//=================================================================================================  
// 										3.20. Установка скорости UARTn
//=================================================================================================
  void    	RT_HW_BASE:: 	uartSetSpeed  (uint32_t speed,	uint8_t num){
   (void)speed; (void)num;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)	
		if(num==0)      {LinkUART0.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)	
		if(num==1)      {LinkUART1.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART2)	
		if(num==2)      {LinkUART2.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART3)	  
		if(num==3)      {LinkUART3.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART4)	
		if(num==4)      {LinkUART4.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART5)	
		if(num==5)      {LinkUART5.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART6)	
		if(num==6)      {LinkUART6.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART7)	
		if(num==7)      {LinkUART7.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART8)	
		if(num==8)      {LinkUART8.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART9)	
		if(num==9)      {LinkUART9.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)	
		if(num==10)     {LinkUART10.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART11)	
		if(num==11)     {LinkUART11.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART100)	
		if(num==100)    {LinkUART100.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)	
		if(num==100)    {LinkUART101.speed=speed; 	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)	
		if(num==200)	{							return;}
	#endif
  };
//=================================================================================================
// 										3.21. Чтение скорости UARTn
//=================================================================================================
  uint32_t	RT_HW_BASE:: 	uartGetSpeed  (               	uint8_t num){
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)	
		if(num==0) {return LinkUART0.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)	
		if(num==1) {return LinkUART1.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART2)	
		if(num==2) {return LinkUART2.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART3)	
		if(num==3) {return LinkUART3.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART4)	
		if(num==4) {return LinkUART4.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART5)	
		if(num==5) {return LinkUART5.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART6)	
		if(num==6) {return LinkUART6.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART7)	
		if(num==7) {return LinkUART7.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART8)	
		if(num==8) {return LinkUART8.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART9)	
		if(num==9) {return LinkUART9.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)	
		if(num==10) {return LinkUART10.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART11)	
		if(num==11) {return LinkUART11.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART100)	
		if(num==100) {return LinkUART100.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)	
		if(num==101) {return LinkUART101.speed;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)	
		if(num==200) {return 0;}
	#endif
//-------------------------------------------------------------------------------------------------
	return 0;
  };
//=================================================================================================
// 										3.22. Установка паритета UARTn (0-None, 1- even; 2-odd;)
//=================================================================================================
  void		RT_HW_BASE:: 	uartSetParity (uint8_t v,     	uint8_t num){
	(void)v; (void)num;
//-------------------------------------------------------------------------------------------------
	if((v!=1) && (v!=2)){v=2;}			//--Нормализация кол-ва стоповых битов; 
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)	
		if(num==0)      {LinkUART0.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)	
		if(num==1)      {LinkUART1.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART2)	
		if(num==2)      {LinkUART2.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART3)	
		if(num==3)      {LinkUART3.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART4)	
		if(num==4)      {LinkUART4.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART5)	
		if(num==5)      {LinkUART5.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART6)	
		if(num==6)      {LinkUART6.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART7)	
		if(num==7)      {LinkUART7.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART8)	
		if(num==8)      {LinkUART8.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART9)	
		if(num==9)      {LinkUART9.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)	
		if(num==10)     {LinkUART10.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART11)	
		if(num==11)     {LinkUART11.parity=v;	return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART100)	
		if(num==100)    {LinkUART100.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)	
		if(num==101)    {LinkUART101.parity=v;	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)
		if(num==200)    {						return;}	
	#endif
  };
//=================================================================================================
// 										3.23. Чтение    паритета UARTn
//=================================================================================================
  uint8_t  	RT_HW_BASE:: 	uartGetParity(                	uint8_t num){	
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART0)	
		if(num==0) {return LinkUART0.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART1)	
		if(num==1) {return LinkUART1.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART2)	
		if(num==2) {return LinkUART2.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART3)	
		if(num==3) {return LinkUART3.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART4)	
		if(num==4) {return LinkUART4.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART5)	
		if(num==5) {return LinkUART5.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART6)	
		if(num==6) {return LinkUART6.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART7)	
		if(num==7) {return LinkUART7.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART8)	
		if(num==8) {return LinkUART8.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART9)	
		if(num==9) {return LinkUART9.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART10)	
		if(num==10){return LinkUART10.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART11)	
		if(num==11) {return LinkUART11.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART100)	
		if(num==100){return LinkUART100.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if     defined(RT_HW_PERMIT_UART101)	
		if(num==101) {return LinkUART101.parity;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if     defined(RT_HW_PERMIT_UART200)	
		if(num==200) {return 0;}
	#endif
//-------------------------------------------------------------------------------------------------
	return 8;
  };
//=================================================================================================
// 										3.24. Установка флагов четности UARTn			
//=================================================================================================
  char		RT_HW_BASE:: 	uartGetParityChar(             	uint8_t num){
	if(uartGetParity(num)==0){return 'N';}
	if(uartGetParity(num)==1){return 'E';}	
	if(uartGetParity(num)==2){return 'O';}	
                             return 'X';};	
//=================================================================================================
// 										3.25. Установка параметра config UARTn
//=================================================================================================
  void  	RT_HW_BASE::	uartSetConfig(uint32_t config,	uint8_t num){
	(void)config; (void)num;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)	
		if(num==0)      {LinkUART0.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)	
		if(num==1)      {LinkUART1.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART2)	
		if(num==2)      {LinkUART2.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART3)	
		if(num==3)      {LinkUART3.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART4)	
		if(num==4)      {LinkUART4.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART5)	
		if(num==5)      {LinkUART5.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART6)	
		if(num==6)      {LinkUART6.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART7)	
		if(num==7)      {LinkUART7.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART8)	
		if(num==8)      {LinkUART8.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART9)	
		if(num==9)      {LinkUART9.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)	
		if(num==10)     {LinkUART10.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART11)	
		if(num==11)     {LinkUART11.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART100)	
		if(num==100)    {LinkUART100.config=config;		return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)	
		if(num==101)    {LinkUART101.config=config;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)
		if(num==200)    {								return;}	
	#endif
};
//=================================================================================================
// 										3.26. Чтение параметра config UARTn
//=================================================================================================
  uint32_t	RT_HW_BASE:: 	uartGetConfig(					uint8_t num){	
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART0)	
		if(num==0)  {return LinkUART0.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)	
		if(num==1)  {return LinkUART1.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART2)	
		if(num==2)  {return LinkUART2.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART3)	
		if(num==3)  {return LinkUART3.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART4)	
		if(num==4)  {return LinkUART4.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART5)	
		if(num==5)  {return LinkUART5.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART6)	
		if(num==6)  {return LinkUART6.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART7)	
		if(num==7)  {return LinkUART7.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART8)	
		if(num==8)  {return LinkUART8.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART9)	
		if(num==9)  {return LinkUART9.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART10)	
		if(num==10) {return LinkUART10.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART11)	
		if(num==11) {return LinkUART11.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART100)	
		if(num==100){return LinkUART100.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if     defined(RT_HW_PERMIT_UART101)	
		if(num==101) {return LinkUART101.config;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)	
		if(num==200) {return 0x800001C;}
	#endif
	return 0x800001C;
	};
//=================================================================================================
// 										3.27. Установка кол-ва бит данных UARTn;
//=================================================================================================
  void    	RT_HW_BASE:: 	uartSetDataBit(uint8_t v, 	uint8_t num){
	(void)v; (void)num;
//-------------------------------------------------------------------------------------------------
	if((v!=5) && (v!=6) && (v!=7)  && (v!=6)){v=8;}	//--Нормализация кол-ва разрядов; 
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)	
		if(num==0)      {LinkUART0.dataBit=v;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)	
		if(num==1)      {LinkUART1.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART2)	
		if(num==2)      {LinkUART2.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART3)	
		if(num==3)      {LinkUART3.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART4)	
		if(num==4)      {LinkUART4.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART5)	
		if(num==5)      {LinkUART5.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART6)	
		if(num==6)      {LinkUART6.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART7)	
		if(num==7)      {LinkUART7.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART8)	
		if(num==8)      {LinkUART8.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART9)	
		if(num==9)      {LinkUART9.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)	
		if(num==10)     {LinkUART10.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART11)	
		if(num==11)     {LinkUART11.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART100)	
		if(num==100)    {LinkUART100.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)	
		if(num==101)    {LinkUART101.dataBit=v;		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)	
		if(num==200)	{							return;}
	#endif
  };
//=================================================================================================
// 										3.28.Чтение    кол-ва бит данных UARTn
//=================================================================================================
  uint8_t 	RT_HW_BASE:: 	uartGetDataBit(				uint8_t num){	
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART0)	
		if(num==0) {return LinkUART0.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART1)	
		if(num==1)  {return LinkUART1.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART2)	
		if(num==2)  {return LinkUART2.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART3)	
		if(num==3)  {return LinkUART3.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART4)	
		if(num==4)  {return LinkUART4.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART5)	
		if(num==5)  {return LinkUART5.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART6)	
		if(num==6)  {return LinkUART6.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART7)	
		if(num==7)  {return LinkUART7.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART8)	
		if(num==8)  {return LinkUART8.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART9)	
		if(num==9)  {return LinkUART9.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART10)	
		if(num==10) {return LinkUART10.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART11)	
		if(num==11) {return LinkUART11.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART100)	
		if(num==100){return LinkUART100.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART101)	
		if(num==101){return LinkUART101.dataBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)	
		if(num==200){return 0;}
	#endif
//-------------------------------------------------------------------------------------------------
	return 8;
  };
//=================================================================================================
// 										3.29. Установка   кол-ва стоповых бит UARTn
//=================================================================================================
  void    	RT_HW_BASE:: 	uartSetStopBit(uint8_t v, uint8_t num){
	(void)v; (void)num;
//-------------------------------------------------------------------------------------------------
	if((v!=1) && (v!=2)){v=2;}	//--Нормализация кол-ва стоповых битов; 
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART0)	
		if(num==0) 		{LinkUART0.stopBit=v;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)	
		if(num==1)      {LinkUART1.stopBit=v;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART2)	
		if(num==2)      {LinkUART2.stopBit=v;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART3)	
		if(num==3)      {LinkUART3.stopBit=v;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART4)	
		if(num==4)      {LinkUART4.stopBit=v;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART5)	
		if(num==5)      {LinkUART5.stopBit=v;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART6)	
		if(num==6)      {LinkUART6.stopBit=v;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART7)	
		if(num==7)      {LinkUART7.stopBit=v;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART8)	
		if(num==8)      {LinkUART8.stopBit=v;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART9)	
		if(num==9)      {LinkUART9.stopBit=v;}
	#endif
//---------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART10)	
		if(num==10)     {LinkUART10.stopBit=v;}
	#endif
//---------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART11)	
		if(num==11) 	{LinkUART11.stopBit=v;}
	#endif	
//---------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART100)	
		if(num==100) 	{LinkUART100.stopBit=v;}
	#endif
//---------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101)	
		if(num==100) 	{LinkUART101.stopBit=v;}
	#endif
//---------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)	
	#endif
};
//=================================================================================================
// 										3.30. Чтение кол-ва стоповых бит UARTn
//=================================================================================================
  uint8_t  	RT_HW_BASE:: uartGetStopBit(uint8_t num){	
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART0)	
		if(num==0)  {return LinkUART0.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART1)	
		if(num==1)  {return LinkUART1.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART2)	
		if(num==2)  {return LinkUART2.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART3)	
		if(num==3)  {return LinkUART3.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART4)	
		if(num==4)  {return LinkUART4.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART5)	
		if(num==5)  {return LinkUART5.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART6)	
		if(num==6)  {return LinkUART6.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART7)	
		if(num==7)  {return LinkUART7.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART8)	
		if(num==8)  {return LinkUART8.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART9)	
		if(num==9)  {return LinkUART9.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART10)	
		if(num==10) {return LinkUART10.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART11)	
		if(num==11) {return LinkUART11.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART100)	
		if(num==100){return LinkUART100.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if    defined(RT_HW_PERMIT_UART101)	
		if(num==101){return LinkUART101.stopBit;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if   defined(RT_HW_PERMIT_UART200)	
		if(num==200){return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	return 1;
//-------------------------------------------------------------------------------------------------
};
//=================================================================================================
// 		    								3.31 Запись имени BlueTooth
//=================================================================================================
  void  	RT_HW_BASE:: uartSetNameBTH(String name){
	(void)name;
	#if defined(RT_HW_PERMIT_UART200)		
		LinkUART200.name=name;			
	#endif		
  };
//=================================================================================================
// 		    								3.42. Чтение имени BlueTooth
//=================================================================================================
  String  	RT_HW_BASE:: uartGetNameBTH(){
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART200)		
		return LinkUART200.name;			
//-------------------------------------------------------------------------------------------------
	#else		 
		return String(F("No BlueTooth"));
	#endif
//-------------------------------------------------------------------------------------------------	
  };
//=================================================================================================

