#include "RT_HW_BASE.h"	 
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//											ОБЪЕКТЫ UART ESP32
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
#if !defined(RT_HW_CREATE_UART_CODE) && defined(RT_HW_CORE_ESP32)
	#define  RT_HW_CREATE_UART_CODE 	
//=================================================================================================
	#if defined(RT_HW_PERMIT_UART0)
       #define RT_HW_PRESENT_UART0	
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART1)
       #define RT_HW_PRESENT_UART1
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART2)
       #define RT_HW_PRESENT_UART2
	#endif 
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART3)				//--Для развития;
       #define RT_HW_PRESENT_UART3
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART4)				//--Для развития;
       #define RT_HW_PRESENT_UART4
	#endif    
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART100) && defined(RT_HW_CREATE_UARTS)
	   #define  RT_HW_PRESENT_UART100  
		SoftwareSerial 	    Serial100(RT_HW_UART100_RX, RT_HW_UART100_TX); 	
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PERMIT_UART101) && defined(RT_HW_CREATE_UARTS)
	   #define RT_HW_PRESENT_UART101	  
		SoftwareSerial 	    Serial101(RT_HW_UART101_RX, RT_HW_UART101_TX); 	
	#endif
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_CREATE_UART200_ESP32)
       #define RT_HW_PRESENT_UART200		
		BluetoothSerial    Serial200; 			
	#endif
//-------------------------------------------------------------------------------------------------

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										1. ФУНКЦИИ НАСТРОЙКИ UART
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//						        		1.1. Инициализация UARTn как MASTER
//=================================================================================================	
  uint8_t 	RT_HW_BASE::	uartBegin(uint8_t num){
	(void)num;
//-------------------------------------------------------------------------------------------------
	uartSetCodeErr(0,num);											//--Сброс кода ошибки;
	if(!uartCheckNum(num))	{uartSetCodeErr(65,num);	return 1;}	//--Выход, если недопустимый номер UART;
	if( uartGetStatus(num)==1){						 	return 1;} 	//--Выход, если UARTn уже настроен как Master;
    uartEnd(num);													//--Отключение UART (если вдруг раньше была инициализирована функцией Serialx.begin();
//=================================================================================================
//										1.5.1.1. ESP32S || ESP32S3
//=================================================================================================
  #if defined(RT_HW_CORE_ESP32S) || defined(RT_HW_CORE_ESP32S3)
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)	                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
		if(num==0)    {if(LinkUART0.status==0){
					        Serial.begin(LinkUART0.speed, LinkUART0.config,(int8_t)LinkUART0.rx,(int8_t)LinkUART0.tx, false, 20000UL, 112);
						  LinkUART0.status=1; 	
					  }  
			return 1;
		}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(num==1)    {if(LinkUART1.status==0){
					        Serial1.begin(LinkUART1.speed, LinkUART1.config,(int8_t)LinkUART1.rx,(int8_t)LinkUART1.tx, false, 20000UL, 112);
						  LinkUART1.status=1; 	
					  }   
			return 1;
		}
	#endif	
//-------------------------------------------------------------------------------------------------	
	#if defined(RT_HW_PRESENT_UART2)
		if(num==2)    {if(LinkUART2.status==0){
					        Serial2.begin(LinkUART2.speed, LinkUART2.config,(int8_t)LinkUART2.rx,(int8_t)LinkUART2.tx, false, 20000UL, 112);
						  LinkUART2.status=1; 		
				      }   
			return 1;
		}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if	defined(RT_HW_PRESENT_UART100)
		if(num==100)  {if(LinkUART100.status==0) {Serial100.begin(LinkUART100.speed);	LinkUART100.status=1; 	return 1;}}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if	defined(RT_HW_PRESENT_UART200)
		if(num==200)  {if(LinkUART200.status==0) {Serial200.begin(LinkUART200.name); 	LinkUART200.status=1; 	return 1;}}
	#endif		
//-------------------------------------------------------------------------------------------------
    return 0;
//-------------------------------------------------------------------------------------------------
 #endif		//----  #if defined(RT_HW_CORE_ESP32S)
//=================================================================================================
//										1.5.1.2. ESP32C3
//=================================================================================================
  #if defined(RT_HW_CORE_ESP32C3)
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)	                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
		if(num==0){if(uartGetStatus(num)==0){uartSetStatus(1,num); Serial.begin(uartGetSpeed(num));}  return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)	
		if(num==1){
			if(uartGetStatus(num)==0){
			   uartSetStatus(1,num); 
			   Serial1.begin(uartGetSpeed(num),uartGetConfig(num),(int8_t)uartGetPinRX(num),(int8_t)uartGetPinTX(num), false, 20000UL, 112);
			}  
			return 1;
		}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if	defined(RT_HW_PRESENT_UARTS)
		if(num==100){if(uartGetStatus(num)==0){SerialS.begin(uartGetSpeed(num)); uartSetStatus(1,num);} return 1;}
	#endif		
//-------------------------------------------------------------------------------------------------
    return 0;
//-------------------------------------------------------------------------------------------------
 #endif		//----  #if defined(RT_HW_CORE_ESP32C3)
//=================================================================================================
//										1.5.1.3. ESP32S2
//=================================================================================================
  #if defined(RT_HW_CORE_ESP32S2)
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)	                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
		if(num==0){if(uartGetStatus(n)==0){uartSetStatus(1,n); Serial.begin(uartGetSpeed(n));} return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(num==1){
			if(uartGetStatus(num)==0){
			   uartSetStatus(1,num); 
			   Serial1.begin(uartGetSpeed(num),uartGetConfig(num),(int8_t)uartGetPinRX(num),(int8_t)uartGetPinTX(num), false, 20000UL, 112);
			}  
			return 1;
		}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(num==1){
			if(uartGetStatus(num)==0){
			   uartSetStatus(1,num); 
			   Serial2.begin(uartGetSpeed(num),uartGetConfig(num),(int8_t)uartGetPinRX(num),(int8_t)uartGetPinTX(num), false, 20000UL, 112);
			}  
			return 1;
		}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if	defined(RT_HW_PRESENT_UART100)
		if(num==100){if(uartGetStatus(num)==0){Serial100.begin(uartGetSpeed(num)); uartSetStatus(1,num);} return 1;}
	#endif		
//-------------------------------------------------------------------------------------------------
    return 0;
//-------------------------------------------------------------------------------------------------
 #endif		//----  #if defined(RT_HW_CORE_ESP32C3)
//-------------------------------------------------------------------------------------------------
    return 0;
  };	//====END	uint8_t  RT_HW_BASE:: uartBegin(uint8_t num)
//=================================================================================================
// 										1.2. Отключение UARTn
//=================================================================================================
  void	  	RT_HW_BASE::	uartEnd(uint8_t num){
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)		
		if(num==0)    {if(LinkUART0.status==1)  {Serial.end();		LinkUART0.status=0;		return;}}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(num==1)    {if(LinkUART1.status==1)  {Serial1.end();		LinkUART1.status=0;		return;}}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(num==2)    {if(LinkUART2.status==1)  {Serial2.end();		LinkUART2.status=0;		return;}}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART3)
		if(num==3)    {if(LinkUART3.status==1)  {Serial3.end();		LinkUART3.status=0;		return;}}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART4)
		if(num==4)    {if(LinkUART4.status==1)  {Serial4.end();		LinkUART4.status=0;		return;}}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART100)
		if(num==100)  {if(LinkUART100.status==1){Serial100.end();	LinkUART100.status=0;	return;}}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART200)
		if(num==1)    {if(LinkUART200.status==1){Serial200.end();	LinkUART200.status=0;	return;}}
	#endif	
//==================================================================================================
  };	//===END void RT_HW_BASE:: uartEnd(uint8_t num)			
//=================================================================================================
// 										1.3. Проверка подключения UART
//=================================================================================================
  uint8_t 	RT_HW_BASE:: 	uartSerial(uint8_t num){
	(void)num;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		#if defined(RT_HW_CORE_ESP32C3)
		if(num==0){
				if(uartUSB.dir==4) {return 1;}
				if(uartUSB.dir==0) {uartUSB.timeBegin=millis()+500;	 uartUSB.dir++;  return 0;}
				if(uartUSB.dir==1) {if(millis()<(uartUSB.timeBegin))              	{return 0;} 				    
					if(!Serial)									  						{return 0;}	//--Проверка готовности USB;
					uartUSB.timeBegin=millis();
					uartUSB.dir++;									 return 0;} //--Переход на технологическую паузу;
				if(uartUSB.dir==2) {if((millis()-uartUSB.timeBegin)<20) 	      	{return 0;} //--Пауза 20мс;
                    bitSet(uart.ready,0);            uartUSB.dir=4;  return 0;} //--Установка флага готовности и переход на завершение;
//				    bitSet(uart.ready,0); 			 uartUSB.dir=4;  return 1;}
			}
		#else
		if(num==0)		{if(Serial)  	{bitSet(uart.ready,num); 	return 1;} else {return 0;}}
		#endif
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)	
		if(num==1)      {if(Serial1) 	{bitSet(uart.ready,num); 	return 1;} else {return 0;}}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)	
		if(num==2)      {if(Serial2) 	{bitSet(uart.ready,num); 	return 1;} else {return 0;}}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART3)	
		if(num==3)      {if(Serial3) 	{bitSet(uart.ready,num); 	return 1;} else {return 0;}}
	#endif		
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART4)	
		if(num==4)      {if(Serial4) 	{bitSet(uart.ready,num); 	return 1;} else {return 0;}}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART100)	
		if(num==100)	{if(Serial100)  {bitSet(uart.ready,13); 	return 1;} else {return 0;}}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART200)	
		if(num==200)	{if(Serial200)  {bitSet(uart.ready,15); 	return 1;} else {return 0;}}
	#endif	
//-------------------------------------------------------------------------------------------------
    return 0;
  };	//====END uint8_t	RT_HW_BASE:: 	uartSerial(uint8_t num)
//=================================================================================================
//										1.4. Установка пинов RX,TX в объект Linkn
//=================================================================================================
  void    	RT_HW_BASE:: 	uartSetPins(uint8_t rx, uint8_t tx, uint8_t num){
	(void)rx; (void)tx; (void)num;
//=================================================================================================
//										1.4.1. ESP32S
//=================================================================================================
  #if defined(RT_HW_CORE_ESP32S)
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		if(num==0){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
			if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
			if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART0.rx=rx; LinkUART0.tx=tx;				//--Set pins rx,tx num=0;
			return;
		}										//--Successful Exit num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(num==1){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
			if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
			if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART1.rx=rx; LinkUART1.tx=tx;				//--Set pins rx,tx num=0;
			return;
		}										//--Successful Exit  num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(num==2){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
			if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
			if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART2.rx=rx; LinkUART2.tx=tx;				//--Set pins rx,tx num=0;
		return;
		}										//--Successful Exit  num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	uartSetCodeErr(64,num); return;
 #endif
//=================================================================================================
//										1.4.2. ESP32C3
//=================================================================================================
  #if defined(RT_HW_CORE_ESP32C3)
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		if(num==0){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
		  //if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
		  //if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART0.rx=rx; LinkUART0.tx=tx;				//--Set pins rx,tx num=0;
			return;
		}										//--Successful Exit  num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(num==1){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
		  //if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
		  //if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART1.rx=rx; LinkUART1.tx=tx;				//--Set pins rx,tx num=0;
			return;
		}										//--Successful Exit  num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(num==2){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
		  //if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
		  //if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART2.rx=rx; LinkUART2.tx=tx;				//--Set pins rx,tx num=0;
		return;
		}										//--Successful Exit  num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	uartSetCodeErr(64,num); return;
 #endif
//=================================================================================================
//										1.4.3. ESP32S2
//=================================================================================================
  #if defined(RT_HW_CORE_ESP32S2)
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		if(num==0){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
		  //if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
		  //if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART0.rx=rx; LinkUART0.tx=tx;				//--Set pins rx,tx num=0;
			return;
		}										//--Successful Exit  num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(num==1){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
		  //if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
		  //if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART1.rx=rx; LinkUART1.tx=tx;				//--Set pins rx,tx num=0;
			return;
		}										//--Successful Exit  num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(num==2){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
		  //if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
		  //if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART2.rx=rx; LinkUART2.tx=tx;				//--Set pins rx,tx num=0;
		return;
		}										//--Successful Exit  num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	uartSetCodeErr(64,num); return;
 #endif
//=================================================================================================
//										1.4.4. ESP32S3
//=================================================================================================
  #if defined(RT_HW_CORE_ESP32S3)
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		if(num==0){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
		  //if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
		  //if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART0.rx=rx; LinkUART0.tx=tx;				//--Set pins rx,tx num=0;
			return;
		}										//--Successful Exit  num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(num==1){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
		  //if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
		  //if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART1.rx=rx; LinkUART1.tx=tx;				//--Set pins rx,tx num=0;
			return;
		}										//--Successful Exit  num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(num==2){
			if(rx==tx) {uartSetCodeErr(60,num); return;}	//--Exit by mistake on rx=tx;
	 	  //if(rx>=34) {uartSetCodeErr(61,num); return;}	//--Exit by mistake on rx;
		  //if(tx>=34) {uartSetCodeErr(62,num); return;}	//--Exit by mistake on tx;
			LinkUART2.rx=rx; LinkUART2.tx=tx;				//--Set pins rx,tx num=0;
		return;
		}										//--Successful Exit  num=0;
	#endif
//-------------------------------------------------------------------------------------------------
	uartSetCodeErr(64,num); 
	return;
 #endif
//=================================================================================================
};

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										2. ФУНКЦИИ ОБМЕНА С UART
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
// 										2.1. Проверка входного буфера UARTn
//================================================================================================= 
  uint16_t 	RT_HW_BASE:: 	uartAvailable(uint8_t n){
	(void)n;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		if(n==0)    {return Serial.available();}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(n==1)    {return Serial1.available();}
	#endif		
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(n==2)    {return Serial2.available();}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART3)
		if(n==3)    {return Serial3.available();}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART4)
		if(n==4)    {return Serial4.available();}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART100)
		if(n==100)	{return Serial100.available();}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART200)
		if(n==200)	{return Serial200.available();}
	#endif
//-------------------------------------------------------------------------------------------------	
	return 	0;	
//-------------------------------------------------------------------------------------------------	
  };	
//=================================================================================================
// 										2.2. Проверка выходного буфера UARTn
//================================================================================================= 
  uint16_t 	RT_HW_BASE:: 	uartAvailableForWrite(uint8_t n){												
	(void)n;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		if(n==0)     {return Serial.availableForWrite();}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(n==1)	{return Serial1.availableForWrite();}
	#endif		
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(n==2)	{return Serial2.availableForWrite();}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART3)
		if(n==3)	{return Serial3.availableForWrite();}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART4)
		if(n==4)	{return Serial4.availableForWrite();}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART100)
		if(n==100)	{return Serial100.availableForWrite();}		//--Не везде эта функция реализована
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART200)
		if(n==200)	{return Serial200.availableForWrite();}
	#endif
//-------------------------------------------------------------------------------------------------
	return 	63;
//-------------------------------------------------------------------------------------------------		
	};
//================================================================================================= 
// 										2.3. Чтение байта из UARTn
//================================================================================================= 
  uint8_t 	RT_HW_BASE:: 	uartRead(uint8_t n){
	(void)n;
//---------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		if(n==0)	{return Serial.read();}
	#endif	
//---------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(n==1)	{return Serial1.read();}
	#endif		
//---------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2) 
		if(n==2)	{return Serial2.read();}
	#endif	
//---------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART3)
		if(n==3)	{return Serial3.read();}
	#endif
//---------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART4)
		if(n==4)	{return Serial4.read();}
	#endif		
//---------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART100)
		if(n==100)	{return Serial100.read();}
	#endif
//---------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART200)
		if(n==200)	{return Serial200.read();}
	#endif		
//---------------------------------------------------------------------------------------------
	return 	0;	
//-------------------------------------------------------------------------------------------------	
  };
//=================================================================================================  
// 										2.4. Запись байта в UARTn
//	Примечание: для UART0.RP2040 реализована "заплатка!!!  (см. также радел 8)
//              Следует отслеживать новые версии CORE RP2040 и со временем отказаться от "заплатки". 
//================================================================================================= 
  uint8_t RT_HW_BASE:: uartWrite(uint8_t v, uint8_t n){
	(void)v; (void)n;
//--------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		if(n==0)		   {Serial.write(v);       	return 1;}	//--Для UART0 остальных контроллеров;
	#endif	
//--------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(n==1)		   {Serial1.write(v); 		return 1;}
	#endif		
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(n==2)		   {Serial2.write(v); 		return 1;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART3)
		if(n==3)		   {Serial3.write(v); 		return 1;}
	#endif
//-------------------------------------------------------------------------------------------------  
	#if defined(RT_HW_PRESENT_UART4)
		if(n==4)		   {Serial4.write(v); 		return 1;}
	#endif		
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART100)
		if(n==100)		   {Serial100.write(v); 	return 1;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART200)
		if(n==200)		   {Serial200.write(v); 	return 1;}
	#endif			
//-------------------------------------------------------------------------------------------------
	return 1;
//-------------------------------------------------------------------------------------------------
  };
//================================================================================================= 
// 										2.5.1. Вывод flush 
//================================================================================================= 
  void  RT_HW_BASE:: uartFlush(uint8_t n){uartFlush(0, n);};
//================================================================================================= 
// 										2.5.2. Вывод flush 
//=================================================================================================
  void  RT_HW_BASE:: uartFlush(uint32_t timeout, uint8_t n){
	(void)timeout; (void)n;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		if(n==0)		   {Serial.flush();		return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(n==1)		   {Serial1.flush();	return;}
	#endif		
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(n==2)	       {Serial2.flush();	return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART3)
		if(n==3)	       {Serial3.flush();	return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART4)
		if(n==4)		   {Serial4.flush();	return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART100)
		if(n==100)		   {return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART200)
		if(n==200)		   {return;}
	#endif	
//-------------------------------------------------------------------------------------------------
  };
//================================================================================================= 
// 										2.6. Вывод print(String) 
//  Примечание: это временная "заплатка" для совместимости с CORE RP2040 
//              Следует отслеживать новые версии CORE RP2040 и со временем отказаться от "заплатки". 
//================================================================================================== 
  void	RT_HW_BASE:: uartPrint( String str,uint8_t n){
	(void)str; (void)n;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		if(n==0)		   {Serial.print(str);		return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(n==1)		   {Serial1.print(str);		return;}
	#endif		
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(n==2)		   {Serial2.print(str);		return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART3)
		if(n==3)	       {Serial3.print(str);		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART4)
		if(n==4)	       {Serial4.print(str);		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART100)
		if(n==100)		   {Serial100.print(str);	return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART200)
		if(n==200)		  {Serial200.print(str);	return;}
	#endif		
  };
//================================================================================================== 
// 										2.7. Вывод print(uint8_t) 
//  Примечание: это временная "заплатка" для совместимости с STM32F1 
//==================================================================================================
  void  RT_HW_BASE:: uartPrint(uint8_t v, uint8_t n){
	(void)v; (void)n;
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART0)
		if(n==0)		   {Serial.print(v);		return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART1)
		if(n==1)		   {Serial1.print(v);		return;}
	#endif		
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART2)
		if(n==2)	       {Serial2.print(v);		return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART3)
		if(n==3)		   {Serial3.print(v);		return;}
	#endif	
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART100)
		if(n==100)		   {Serial100.print(v);		return;}
	#endif
//-------------------------------------------------------------------------------------------------
	#if defined(RT_HW_PRESENT_UART200)
		if(n==200)		   {Serial200.print(v);		return;}
	#endif		
  };
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#endif 	//====END #if !defined(RT_HW_CORE_ESP32
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++