//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//                        				API.h for UART
//=================================================================================================
// AVR  	- 1 UART, for MEGA2560 - UART;
// ESP8266  - 1 UART(Serial0) + 1 UART TX(Serial1);
// ESP32S   - 3 UART; 
// SAM3     - 4-UART;
// STM32F103C    - 3 UART;
// STM32F4x1Cx   - 3 UART;
// STM32F40703Vx - 6 UART;
// STM32H743     - 8 UART;
// Raspberry Pi Pico - 2-6 UART.
//-------------------------------------------------------------------------------------------------
// Структуры для работы с UART определены в файле BASE_002_Struct\Struct_220_LinkUART (пока)
//=================================================================================================
//	ecoins@mail.ru 12.05.2023г.
//  ecoins@mail.ru 29.03.2024г.
//  ecoins@mail.ru 09.12.2024г.
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++			
//=================================================================================================
// 											0.1. Флаги UART
//=================================================================================================
	RT_HW_STRUCT_UART_RXTX 		uart;
	RT_HW_STRUCT_UART_USB 		uartUSB;
//=================================================================================================
// 											0.2. Объекты UART
//=================================================================================================
	#if         defined(RT_HW_PERMIT_UART0) 
		RT_HW_STRUCT_UART 		 LinkUART0; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART1) 
		RT_HW_STRUCT_UART 		 LinkUART1; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART2) 
		RT_HW_STRUCT_UART 		 LinkUART2; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART3) 
		RT_HW_STRUCT_UART 		 LinkUART3; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART4) 
		RT_HW_STRUCT_UART 		 LinkUART4; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART5) 
		RT_HW_STRUCT_UART 		 LinkUART5; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART6) 
		RT_HW_STRUCT_UART 		 LinkUART6; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART7) 
		RT_HW_STRUCT_UART 		 LinkUART7; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART8) 
		RT_HW_STRUCT_UART 		 LinkUART8; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART9) 
		RT_HW_STRUCT_UART 		 LinkUART9; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART10) 
		RT_HW_STRUCT_UART 		 LinkUART10; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART11) 
		RT_HW_STRUCT_UART 		 LinkUART11; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART12) 
		RT_HW_STRUCT_UART 		 LinkUART12; 
	#endif
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART100) 
		RT_HW_STRUCT_UART 		 LinkUART100; 	
	#endif	
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART101) 
		RT_HW_STRUCT_UART 		 LinkUART101; 
	#endif	
//-------------------------------------------------------------------------------------------------
	#if         defined(RT_HW_PERMIT_UART200) 
		RT_HW_STRUCT_BLUETOOTH   LinkUART200; 
	#endif		
//=================================================================================================

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										1. ФУНКЦИИ НАСТРОЙКИ UART
//									FUNC_UART_000x_CPP_COMMON_"CORE".hpp
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  uint8_t  	uartBegin    (							uint8_t num);		//--1.1.Инициализация UARTn;		
  void     	uartEnd      (							uint8_t num);		//--1.2.Отключение    UARTn;
  uint8_t  	uartSerial   (							uint8_t num);		//--1.3.Проверка аппаратной готовности UARTn; 
  void		uartSetPins  (uint8_t rx, uint8_t tx, 	uint8_t num);		//--1.4.Установка пинов RX,TX в объект Linkn; 
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										2. ФУНКЦИИ ОБМЕНА С UART
//									FUNC_UART_000x_CPP_COMMON_"CORE".hpp
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  uint16_t 	uartAvailable(		  uint8_t num);		//--2.1.Проверка заполненности входного буфера;	
  uint16_t 	uartAvailableForWrite(uint8_t num);		//--2.2.Проверка заполненности выходного буфера;	
  uint8_t  	uartRead (            uint8_t num);		//--2.3.Чтение байта из входного буфера;
  uint8_t  	uartWrite(uint8_t var,uint8_t num);		//--2.4.Запись байта в  выходной буфер;
  void     	uartFlush(            uint8_t num);		//--
  void     	uartFlush(uint32_t timeout, uint8_t num); //--
  void     	uartPrint(String str,       uint8_t num);	//--Запись строки (заглушка для RP2040);
  void     	uartPrint(uint8_t vr,       uint8_t num);	//--Запись строки (заглушка для STM32F103);
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										3. ФУНКЦИИ ОБМЕНА С UART
//									FUNC_UART_0020_CPP_COMMON_MCU_1.hpp
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  void     uartSetPinRX(uint8_t rx, uint8_t num);		//--УСТАРЕВШАЯ ФУНКЦИЯ !!!
  void     uartSetPinTX(uint8_t tx, uint8_t num);		//--УСТАРЕВШАЯ ФУНКЦИЯ !!!
//-------------------------------------------------------------------------------------------------

  uint8_t 	uartGetPinRX (					uint8_t num);		//--3.1.Получение пина RX из объекта Linkn;
  uint8_t 	uartGetPinTX (					uint8_t num);		//--3.2.Получение пина TX из объекта Linkn;
  void   	uartInitParam(					uint8_t num);		//--3.3.Иниц.параметров (и пинов) по умолчанию для UARTn;
  void 		uartInitParamAll();									//--3.4.Иниц.параметров (и пинов) по умолчанию для всех UART;
//-------------------------------------------------------------------------------------------------
  uint8_t	uartCheckNum  (					uint8_t num);		//--3.5.Проверка наличия на плате   UARTn;
//-------------------------------------------------------------------------------------------------
  uint8_t	uartCheckBegin(					uint8_t num);		//--3.6.Проверка  флага настройки   UARTn (функцией Serialx.begin);
  void     	uartSetBegin  (					uint8_t num);		//--3.7.Установка флага настройки   UARTn;
  uint16_t 	uartGetBegin();										//--3.8.Чтение регистра настройки   UART;
//-------------------------------------------------------------------------------------------------
  uint8_t	uartCheckReady(uint8_t num);						//--3.9.Проверка   флага готовности UARTn (функцией !Serial());
  void  	uartSetReady  (uint8_t num);						//--3.10.Установка флага готовности UARTn;
  uint16_t 	uartGetReady(); 									//--3.11.Чтение регистра готовности UART;
//-------------------------------------------------------------------------------------------------  
  uint8_t   uartCheckBusy (uint8_t num);						//--3.12.Проверка  флага занятости  UARTn; 
  void     	uartSetBusy   (uint8_t num);						//--3.13.Установка флага занятости  UARTn;	
  void     	uartClearBusy (uint8_t num);						//--3.14.Очистка   флага занятости  UARTn;
  uint16_t 	uartGetBusy();										//--3.15.Чтение регистра занятости  UARTn;
//-------------------------------------------------------------------------------------------------
  void     	uartSetStatus (uint8_t status,  uint8_t num);		//--3.16.Установка статуса 			UARTn;
  uint8_t  	uartGetStatus (                 uint8_t num);		//--3.17.Получение статуса 			UARTn;
//-------------------------------------------------------------------------------------------------
  void     	uartSetCodeErr(uint8_t codeErr, uint8_t num);		//--3.18.Установка кода ошибки 		UARTn;
  uint8_t  	uartGetCodeErr(                 uint8_t num);		//--3.19.Чтение    кода ошибки 		UARTn;
//-------------------------------------------------------------------------------------------------
  void     	uartSetSpeed  (uint32_t speed,  uint8_t num);		//--3.20.Установка скорости 		UARTn;
  uint32_t	uartGetSpeed  (                 uint8_t num);		//--3.21.Чтение    скорости 		UARTn;
//-------------------------------------------------------------------------------------------------
  void     	uartSetParity (uint8_t v,       uint8_t num);		//--3.22.Установка паритет  		UARTn;
  uint8_t  	uartGetParity (                 uint8_t num);		//--3.23.Чтение    паритета UARTn (uint8_t);
  char  	uartGetParityChar(              uint8_t num);		//--3.24.Чтение    паритета UARTn (char);  
//-------------------------------------------------------------------------------------------------
  void     	uartSetConfig (uint32_t config, uint8_t num);		//--3.25.Установка паритета 		UARTn;
  uint32_t 	uartGetConfig (                 uint8_t num);		//--3.26.Чтение    паритета 		UARTn;
//-------------------------------------------------------------------------------------------------
  void     	uartSetDataBit(uint8_t v,     	uint8_t num);		//--3.27.Установка кол-ва бит данных UARTn;
  uint8_t  	uartGetDataBit(                 uint8_t num);		//--3.28.Чтение    кол-ва бит данных UARTn;
//-------------------------------------------------------------------------------------------------
  void     	uartSetStopBit(uint8_t v,    	uint8_t num);		//--3.29.Установка кол-во стоповых бит UARTn;
  uint8_t  	uartGetStopBit(                 uint8_t num);		//--3.30.Чтение    кол-ва стоповых бит UARTn;
//-------------------------------------------------------------------------------------------------
  void     	uartSetNameBTH(String name);						//--3.31.Запись имени BlueTooth;
  String   	uartGetNameBTH();									//--3.32.Чтение имени BlueTooth;
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										4. ФУНКЦИИ ОБМЕНА С УСТРОЙСТВАМИ UART
//										FUNC_UART_0030_CPP_COMMON_DEVICE.hpp
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
void 	 uartSetParam  (RT_HW_STRUCT_UART_DEV &id);				//--4.1.1.Инициализация параметров UART(bus=0; speed=RT_HW_SPEED;);
void     uartSetParam  (RT_HW_STRUCT_UART_DEV &id, uint8_t bus, uint32_t speed=0);	//--4.1.2.Инициализация    параметров UART;
void     uartInitDevice(RT_HW_STRUCT_UART_DEV &id);									//--4.2.Инициализация    устройства UART;
uint8_t  uartWrite     (RT_HW_STRUCT_UART_DEV &id, uint8_t var);					//--4.3.Запись байта   в устройство UART;
void     uartWriteArr  (RT_HW_STRUCT_UART_DEV &id, uint8_t *arr, uint8_t qnt);		//--4.4.Запись массива в устройство UART;
//==================================================================================================

