//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										API PIN TOTAL
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//-------------------------------------------------------------------------------------------------
//			1.ДОСТУП К МАССИВАМ ПИНОВ PROGMEM 				[FUNC_PIN_0100_GET_PIN_PGM.hpp]
//-------------------------------------------------------------------------------------------------
	uint8_t 	getPinPGM  (const uint8_t *arr, uint8_t sizeArr, uint8_t idx);	//--Получение пина по индексу в массиве;
	uint8_t 	checkPinPGM(const uint8_t *arr, uint8_t sizeArr, uint8_t var);	//--Проверка  наличия пина    в массиве;
	uint8_t 	getSizePinPGM (const uint8_t *arr);								//--Получение размера массива без учета значений=255;
	uint8_t 	getFullPinPGM (const uint8_t *arr);						  	  	//--Получение полного размера массива;
//-------------------------------------------------------------------------------------------------
//			2.ФУНКЦИЯ ПОЛУЧЕНИЯ ИМЕН ПИНОВ (ESP8266,ESP32 и др.) 				[FUNC_PIN_0110_GET_PIN_NAME.hpp]
//-------------------------------------------------------------------------------------------------
	String 		getNamePin(uint8_t pin);								//--Возвращает номер пина в текстовой форме(с учетом ESP8266, STM32); 
	uint8_t 	getPinString(String &str, uint8_t pin, char mode='T');	//--Возвращает номер пина в форматированном виде;
//=================================================================================================	