//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										API PIN BOARD MAIN
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++                                
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//								1. Получение значения из массивов
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

  uint8_t getPinALL(uint8_t idx); 	//--Возвращает по индексу значение из массива RT_HW_PGM_PIN_ALL_ID;
  uint8_t getPinDOT(uint8_t idx);	//--Возвращает по индексу значение из массивов: если PLC то из RT_HW_PGM_PLC_DOT_ID. 
									//											  Иначе из массива RT_HW_PGM_PIN_DOT_ID;
  uint8_t getPinPWM(uint8_t idx);	//--Возвращает по индексу значение из массивов: если PLC то из RT_HW_PGM_PLC_PWM_ID. 
									//											  Иначе из массива RT_HW_PGM_PIN_PWM_ID; 
  uint8_t getPinDAC(uint8_t idx){	//--Возвращает по индексу значение из массивов: если PLC то из RT_HW_PGM_PLC_DAC_ID. 
									//											  Иначе из массива RT_HW_PGM_PIN_DAC_ID;
  uint8_t getPinDIN(uint8_t idx)	//--Возвращает по индексу значение из массивов: если PLC то из RT_HW_PGM_PLC_DIN_ID. 
									//											  Иначе из массива RT_HW_PGM_PIN_DIN_ID;
  uint8_t getPinADC(uint8_t idx)	//--Возвращает по индексу значение из массивов: если PLC то из RT_HW_PGM_PLC_ADC_ID. 
									//											  Иначе из массива RT_HW_PGM_PIN_ADC_ID;
  uint8_t getPinTCH(uint8_t idx); 	//--Возвращает по индексу значение из массива RT_HW_PGM_PIN_TCH_ID;
  uint8_t getPinSRV(uint8_t idx); 	//--Возвращает по индексу значение из массива RT_HW_PGM_PIN_SRV_ID;
  uint8_t getPinINT(uint8_t idx); 	//--Возвращает по индексу значение из массива RT_HW_PGM_PIN_INT_ID; 
  uint8_t getPinN5V(uint8_t idx);  	//--Возвращает по индексу значение из массива RT_HW_PGM_PIN_N5V_ID;
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//								2. КОНТРОЛЬ НАЛИЧИЯ ПИНОВ BOARD В МАССИВЕ PROGMEM
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ 
  uint8_t checkPinALL(uint8_t pin); //--Проверка наличия пина ALL;
  uint8_t checkPinDOT(uint8_t pin); //--Проверка наличия пина DOT;
  uint8_t checkPinPWM(uint8_t pin); //--Проверка наличия пина PWM; 
  uint8_t checkPinDAC(uint8_t pin); //--Проверка наличия пина DAC;
  uint8_t checkPinDIN(uint8_t pin); //--Проверка наличия пина DIN;
  uint8_t checkPinADC(uint8_t pin); //--Проверка наличия пина ADC;
  uint8_t checkPinTCH(uint8_t pin); //--Проверка наличия пина TCH;
  uint8_t checkPinSRV(uint8_t pin); //--Проверка наличия пина SRV;
  uint8_t checkPinINT(uint8_t pin); //--Проверка наличия пина INT;
  uint8_t checkPinN5V(uint8_t pin); //--Проверка наличия пина N5V;
//=================================================================================================

