//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//									API PARAM BOARD
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//-------------------------------------------------------------------------------------------------
//			1.ДОСТУП К МАССИВАМ PROGMEM VAR (uint8_t)		[API_0100_GET_PGM_TOTAL.hpp]
//-------------------------------------------------------------------------------------------------
	uint8_t 	getVarPGM  (const uint8_t *arr, uint8_t sizeArr, uint8_t idx);	//--Получение значения по индексу в массиве. Длина массива ограничена sizeArr;
	uint8_t 	checkVarPGM(const uint8_t *arr, uint8_t sizeArr, uint8_t var);	//--Проверка наличия значения var в массиве. Длина массива ограничена sizeArr;
	uint8_t 	getSizePGM (const uint8_t *arr);								//--Получение размера массива в котором последний элемент равен RT_HW_PGM_END;

//-------------------------------------------------------------------------------------------------
//			2.ДОСТУП К ПАРАМЕТРАМ ПЛАТЫ 					[API_0101_GET_PARAM_TOTAL.hpp]
//-------------------------------------------------------------------------------------------------
	String 		getVerName();				 	//--Получение имени версии RT_HW_BASE.h;	
	String 		getBoardID();					//--Получение ID (uint32_t) платы;						
	String 		getBoardSelect();				//--Наименование выбранной платы;	
	uint16_t	getBoardCode();					//--Получение кода платы;					
	String 		getArchName();					//--Получение имени архитектуры;				
	uint8_t		getArchCode();					//--Получение кода архитектуры;			
	String		getCoreName();					//--Получение имени ядра (CORE);					
	String 		getBoardMemory();				//--Получение параметров памяти;			
	uint16_t 	getFCPU();						//--Получение частоты процессора;		
	uint16_t 	getVcc();						//--Получение значение Vcc;		
//-------------------------------------------------------------------------------------------------
	uint8_t 	getDepthSYS();					//--Получение разрядности SYSTEM;
	uint8_t 	getDepthADC();					//--Получение разрядности ADC;
	uint8_t 	getDriftADC();					//--Получение дрейфа значения ADC;
	uint8_t 	getNullADC();					//--Получение дрейфа нуля ADC;
	uint8_t 	getDepthPWM();					//--Получение разрядности PWM;
	uint8_t  	getDepthDAC();					//--Получение разрядности DAC;
	uint8_t  	vDepthTCH();					//--Получение разрядности TOUCH (ESP32 CORE 2.x);	
//-------------------------------------------------------------------------------------------------
//			3.ДОСТУП К МАССИВАМ ПИНОВ PROGMEM 			[API_0105_GET_PIN_PGM.hpp]
//-------------------------------------------------------------------------------------------------
	uint8_t 	getPinPGM(    const uint8_t *arr, uint8_t idx); //--Получение пина по его индексу;
	uint8_t 	checkPinPGM(  const uint8_t *arr, uint8_t pin);	//--Проверка наличия значения пина в массиве;
	uint8_t 	getSizePinPGM(const uint8_t *arr);				//--Получение размера массива без учета значений=255 (пин отсутствует=255)
	uint8_t 	getFullPinPGM(const uint8_t *arr);				//--Получение полного размера массива; 
//-------------------------------------------------------------------------------------------------
//			4.ФУНКЦИЯ ПОЛУЧЕНИЯ ИМЕН ПИНОВ  			[API_0106_GET_PIN_NAME.hpp]
//-------------------------------------------------------------------------------------------------
	String 		getNamePin  (             uint8_t pin);					//--Возвращает номер пина в текстовой форме(с учетом ESP8266, STM32); 
	uint8_t 	getPinString(String &str, uint8_t pin, char mode='T');	//--Возвращает номер пина в форматированном виде в str;
	uint8_t		getNumPinSTM32(char reg, uint8_t num);					//--Возвращает номер пина по регистру reg(A,B,C,D,E,F,G) и номеру num(0-15). Если пина нет, возвращает 255; 	
//=================================================================================================	