//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										API PLC PIN ADD
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//									1.1. Получение пина Led RUN
//=================================================================================================
  uint8_t 	PLC_getPinLedRUN(); 
  uint8_t 	PLC_getPinLedERR(); 
//=================================================================================================
  uint8_t 	PLC_getPinSwitch();
  uint8_t 	PLC_getPinVcc(); 
//=================================================================================================
  uint8_t 	PLC_getPinADCust1(); 
  uint8_t 	PLC_getPinADCust2();     
//=================================================================================================



//-------------------------------------------------------------------------------------------------
//			1.ДОСТУП К ПАРАМЕТРАМ PLC 				[FUNC_DEFINE_PGM_0130_GET_PARAM_PLC.hpp]
//-------------------------------------------------------------------------------------------------
	uint16_t 	getPLCcode();					//--Получение кода PLC;
	String 		getPLCname();					//--Получение имени PLC;

	uint8_t 	getPLCnumConsole();				//--Получение значения номера консоли PLC;
	uint8_t 	getPLCpinLed();					//--Получение значения пина Led;
	uint8_t 	getPLCpinButton();				//--Получение значения пина Button;
	uint8_t 	getPLCpinSwitch();				//--Получение значения пина Switch;
	uint8_t 	getPLCpinVcc();					//--Получение значения пина контроль Vcc;
	uint8_t 	getPLCpinADC_ust1();			//--Получение значения пина ADC уставка 1;
	uint8_t 	getPLCpinADC_ust2();			//--Получение значения пина ADC уставка 2;
//-------------------------------------------------------------------------------------------------
	uint8_t 	getPLCbusETH0();				//--Получение номера шины Ethernet0;
	uint8_t 	getPLCbusETH1();				//--Получение номера шины Ethernet1;
	uint8_t 	getPLCbusETH2();				//--Получение номера шины Ethernet2;
	uint8_t 	getPLCbusETH3();				//--Получение номера шины Ethernet3;
//-------------------------------------------------------------------------------------------------
	uint8_t 	getPLCcsETH0();					//--Получение cs Ethernet0;
	uint8_t 	getPLCcsETH1();					//--Получение cs Ethernet1;
	uint8_t 	getPLCcsETH2();					//--Получение cs Ethernet2;
	uint8_t 	getPLCcsETH3();					//--Получение cs Ethernet3;
//-------------------------------------------------------------------------------------------------
	uint8_t 	getPLCoeETH0();					//--Получение oe Ethernet0;
	uint8_t 	getPLCoeETH1();					//--Получение oe Ethernet1;	
	uint8_t 	getPLCoeETH2();					//--Получение oe Ethernet2;
	uint8_t 	getPLCoeETH3();					//--Получение oe Ethernet3;		
//------------------------------------------------------------------------------------------------- 
	uint32_t 	getPLCspeedETH0()				//--Получение speed SPI Ethernet0;
	uint32_t 	getPLCspeedETH1()				//--Получение speed SPI Ethernet1;	
	uint32_t 	getPLCspeedETH2()				//--Получение speed SPI Ethernet2;
	uint32_t 	getPLCspeedETH3()				//--Получение speed SPI Ethernet3;
//-------------------------------------------------------------------------------------------------
	uint8_t 	getPLCpinSpnSCK();				//--Получение значения пина SPN	SCK;
	uint8_t 	getPLCpinSpnMISO();				//--Получение значения пина SPN MISO;
	uint8_t 	getPLCpinSpnMOSI();				//--Получение значения пина SPN_MOSI;
	uint8_t 	getPLCspeenSpn();				//--Получение значения SPN Speed(0-100%)
//-------------------------------------------------------------------------------------------------
	uint8_t 	getPLCpinSpnCS_HC165();			//--Получение значения пина SPN CS  HC165;
	uint8_t 	getPLCpinSpnQN_HC165();			//--Получение значения кол-ва чипов HC165;
	uint8_t 	getPLCpinSpnCS_HC595();			//--Получение значения пина SPN CS  HC595;
	uint8_t 	getPLCpinSpnOE_HC595();			//--Получение значения пина SPN OE  HC595;
	uint8_t 	getPLCpinSpnQN_HC595();			//--Получение значения кол-ва чипов HC595;
//=================================================================================================
