//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										API PIN BOARD TEST
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++                                
	uint8_t 	getPinControl();				//--Получение значения пина control;
	uint8_t 	getPinLed();					//--Получение значения пина Led;
	uint8_t 	getPinWS2812();					//--Получение значения пина WS2812;
	uint8_t 	getPinButton(); 				//--Получение значения пина Button
	uint8_t 	getPinADC();					//--Получение значения пина ADC;
	uint8_t 	getPinPWM();	 				//--Получение значения пина PWM;
	uint8_t 	getPinTest();					//--Получение значения пина Test;
//-------------------------------------------------------------------------------------------------
	uint8_t 	getPinDAC0();					//--Получение значения пина DAC0;
	uint8_t 	getPinDAC1();					//--Получение значения пина DAC1;
//-------------------------------------------------------------------------------------------------
	uint8_t 	getPinCS0();					//--Получение значения пина CS0;
	uint8_t 	getPinCS1();					//--Получение значения пина CS1;
	uint8_t 	getPinCS2();					//--Получение значения пина CS2;
	uint8_t 	getPinCS3();					//--Получение значения пина CS3;
//-------------------------------------------------------------------------------------------------
	uint8_t 	getPinDS1820();					//--Получение значения пина DS1820;
	uint8_t 	getPinDHT22(); 					//--Получение значения пина DHT22;
	uint8_t 	getPinSR04();					//--Получение значения пина HC-SR04;
//-------------------------------------------------------------------------------------------------
	uint8_t 	getPinServo0();					//--Получение значения пина SERVO0;
	uint8_t 	getPinServo1();					//--Получение значения пина SERVO1; 
//=================================================================================================
	uint8_t 	getUartConsole();				//--Получение номера UART консоли;
	uint8_t 	getUartModbus1();				//--Получение номера UART Modbus1;
	uint8_t 	getUartModbus2();				//--Получение номера UART Modbus2;	
	uint8_t 	getUartModbus3();				//--Получение номера UART Modbus3;	
 	uint8_t 	getUartHMI1();					//--Получение номера UART HMI1;
 	uint8_t 	getUartHMI2();					//--Получение номера UART HMI2;
 	uint8_t 	getUartWiFi();					//--Получение номера UART моста Wi-Fi;
//=================================================================================================


/*  
//=================================================================================================

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//									4. Получение пинов и параметров PLC
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ 
//=================================================================================================
//									4.1. Получение значения пина Switch
//=================================================================================================
  uint8_t getPinErr(){
	#if defined(RT_HW_PLC_PIN_ERR)
		return  RT_HW_PLC_PIN_ERR;
	#else
		return 255;	 
	#endif
  }; 
//=================================================================================================
//									4.1. Получение значения пина Switch
//=================================================================================================
  uint8_t getPinSwitch(){
	#if defined(RT_HW_PLC_PIN_SWITCH)
		return  RT_HW_PLC_PIN_SWITCH;
	#else
		return 255;	 
	#endif
  };  
//=================================================================================================
//									2.4. Получение значения пина контроль Vcc
//=================================================================================================
  uint8_t getPinVcc(){
	#if defined(RT_HW_PLC_PIN_VCC)
		return  RT_HW_PLC_PIN_VCC;
	#else
		return 255;	 
	#endif
  }; 
//=================================================================================================
//									2.5. Получение значения пина ADC уставка 1
//=================================================================================================
  uint8_t getPinADC_ust1(){
	#if defined(RT_HW_PIN_ADC_UST1)
		return  RT_HW_PIN_ADC_UST1;
	#else
		return 255;	 
	#endif
  };
//=================================================================================================
//									2.6. Получение значения пина ADC уставка 2
//=================================================================================================
  uint8_t getPinADC_ust2(){
	#if defined(RT_HW_PIN_ADC_UST2)
		return  RT_HW_PIN_ADC_UST2;
	#else
		return 255;	 
	#endif
  };
  
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										III. ETHERNET: пины и параметры
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//										3.1. Получение номера шины Ethernet(0-3)
//=================================================================================================
  uint8_t getBusETH0(){
	#if defined(RT_HW_PLC_BUS_ETH0)
		return  RT_HW_PLC_BUS_ETH0
	#else
		return 255;	 
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint8_t getBusETH1(){
	#if defined(RT_HW_PLC_BUS_ETH1)
		return  RT_HW_PLC_BUS_ETH1
	#else
		return 255;	 
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint8_t getBusETH2(){
	#if defined(RT_HW_PLC_BUS_ETH2)
		return  RT_HW_PLC_BUS_ETH2
	#else
		return 255;	 
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint8_t getBusETH3(){
	#if defined(RT_HW_PLC_BUS_ETH3)
		return  RT_HW_PLC_BUS_ETH3
	#else
		return 255;	 
	#endif	  
  };  
//=================================================================================================
//										3.2. Получение cs Ethernet(0-3)
//=================================================================================================
  uint8_t getCsETH0(){
	#if defined(RT_HW_PLC_CS_ETH0)
		return  RT_HW_PLC_CS_ETH0
	#else
		return 255;	 
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint8_t getCsETH1(){
	#if defined(RT_HW_PLC_CS_ETH1)
		return  RT_HW_PLC_CS_ETH1
	#else
		return 255;	 
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint8_t getCsETH2(){
	#if defined(RT_HW_PLC_CS_ETH2)
		return  RT_HW_PLC_CS_ETH2
	#else
		return 255;	 
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint8_t getCsETH3(){
	#if defined(RT_HW_PLC_cs_ETH3)
		return  RT_HW_PLC_cs_ETH3
	#else
		return 255;	 
	#endif	  
  };   
//=================================================================================================
//										3.3. Получение oe Ethernet(0-3)
//================================================================================================= 
  uint8_t getOeETH0(){
	#if defined(RT_HW_PLC_OE_ETH0)
		return  RT_HW_PLC_OE_ETH0
	#else
		return 255;	 
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint8_t getOeETH1(){
	#if defined(RT_HW_PLC_OE_ETH1)
		return  RT_HW_PLC_OE_ETH1
	#else
		return 255;	 
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint8_t getOeETH2(){
	#if defined(RT_HW_PLC_OE_ETH2)
		return  RT_HW_PLC_OE_ETH2
	#else
		return 255;	 
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint8_t getOeETH3(){
	#if defined(RT_HW_PLC_OE_ETH3)
		return  RT_HW_PLC_OE_ETH3
	#else
		return 255;	 
	#endif	  
  };
//=================================================================================================
//										3.4. Получение speed Ethernet(0-3)
//================================================================================================= 
  uint32_t getSpeedETH0(){
	#if 	defined(RT_HW_PLC_SPEED_ETH0)
		return  RT_HW_PLC_SPEED_ETH0
	#else
		return  RT_HW_SPI_SPEED;	 
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint32_t getSpeedETH1(){
	#if defined(RT_HW_PLC_SPEED_ETH1)
		return  RT_HW_PLC_SPEED_ETH1
	#else
		return  RT_HW_SPI_SPEED;
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint32_t getSpeedETH2(){
	#if defined(RT_HW_PLC_SPEED_ETH2)
		return  RT_HW_PLC_SPEED_ETH2
	#else
		return  RT_HW_SPI_SPEED;	 
	#endif	  
  };
//-------------------------------------------------------------------------------------------------
  uint32_t getSpeedETH3(){
	#if defined(RT_HW_PLC_SPEED_ETH3)
		return  RT_HW_PLC_SPEED_ETH3
	#else
		return  RT_HW_SPI_SPEED; 
	#endif	  
  };
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
*/