//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										СТРУКТУРЫ для SPN
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//									1. Данные для SPNx 
//=================================================================================================		
 struct RT_HW_STRUCT_SPN_DEV{
//-------------------------------------------------------------------------------------------------
	uint8_t  custom=0;				//--1.Setting option;
	uint8_t  status=0;				//--2.Status device: =0 no init; =1 Master.MCU->Slave.device; =2 Slave;
	uint8_t  link=0;				//--3. Флаг завершения транзакции с устройством (=0-ок);
	uint8_t  codeErr=0;				//--4. Код ошибкиC;
//-------------------------------------------------------------------------------------------------
	uint8_t  sck=255;				//--6.1. Номер пина sck;
	uint8_t  miso=255;				//--6.2. Номер пина miso;
	uint8_t  mosi=255;				//--6.3. Номер пина mosi;
	uint8_t  cs=255;				//--6.4. Номер пина cs;
	uint8_t  cs1=255;				//--6.5. Номер пина cs1;
	uint8_t  oe=255;				//--6.6. Номер пина oe; (используется 74HC595)
	uint8_t  stateOe=0;				//--0,1,2
	uint8_t  bitOrder=1;			//--6.6.In var, the most significant bit is ahead; 
//-------------------------------------------------------------------------------------------------
	uint32_t bf32;					//--Working register;
//-------------------------------------------------------------------------------------------------
	uint8_t  speed=100;				//--Скорость в %: 100-max, 0-min;
	uint8_t  time=0;				//--Рабочий регистр; Working delay time(0-10);
//----------------------------------------УСТАРЕВШИЕ ПАРАМЕТРЫ-------------------------------------
	int8_t   idx,idb;				//--Index;	
	uint8_t	 permitMISO=0, permitMOSI=0, permitOE=0;
	uint8_t	 userRX=1,   userTX=1;
 };
 //================================================================================================	 