//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										СТРУКТУРЫ УПРАВЛЕНИЯ ЗАДАЧАМИ
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//						1.1. Вспомогательная структура для диспетчера задач
//=================================================================================================
  struct RT_HW_STRUCT_SHAD{
	uint8_t  num=0; 		//--номер задачи как событие; 
	uint8_t  cnt=0;		//--текущий счетчик задач(рабочий параметр);
	uint8_t  qnt=5;		//--максимальное кол-во задач;
  };
//=================================================================================================
//						1.2. Структура для диспетчера задач
//		CORE0 - ядро MCU основное. Поддерживается в секциях: void setup();  void loop();
//		CORE1 - ядро MCU второе.   Поддерживается в секциях: void setup1(); void loop1();
//=================================================================================================
  struct RT_HW_STRUCT_SHED_ID{
	RT_HW_STRUCT_SHAD 	
		 sysQuick,						//--Параметры приотетной оперативной задачи(циклическое изменение в каждом цикле loop());
		 sysFast,						//--Параметры приотетной быстрой     задачи(циклическое изменение в каждом цикле loop());
		 sysSlow,						//--Параметры приотетной медденной   задачи(циклическое изменение в каждом цикле loop());
		 quick, 						//--Параметры оперативной задачи;
		 fast,  						//--Параметры быстрой     задачи;
		 slow,  						//--Параметры медленной   задачи;
		 back,  						//--Параметры фоновой     задачи;
		 frdm,							//--Параметры свободной   задачи;
	     frdm1;							//--Параметры свободной   задачи для loop1();		 
//-------------------------------------------------------------------------------------------------
	uint8_t  ready=0;                    	//--Флаг запуска проекта ready.
	uint8_t  blink1=1,blink10=1,blink25=1,blink50=1,blink100=1,blink250=1,blink500=1,blink1000=1; //--Состояние меандров 10,25,50,100,250,500,1000ms;
	uint8_t  blinkSec=1;
	uint8_t  eventSec=1;					//--Событие 1 сек;
	uint8_t  event=0,run=0; 				//--Рабочие флаги
//-------------------------------------------------------------------------------------------------
	uint32_t cntSec=0;					//--Счетчик секунд с начала запуска программы [Мотосекунды];
	uint8_t  initParam=0;					//--Состояние инициализации параметров проекта (для использования пользователем);
//-------loop() CORE0 -----------------------------------------------------------------------------
	uint8_t  control=1;					//--Изменение в каждом цикле loop()  (для наблюдения на пине логическим анализатором);
	uint32_t cycle; 						//--Кол-во циклов loop()       в сек (Быстродействие CORE0 в кол-ве циклов loop()/сек);
	uint16_t smallCycle;    				//--Кол-во циклов loop()/1000  в сек (Быстродействие CORE0 в кол-ве циклов loop()/1000/сек);
	uint32_t cntCycle=0;    				//--Рабочий счетчик для расчета кол-во циклов loop();
//-------loop1()------------------------------------------------------------------------------------
	uint8_t  isLoop1=0;					//--Флаг наличия  loop1() (для MCU c дополнит.ядром  CORE1 [RP2040,...]); 
	uint8_t  freshSec1=0;					//--Флаг события секунды для вычисления быстродействия loop1;
	uint8_t  control1=1;					//--Изменение в каждом цикле loop1() (для наблюдения на пине логическим анализатором);
	uint32_t cycle1; 						//--Кол-во циклов loop1()      в сек (Быстродействие CORE1 в кол-ве циклов loop1()/сек);
	uint16_t smallCycle1;    				//--Кол-во циклов loop1()/1000 в сек (Быстродействие CORE1 в кол-ве циклов loop1()/1000/сек);
	uint32_t cntCycle1=0;    				//--Рабочий счетчик для расчета кол-ва циклов loop1();
//-------Console-----------------------------------------------------------------------------------
	uint8_t  cntConsole=0;				//--Счетчик для синхронизации с консолью (для вывода заголовка);
//-------------------------------------------------------------------------------------------------
	uint32_t timeStart10=0, timeStart25=0;//--Рабочие таймеры для периодов 10 и 2ms; 
	uint8_t  workSec;						//--Рабочий параметр;
	uint8_t  cnt50=0, cnt100=0, cnt250=0; //--Рабочие счетчики событий 50,100,250ms
//----------------------------------------------------------------------------------------------------
	RT_HW_STRUCT_SHED_ID(){
		sysQuick.qnt=10;	sysFast.qnt=25;  sysSlow.qnt=50;
		quick.qnt=5;		fast.qnt=5;		 slow.qnt=4; 	frdm.qnt=50;  frdm1.qnt=5;
	};
//----------------------------------------------------------------------------------------------------	
  };
  
//=================================================================================================
//                  	3. Структуры управления динамической задержки *** (возможно устаревшая)!!!
//=================================================================================================
  struct RT_HW_STRUCT_TIME{                    
	uint8_t  state=0;						//--Состояние функции (1 - ожидание завершение задержки);
	uint8_t  pointTime; 					//--Точка возрата из функции(для пользовательского использования);
	uint32_t sizeDelay=100;					//--Время задержки;
	uint32_t startTime,curTime;				//--Переменные для работы со временем;  
//-------------------------------------------------------------------------------------------------
	//RT_HW_STRUCT_TIME(){;};
	RT_HW_STRUCT_TIME(uint32_t _sizeDelay=100){sizeDelay=_sizeDelay;};	
  };
//=================================================================================================
//                  	4. Структура управления задачами **** (устаревшая)
//-------------------------------------------------------------------------------------------------
// Работает совместно с функциями directTask и при необходимости с SetTaskID
//	(uint8_t)periodLimit - ограничение частоты вызова в циклах вхождения в функцию [режимы С,A]; default=5;
//  (uint16_t)periodTask - период вызова в мс [режимы P,T,A] default=1000;
//  Режимы запуска: 
//	 'C'-запуск по внешним условиям(например изменения входных параметров для расширителя) 
//       с ограничением частоты вызова в циклах вызова функции[periodLimit];
//   'P'-периодический безусловный запуск;       
//   'T'-периодический запуск по внешним условиям(как в режиме 'C')
//	 'A'-запуск по внешним условиям(как в режиме'C') или периодически 
//       (обычно с большим периодом для повышения устойчивости проекта); 		
//   'Q'-запуск в каждом цикле по внешним условиям (для быстрых процессов и для тестирования);
//   'E'-запуск в каждом цикле. Может быть использован для управления через вход EN, 
//       в т.ч. для периодического вызова события=1 на входе EN;
//   'F'-однократное выполнение. Для повтора можно установить id.first=1;
//
//   'N'-запуск отключен;
//  Вход:
//  run-может устанавливаться внешней функцией. run=5 -означает, что функция запущена на выполнение;
//  Выходы:
//  run-  =0 нет запуска; 
//        =1 безусловный запуск; 
//        =2 будет запуск проверке условий  внешней функции (например по изменению выводимого параметра);
//=================================================================================================
struct RT_HW_STRUCT_SHED_TASK{                    	//--Управление задачами полный
  uint8_t  custom=0;    
  char     mode='C'; 								//--Режим задачи: 
  uint16_t period=1000; 
  uint16_t Period=2500; 							//--Период
  uint8_t  cntLimit=0;  uint8_t periodLimit=5; 
  uint8_t  first=1;									//--Флаг первого запуска;     
  uint8_t  agoEN=1; uint8_t extEN=1; uint8_t run=0;     
  uint32_t timeBegin; 
  uint32_t TimeBegin;       
};

//=================================================================================================
//						 				6. Защита от дребезга *** 
//											УСТАРЕВШАЯ ФУНКЦИЯ
//=================================================================================================
  struct RT_HW_CHATTER_DIN{uint32_t timeBegin; uint8_t dir=0; uint8_t ago=0;};
//=================================================================================================	
