//=================================================================================================
//					    2. Cтруктура для работы с часами UNIX временем
//                    (объект с именем unixTime создается в RT_HW_BASE.h)
//=================================================================================================
struct   RT_HW_STRUCT_UNIX_ID{
  uint32_t timeSTART;				//--1.Стартовое время работы проекта, использующего данную структуру(MCU,NTP-server,RTC-STM32,RTC-DS3231...);
  uint32_t timeEXT; 				//--2.Время от внешнего источника времени  в сек от 01.01.1970г. по Гринвичу;
  uint32_t timeUNIX;  				//--3.Время текущее в сек от 01.01.1970г. по Гринвичу;
  uint32_t timeMs;					//--4.Время фиксации установки timeUNIX в ms(millis());
  uint8_t  zone=3;					//--5.Номер часового пояса.
  uint8_t  runEXT=0;				//--6.Флаг запуска обновления от внешнего источника (timeUNIX_ext);
  uint8_t  freshEXT=0;				//--7.Флаг обновления времени от внешнего источника;
  uint8_t  fresh=0;					//--8.Флаг обновления    timeUNIX;
  uint8_t  cntFresh=0;				//--9.Счетчик обновления timeUNIX;
  uint8_t  ok=0;					//--10.Устройство готово к работе; 
  uint8_t  agoRun=255;				//--11.Рабочий регистр для синхронизации тактирующего меандра;
//-------------------------------------------------------------------------------------------------
  uint8_t  hours,minutes,seconds;	//--12.Время:часы,минуты,секунды;
  uint8_t  weekDay,day,month,year;	//--13.Дата: день,месяц,день недели,две младших цифры в годе;						
  uint16_t year4;					//--14.Год четыре цифры;
//-------------------------------------------------------------------------------------------------
};
//=================================================================================================
