

//=================================================================================================
//								1.Структура для работы с сообщениями 
//=================================================================================================	
struct RT_HW_MESS_ID { 
	String  str;			   		//--Формируемая строка;
	uint8_t dir=0;					//--Номер этапа в функции;
	char    suff;					//--Суффикс строки;
	uint8_t lenVar;					//--Длина сообщения в символах;
	uint8_t lenByte;				//--Длина сообщения в байтах (с учетом кодировки Unicode8);					
	uint8_t lenBegin,lenEnd;		//--Длина заполнителей спереди и сзади сообщения;
	uint8_t lenSuff:1,lenCR:1;		//--Флаг наличия суффикса;
};
//=================================================================================================
