//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										СТРУКТУРЫ УПРАВЛЕНИЯ ЗАДАЧАМИ
//// Параметры настройки в структуре RT_HW_STRUCT_SHED_TASK:
//	(uint8_t)periodLimit - ограничение частоты вызова в циклах вхождения в функцию [режимы С,A]; default=5;
//  (uint16_t)periodTask - период вызова в мс [режимы P,T,A] default=1000;
//  Режимы запуска: 
//	 'C'-запуск по внешним условиям(например изменения входных параметров для расширителя) 
//       с ограничением частоты вызова[periodLimit];
//   'P'-периодический безусловный запуск;       
//   'T'-периодический запуск по внешним условиям(как в режиме 'C')
//	 'A'-запуск по внешним условиям(как в режиме'C') или периодически 
//       (обычно с большим периодом для повышения устойчивости проекта); 		
//   'Q'-запуск в каждом цикле по внешним условиям (для быстрых процессов и для тестирования);
//   'E'-запуск в каждом цикле. Может быть использован для управления через вход EN, 
//       в т.ч. для периодического вызова события=1 на входе EN;
//   'F'-однократное выполнение. Для повтора можно установить id.first=1;
//   'N'-запуск отключен;
//  Вход:
//  run-может устанавливаться внешней функцией. run=5 - означает, что функция запущена на выполнение;
//  Выходы
//  run-  =0 нет запуска; 
//        =1 безусловный запуск; 
//        =2 будет запуск по проверке вншней функции (например по изменению выводимого параметра);
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//=================================================================================================
//                  	1.Структуры управления запуском задач
//  Режимы запуска: 
//   'E'-запуск в каждом цикле. Может быть использован для управления через вход EN, 
//       в т.ч. для периодического вызова события=1 на входе EN;
//   'F'-однократное выполнение. Для повтора можно установить id.first=1;
//   'P'-периодический безусловный запуск;      
//	 'C'-запуск по внешним условиям(например изменение параметров) с ограничением частоты запуска;
//   'T'-запуск по внешним условиям(например изменение параметров) с ограничением периода запуска;
//	 'A'-запуск по внешним условиям(например изменение параметров) с ограничением периода запуска
//------------------------------------------------------------------------------------------------
//  Вход:
//  run-может устанавливаться внешней функцией. run=5 -означает, что функция запущена на выполнение;
//  Выходы:
//  run-  =0 нет запуска; 
//        =1 безусловный запуск; 
//        =2 будет запуск проверке условий  внешней функции (например по изменению выводимого параметра);

//=================================================================================================
struct RT_HW_STRUCT_DIRECT_TaskE_ID{        //--Управление в каждом цикле;     
  uint8_t  agoEN=0;  						//----Обработка входа EN;
  uint8_t  run=1;           
};
//=================================================================================================
struct RT_HW_STRUCT_DIRECT_TaskF_ID{        //--Управление однократным запуском; 
  uint8_t  agoEN=0;  						//----Обработка входа EN;  
  uint8_t  first=1;							//----Флаг первого запуска;     
  uint8_t  run=1;   						//----Управление запуском;        
};
//=================================================================================================
//							Управление периодическим запуском;
//=================================================================================================
struct RT_HW_STRUCT_DIRECT_TaskP_ID{        //--Управление периодическим запуском; 
  uint8_t  agoEN=0;  						//----Обработка входа EN;  
  uint8_t  first=1;							//----Флаг первого запуска;     
  uint8_t  run=1;   						//----Управление запуском;        
  uint8_t  cntPass=0;						//----Счетчик пропусков проверки изменений;
  uint32_t timeBegin;						//----Рабочий флаг для отсчета времени; 
//-------------------------------------------------------------------------------------------------
/*
  void direct (uint8_t qntPass, uint16_t period, uint8_t extEN){
	(void)period;
	run=0;
    if(!extEN)    	{agoEN=extEN;                                  		return;}
    if(agoEN!=extEN){agoEN=extEN; cntPass=0; timeBegin=millis(); run=1; return;}	
	if(++cntPass<qntPass){return;}			 cntPass=0; 
    //if(RT_HW_getPastMs(timeBegin)>period)	{timeBegin=millis(); run=1;}	
  };
//-------------------------------------------------------------------------------------------------
	void direct(uint16_t period, uint8_t extEN){direct(0,period,extEN);};    
	void direct(uint16_t period)               {direct(0,period,1);};
*/	
};
//=================================================================================================
struct RT_HW_STRUCT_DIRECT_TaskC_ID{        //--Управление запуском по изменению c ограничением пропусками; 
  uint8_t  agoEN=0;  						//----Обработка входа EN;  
  uint8_t  first=1;							//----Флаг первого запуска;     
  uint8_t  run=1;   						//----Управление запуском;        
  uint8_t  cntPass=0;	
  //----Счетчик пропусков проверки изменений;
  //RT_HW_Base.uartGetStetus(0);
}; 
//=================================================================================================
struct RT_HW_STRUCT_DIRECT_TaskT_ID{            //--Управление запуском по изменению c ограничением периода;  
  uint8_t  agoEN=0;  						//----Обработка входа EN;  
  uint8_t  first=1;							//----Флаг первого запуска;     
  uint8_t  run=1;   						//----Управление запуском;        
  uint8_t  cntPass=0;						//----Счетчик пропусков проверки изменений;
  uint32_t timeBegin;						//----Рабочий флаг для отсчета времени; 
}; 
//=================================================================================================
  struct RT_HW_STRUCT_DIRECT_TaskA_ID{      //==Управление запуском по изменению c ограничением периода или периодически;  
	uint8_t  agoEN=0;  						//--Обработка входа EN;  
	uint8_t  first=1;						//--Флаг первого запуска;     
	uint8_t  run=1;   						//--Управление запуском;        
	uint8_t  cntPass=0;						//--Счетчик пропусков проверки изменений;  
	uint32_t timeBegin;						//--Рабочий флаг для отсчета времени малого периода; 
	uint32_t timeBEGIN;						//--Рабочий флаг для отсчета времени большого периода; 
  }; 
//=================================================================================================
