//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//	
//						0. СТРУКТУРЫ генераторов, задержек времени, генераторов фронтов
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//						0.1. Структуры генераторов, задержек времени, генераторов фронтов;
//=================================================================================================	
  struct RT_HW_GENERATOR_EVENT_ID  {uint32_t time; uint8_t dir=0; uint8_t meander:1, event:1;}; 			//--Для генератора меандров и событий;
  struct RT_HW_GENERATOR_PULSE_ID  {uint32_t time; uint8_t dir=0;};											//--Для генератора импульсов;
  struct RT_HW_GENERATOR_PWM_ID    {uint32_t time; uint8_t dir=0; uint32_t timeON; uint32_t timeFULL; };	//--Для генератора программного ШИМ;
  struct RT_HW_GENERATOR_GROUP_ID  {uint32_t time; uint8_t dir=0; uint8_t  cnt=0; uint8_t ago=0; uint8_t meander=0;}; //--Для генератора пачки импульсов;
  struct RT_HW_GENERATOR_DELAY_ID  {uint32_t time; uint8_t dir=0; uint8_t  cnt=0; uint8_t ago=0;};			//--Для генератора задержек времени;
  struct RT_HW_GENERATOR_FRONT_ID  {uint32_t time; uint8_t  meander, event, ago;   uint8_t cnt=1;};  		//--Для генератора событий от фронтов;
//=================================================================================================
//						0.2. Структуры генераторов бегущей единицы
//=================================================================================================	
  struct RT_HW_GENERATOR_RUN_ID    {uint8_t  cnt=0;   uint8_t direct=0; uint32_t dc=0; uint8_t agoEN=255;};	//--Для счетчика бегущей единицы;
//=================================================================================================