//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										СТРУКТУРЫ для UART
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//									1. Регистры инициализации, готовности и занятости UART
//							bit.0-13-HardWareUart,	bit.14-SoftwareSerial, bit.15-BlueTooth; 
//=================================================================================================	
  struct RT_HW_STRUCT_UART_RXTX{
	uint16_t begin=0;	//--Биты инициализации; 
	uint16_t ready=0;	//--Биты готовности (устанавливаются после проверки Serialx);
	uint16_t busy=0; 	//--Биты занятости;
  };	
//=================================================================================================
//									2. Регистры для работы с аппаратным USB 
//									(ESP32Cx, ESP32S2, ESP32S3, STM32, RP2040)
//=================================================================================================	
  struct RT_HW_STRUCT_UART_USB {
	uint32_t timeBegin; 
	uint16_t dir=0;
	uint8_t  cnt=0; 
	uint8_t  bf8=0;
  };
//=================================================================================================
//									3. Данные для UARTx 
//=================================================================================================	
  struct RT_HW_STRUCT_UART     {
	uint8_t  custom=0;				//--1.Состояние настройки;
	uint8_t  status=0;				//--2.Статус: no init=0; Master=1; Slave=2;
	uint8_t  codeErr=0;				//--3.Код ошибки; 	
	uint8_t  busy=0;  				//--4.Флаг занятости;
//-------------------------------------------------------------------------------------------------
	uint8_t  rx=255; 				//--Номер пина RX;
	uint8_t  tx=255;				//--Номер пина RX;
//	uint8_t  de=255; 				//--Номер пина DE для RS-485
	uint8_t  dir=0;
//-------------------------------------------------------------------------------------------------
	uint32_t speed=RT_HW_UART_SPEED; //115200;			//--Скорость UART;
	#if defined(SERIAL_8N1)
		uint32_t config=SERIAL_8N1;		//--Конфигурация UART;
	#else 
		uint32_t config=0x800001C;
	#endif	
//-------------------------------------------------------------------------------------------------
	uint8_t dataBit=8;				//--5,6,7,8
	uint8_t stopBit=1;				//--1,2;
	uint8_t parity=0;				//--0-None, 1- even; 2-odd;
	uint8_t cntTest=3;	
  };
//=================================================================================================
//									4. Структура для встроенного BlueTooth (ESP32,RP2040)
//=================================================================================================	
  struct RT_HW_STRUCT_BLUETOOTH{
	uint8_t  custom=0;				//--1.Состояние настройки;
	uint8_t  status=0;				//--2.Статус UART: no init=0; Master=1; Slave=2;
	uint8_t  codeErr=0;				//--3.Код ошибки; 
	uint8_t  busy=0;  				//--4.Флаг занятости UART;
//-------------------------------------------------------------------------------------------------
	uint8_t  dir=0;
//-------------------------------------------------------------------------------------------------
	uint32_t speed=115200;
	String name="ESP32S BTH EIS";
  };

//=================================================================================================
//									5. Данные для работы как с устройством через UART
//=================================================================================================	
  struct RT_HW_STRUCT_UART_DEV{
//-------------------------------------------------------------------------------------------------
	uint8_t  custom=0;				//--1.Setting option;
	uint8_t  status=0;				//--2.Status device: =0 no init; =1 Master.MCU->Slave.device; =2 Slave;
	uint8_t  link=0;				//--3.Completed transaction flag;
	uint8_t  codeErr=0;				//--4.Code error;
	uint8_t  num=255;				//--6.number UART
//-------------------------------------------------------------------------------------------------
	uint8_t  bf8;					//--Working register;
//-------------------------------------------------------------------------------------------------
	int8_t   idx,idb;				//--Index;	
//-------------------------------------------------------------------------------------------------
	uint32_t speed=115200;			//--Speed;
  };
 //=================================================================================================	 