//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										4.ESP8266
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================						
//							Контроллеры ESP8266 GENERIC, NodeMCU 0.9, NodeMCU 1.0
//=================================================================================================
#if !defined(RT_HW_BOARD_CODE) && defined(RT_HW_CORE_ESP8266) && \
    (defined(ARDUINO_ESP8266_GENERIC)     || defined(ARDUINO_ESP8266_NODEMCU_ESP12)     || defined(ARDUINO_ESP8266_NODEMCU_ESP12E) ||\
	 defined(ARDUINO_ESP8266_GENERIC_EIS) || defined(ARDUINO_ESP8266_NODEMCU_ESP12_EIS) || defined(ARDUINO_ESP8266_NODEMCU_ESP12E_EIS) ||\
	 defined(ARDUINO_ESP8266_WEMOS_D1MINILITE) || defined(ARDUINO_ESP8266_WEMOS_D1MINILITE_EIS) ||\
	 defined(ARDUINO_ESP8266_ESP01)            || defined(ARDUINO_ESP8266_ESP01_EIS)\
	)	
    #define  RT_HW_BOARD_FCPU     80 											//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      3300											//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
//									0.1. ESP8266_GENERIC
//-------------------------------------------------------------------------------------------------
#if defined(ARDUINO_ESP8266_GENERIC) ||  defined(ARDUINO_ESP8266_GENERIC_EIS)                            
    #define  RT_HW_BOARD_CODE     41   											//--Идентификатор выбора платы c кодом платы;
    #define  RT_HW_BOARD_NAME     "ESP8266 Generic"								//--Наименование платы;
    #define  RT_HW_BOARD_MEMORY	  "FLASH=FS:(max)2Mb,OTA:(max)1019Kb; RAM=80Kb"	//--Параметры памяти;
    #define  RT_HW_BOARD_ESP8266_GENERIC  										//--Идентификатор типа платы;
#endif
//-------------------------------------------------------------------------------------------------
//									0.2. ESP8266_ESP01
//-------------------------------------------------------------------------------------------------
#if defined(ARDUINO_ESP8266_ESP01) ||  defined(ARDUINO_ESP8266_ESP01_EIS)                            
    #define  RT_HW_BOARD_CODE     42   											//--Идентификатор выбора платы c кодом платы;
    #define  RT_HW_BOARD_NAME     "ESP8266 ESP-01"								//--Наименование платы;
    #define  RT_HW_BOARD_MEMORY	  "FLASH=FS:(max)512; RAM=80Kb"					//--Параметры памяти;
    #define  RT_HW_BOARD_ESP8266_GENERIC  										//--Идентификатор типа платы;
#endif
//-------------------------------------------------------------------------------------------------
//									03. ESP8266_WEMOS_D1MINILITE
//-------------------------------------------------------------------------------------------------
#if defined(ARDUINO_ESP8266_WEMOS_D1MINILITE) || defined(ARDUINO_ESP8266_WEMOS_D1MINILITE_EIS)                            
    #define  RT_HW_BOARD_CODE     43   											//--Идентификатор выбора платы c кодом платы;
    #define  RT_HW_BOARD_NAME     "ESP8266 WEMOS D1 mini"								//--Наименование платы;
    #define  RT_HW_BOARD_MEMORY	  "FLASH=FS:(max)2Ьи; RAM=80Kb"					//--Параметры памяти;
    #define  RT_HW_BOARD_ESP8266_GENERIC  										//--Идентификатор типа платы;
#endif


//-------------------------------------------------------------------------------------------------
//									0.2. NodeMCU 0.9
//-------------------------------------------------------------------------------------------------
#if defined(ARDUINO_ESP8266_NODEMCU_ESP12) || defined(ARDUINO_ESP8266_NODEMCU_ESP12_EIS)                             
    #define  RT_HW_BOARD_CODE     42   											//--Идентификатор выбора платы c кодом платы;
    #define  RT_HW_BOARD_NAME     "NodeMCU 0.9(ESP-12)"							//--Наименование платы;
    #define  RT_HW_BOARD_MEMORY	  "FLASH=FS:(max)2Mb,OTA:(max)1019Kb; RAM=80Kb"	//--Параметры памяти;
    #define  RT_HW_BOARD_ESP8266_NODEMCU_09  									//--Идентификатор типа платы;
#endif
//-------------------------------------------------------------------------------------------------
//									0.3. NodeMCU 1.0
//-------------------------------------------------------------------------------------------------
#if defined(ARDUINO_ESP8266_NODEMCU_ESP12E)  || defined(ARDUINO_ESP8266_NODEMCU_ESP12E_EIS)                               
    #define  RT_HW_BOARD_CODE     43   											//--Идентификатор выбора платы c кодом платы;
    #define  RT_HW_BOARD_NAME     "NodeMCU 1.0(ESP-12E)"						//--Наименование платы;
    #define  RT_HW_BOARD_MEMORY	  "FLASH=FS:(max)2Mb,OTA:(max)1019Kb; RAM=80Kb"	//--Параметры памяти;
    #define  RT_HW_BOARD_ESP8266_NODEMCU_10  									//--Идентификатор типа платы;
#endif
//=================================================================================================
//									1. Ограничение ресурсов контроллера
//=================================================================================================	
	#define RT_HW_SPECIFIC_USING_1  "Download:: D3=1, D4=1, D8=0"
//=================================================================================================
//										2. Системные пины
//=================================================================================================
	#define  RT_HW_BOARD_PIN_CONTROL   RT_HW_ESP8266_D0		//--Контроль цикла loop();
	#define  RT_HW_BOARD_PIN_ADC       RT_HW_ESP8266_A0		//--ADC;	
	#define  RT_HW_BOARD_PIN_LED       RT_HW_ESP8266_D4		//--Led на плате;
	#define  RT_HW_BOARD_PIN_BUTTON    RT_HW_ESP8266_D3		//--Кнопка на плате;	

	#define  RT_HW_BOARD_PIN_PWM       RT_HW_ESP8266_D5		//--PWM;	
//=================================================================================================
//										3. Пины cs тестовые
//=================================================================================================

//==================================================================================================
//										4. Тестовые устройства
//==================================================================================================
	#define  RT_HW_BOARD_PIN_DS1820    RT_HW_ESP8266_D6		//--Сенсор DS1820;
	#define  RT_HW_BOARD_PIN_SR04      RT_HW_ESP8266_D7		//--Сенсор HC-SR04;
	#define  RT_HW_BOARD_PIN_TEST      RT_HW_ESP8266_D0		//--Пин тестовый;		

//=================================================================================================
//										5. Номера тестовых UART
//=================================================================================================	
	#define  RT_HW_BOARD_UART_MODBUS1   2					//--Номер UART для MODBUS 1;	
//==================================================================================================
//										10. Коммуникация
//==================================================================================================
 //=================================================================================================
//										10.1. UART
//=================================================================================================
	#define  RT_HW_PERMIT_UART0						//--Разрешение работы с UART0;
    #define  RT_HW_PERMIT_UART1						//--Разрешение работы с UART1;
    #define  RT_HW_PERMIT_UART2						//--Разрешение работы с UART2;
    #define  RT_HW_PERMIT_UART100					//--Разрешение работы с UART100;	
//-------------------------------------------------------------------------------------------------
	#define RT_HW_CREATE_UART2						//--Разрешение создания объекта Serial100;
	#define RT_HW_CREATE_UART100					//--Разрешение создания объекта Serial100;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART0_RX   	RT_HW_ESP8266_RX
    #define  RT_HW_UART0_TX   	RT_HW_ESP8266_TX	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART1_RX   	255
    #define  RT_HW_UART1_TX   	RT_HW_ESP8266_TX1	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART2_RX   	RT_HW_ESP8266_RX2
    #define  RT_HW_UART2_TX   	RT_HW_ESP8266_TX2	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART100_RX   RT_HW_ESP8266_D3
    #define  RT_HW_UART100_TX   RT_HW_ESP8266_D4	
//=================================================================================================
//										10.2. i2c
//=================================================================================================
    #define  RT_HW_PERMIT_I2C0						//--Разрешение работы с i2c0;    
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_I2C0_SCL   	RT_HW_ESP8266_D1
    #define  RT_HW_I2C0_SDA   	RT_HW_ESP8266_D2
//=================================================================================================
//										10.3. SPI
//=================================================================================================
    #define  RT_HW_PERMIT_SPI0						//--Разрешение работы с SPI0;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI0_SCK   	RT_HW_ESP8266_D5
    #define  RT_HW_SPI0_MISO  	RT_HW_ESP8266_D6
    #define  RT_HW_SPI0_MOSI  	RT_HW_ESP8266_D7
    #define  RT_HW_SPI0_SS    	RT_HW_ESP8266_D0	
//==================================================================================================
//										1.10. Доступные пины
//==================================================================================================  
    #define RT_HW_PERMIT_PIN_ALL 		12	
    #define RT_HW_PERMIT_PIN_DOT 		11	
    #define RT_HW_PERMIT_PIN_PWM		 8		
    #define RT_HW_PERMIT_PIN_DIN		10
    #define RT_HW_PERMIT_PIN_ADC		 1	
    #define RT_HW_PERMIT_PIN_INT		10	 
//---------------------------------------------------------------------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_ALL_ID[] ={RT_HW_ESP8266_D0, RT_HW_ESP8266_D1, RT_HW_ESP8266_D2, RT_HW_ESP8266_D3, 
												   RT_HW_ESP8266_D4, RT_HW_ESP8266_D5, RT_HW_ESP8266_D6, RT_HW_ESP8266_D7, 
												   RT_HW_ESP8266_D8, RT_HW_ESP8266_D9, RT_HW_ESP8266_D10,RT_HW_ESP8266_A0, RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DOT_ID[] ={RT_HW_ESP8266_D0, RT_HW_ESP8266_D1, RT_HW_ESP8266_D2, RT_HW_ESP8266_D3, 
												   RT_HW_ESP8266_D4, RT_HW_ESP8266_D5, RT_HW_ESP8266_D6, RT_HW_ESP8266_D7, 
												   RT_HW_ESP8266_D8, RT_HW_ESP8266_D9, RT_HW_ESP8266_D10,                  RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_PWM_ID[] ={                  RT_HW_ESP8266_D1, RT_HW_ESP8266_D2, RT_HW_ESP8266_D3, 
												   RT_HW_ESP8266_D4, RT_HW_ESP8266_D5, RT_HW_ESP8266_D6, RT_HW_ESP8266_D7, 
												   RT_HW_ESP8266_D8, RT_HW_ESP8266_D9, RT_HW_ESP8266_D10,                  RT_HW_PGM_END};		
	const uint8_t PROGMEM RT_HW_PGM_PIN_DIN_ID[] ={                  RT_HW_ESP8266_D1, RT_HW_ESP8266_D2, RT_HW_ESP8266_D3, 
												   RT_HW_ESP8266_D4, RT_HW_ESP8266_D5, RT_HW_ESP8266_D6, RT_HW_ESP8266_D7,
												   RT_HW_ESP8266_D8, RT_HW_ESP8266_D9, RT_HW_ESP8266_D10,                  RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_ADC_ID[] ={RT_HW_ESP8266_A0,											     		RT_HW_PGM_END};
//--------------------------------------------------------------------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_INT_ID[] ={                  RT_HW_ESP8266_D1, RT_HW_ESP8266_D2, RT_HW_ESP8266_D3, 
												   RT_HW_ESP8266_D4, RT_HW_ESP8266_D5, RT_HW_ESP8266_D6, RT_HW_ESP8266_D7, 
												   RT_HW_ESP8266_D8, RT_HW_ESP8266_D9, RT_HW_ESP8266_D10,                  RT_HW_PGM_END};
//-------------------------------------------------------------------------------------------------
//================================================================================================== 
#endif	
//================================================================================================== 

