//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										4.ESP8266
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================						
//									Контроллеры ESP8266 ANON
//=================================================================================================
#if !defined(RT_HW_BOARD_CODE) && defined(RT_HW_CORE_ESP8266)
    #define  RT_HW_BOARD_FCPU     80 											//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      3300											//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------                             
    #define  RT_HW_BOARD_CODE     48   											//--Идентификатор выбора платы c кодом платы;
    #define  RT_HW_BOARD_NAME     "ESP8266 ANON"								//--Наименование платы;
    #define  RT_HW_BOARD_MEMORY	  "FLASH=FS:(max)2Mb,OTA:(max)1019Kb; RAM=80Kb"	//--Параметры памяти;
    #define  RT_HW_BOARD_ESP8266_ANON  										//--Идентификатор типа платы;
//==================================================================================================
//										1. Ограничение ресурсов контроллеа
//==================================================================================================
	#define RT_HW_SPECIFIC_USING_1  "Download:: D3=1, D4=1, D8=0"
//==================================================================================================
//										2. Системные пины
//==================================================================================================
	#define  RT_HW_BOARD_PIN_CONTROL   RT_HW_ESP8266_D0			//--Контроль цикла loop();
	#define  RT_HW_BOARD_PIN_LED       RT_HW_ESP8266_D4			//--Led на плате;
	#define  RT_HW_BOARD_PIN_ADC       RT_HW_ESP8266_A0			//--ADC;	
	#define  RT_HW_BOARD_PIN_CS0       RT_HW_ESP8266_D5			//--SPI cs.0;	
//=================================================================================================
//										3. Пины cs тестовые
//=================================================================================================

//=================================================================================================
//										4. Пины тестовых устройств
//=================================================================================================
	#define  RT_HW_BOARD_PIN_DS1820    RT_HW_ESP8266_D3			//--Сенсор DS1820;
	#define  RT_HW_BOARD_PIN_SR04      RT_HW_ESP8266_D8			//--Сенсор HC-SR04;
//=================================================================================================
//										5. Номера тестовых UART
//=================================================================================================	
	#define  RT_HW_BOARD_UART_MODBUS_1  2				//--Номер UART для MODBUS 1;	
//=================================================================================================
//										10. Коммуникации
//=================================================================================================
//=================================================================================================
//										10.1. UART
//=================================================================================================
    #define  RT_HW_PERMIT_UART0					//--Разрешение работы с UART0; 
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART0_RX   RT_HW_ESP8266_RX
    #define  RT_HW_UART0_TX   RT_HW_ESP8266_TX	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UARTS_RX   RT_HW_ESP8266_D3
    #define  RT_HW_UARTS_TX   RT_HW_ESP8266_D4	
//=================================================================================================
//										10.2. i2c
//=================================================================================================
    #define  RT_HW_PERMIT_I2C0					//--Разрешение работы с i2c0; 
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C0_SCL   RT_HW_ESP8266_D1
    #define  RT_HW_I2C0_SDA   RT_HW_ESP8266_D2
//=================================================================================================
//										10.3. SPI
//=================================================================================================
    #define  RT_HW_PERMIT_SPI0					//--Разрешение работы с SPI0; 
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI0_SCK   RT_HW_ESP8266_D5
    #define  RT_HW_SPI0_MISO  RT_HW_ESP8266_D6
    #define  RT_HW_SPI0_MOSI  RT_HW_ESP8266_D7
    #define  RT_HW_SPI0_SS    RT_HW_ESP8266_D0	

//==================================================================================================
//									20. Доступные пины
//==================================================================================================    
    #define RT_HW_PERMIT_PIN_ALL 		12	
    #define RT_HW_PERMIT_PIN_DOT 		11	
    #define RT_HW_PERMIT_PIN_PWM		 8		
    #define RT_HW_PERMIT_PIN_DIN		10
    #define RT_HW_PERMIT_PIN_ADC		 1	
    #define RT_HW_PERMIT_PIN_INT		10	 
//---------------------------------------------------------------------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_ALL_ID[] ={RT_HW_ESP8266_D0, RT_HW_ESP8266_D1, RT_HW_ESP8266_D2, RT_HW_ESP8266_D3, 
												   RT_HW_ESP8266_D4, RT_HW_ESP8266_D5, RT_HW_ESP8266_D6, RT_HW_ESP8266_D7, 
												   RT_HW_ESP8266_D8, RT_HW_ESP8266_D9, RT_HW_ESP8266_D10,RT_HW_ESP8266_A0, RT_HW_PGM_END};

	const uint8_t PROGMEM RT_HW_PGM_PIN_DOT_ID[] ={RT_HW_ESP8266_D0, RT_HW_ESP8266_D1, RT_HW_ESP8266_D2, RT_HW_ESP8266_D3, 
												   RT_HW_ESP8266_D4, RT_HW_ESP8266_D5, RT_HW_ESP8266_D6, RT_HW_ESP8266_D7, 
												   RT_HW_ESP8266_D8, RT_HW_ESP8266_D9, RT_HW_ESP8266_D10,                  RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_PWM_ID[] ={                  RT_HW_ESP8266_D1, RT_HW_ESP8266_D2, RT_HW_ESP8266_D3, 
												   RT_HW_ESP8266_D4, RT_HW_ESP8266_D5, RT_HW_ESP8266_D6, RT_HW_ESP8266_D7, 
												   RT_HW_ESP8266_D8, RT_HW_ESP8266_D9, RT_HW_ESP8266_D10,                  RT_HW_PGM_END};		
	const uint8_t PROGMEM RT_HW_PGM_PIN_DIN_ID[] ={                  RT_HW_ESP8266_D1, RT_HW_ESP8266_D2, RT_HW_ESP8266_D3, 
												   RT_HW_ESP8266_D4, RT_HW_ESP8266_D5, RT_HW_ESP8266_D6, RT_HW_ESP8266_D7,
												   RT_HW_ESP8266_D8, RT_HW_ESP8266_D9, RT_HW_ESP8266_D10,                  RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_ADC_ID[] ={RT_HW_ESP8266_A0,											     	   RT_HW_PGM_END};
//--------------------------------------------------------------------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_INT_ID[] ={                  RT_HW_ESP8266_D1, RT_HW_ESP8266_D2, RT_HW_ESP8266_D3, 
												  RT_HW_ESP8266_D4, RT_HW_ESP8266_D5, RT_HW_ESP8266_D6, RT_HW_ESP8266_D7, 
												  RT_HW_ESP8266_D8, RT_HW_ESP8266_D9, RT_HW_ESP8266_D10,                   RT_HW_PGM_END};
//-------------------------------------------------------------------------------------------------
//================================================================================================== 
#endif	


