
#ifndef RT_HW_DIRECT_TASK_P_h
#define RT_HW_DIRECT_TASK_P_h
  #include "RT_HW_BASE.h"
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//										СТРУКТУРЫ УПРАВЛЕНИЯ ЗАДАЧАМИ
//-------------------------------------------------------------------------------------------------
//  Параметр выхода:
//  run	=0 нет запуска; 
//      =1 безусловный запуск; 
//     	=2 разрешение проверки условий внешней функции. После проверки и выполнения условий->run=5;
//-------------------------------------------------------------------------------------------------
//  Вход:
//  run-может устанавливаться внешней функцией в значение =5. Например при изменения параметров. 
//-------------------------------------------------------------------------------------------------
//  Режимы запуска без контроля периода:  
//	 'C'-запуск по внешним условиям(на вход поступает run=5) с ограничением вызова пропуском событий (qntPass);     
//   'Q'-запуск по внешним условиям(на вход поступает run=5). Для быстрых процессов и для тестирования;
//   'E'-запуск в каждом цикле. Можно запускать периодически  попереднему фронту EN;
//   'F'-однократное выполнение. Для повтора можно установить id.first=1;
//   'R'-запуск в каждом цикле (при EN=1)
//   'N'-запуск отключен;
//-------------------------------------------------------------------------------------------------
//  Режимы запуска c контролем периода:  
//   'P'-запуск периодический (period) с ограничением вызова пропуском событий (qntPass);
//   'T'-запуск по внешним условиям(на вход поступает run=5) с ограничением вызова пропуском событий (qntPass)	
//														     и ограничением вызова периодом  вызова  (period);
//	 'A'-запуск по внешним условиям(на вход поступает run=5) с ограничением вызова пропуском событий (qntPass)
//		 и/или периодическим запуском(period). 
//		 Если в период состоялся вызов, то контроль периода возобновляется с этого момента.   
//       Обычно используется с большим периодом для повышения устойчивости проекта; 		
//=================================================================================================
//							      1.	УПРАВЛЕНИЕ ЗАПУСКОМ БЕЗ КОНТРОЛЯ ПЕРИОДА
//=================================================================================================
//=================================================================================================
//							  	1.1.C:: Запуск по внешним изменениям параметров  с ограничением вызова пропуском событий (qntPass)
//=================================================================================================
  class RT_HW_DIRECT_TASK_C{
	public:
	uint8_t  agoEN=0;  							//--Обработка входа EN;  
	uint8_t  run=1;   							//--Флаг управления запуском;        
	uint8_t  qntPass=5;							//--Кол-во пропусков перед проверкой времени;
	uint8_t  cntPass=0;							//--Счетчик пропусков проверки изменений;
//-------------------------------------------------------------------------------------------------
	RT_HW_DIRECT_TASK_C()				 {;};
	RT_HW_DIRECT_TASK_C(uint8_t _qntPass){qntPass=_qntPass;};			
//-------------------------------------------------------------------------------------------------
	uint8_t direct(uint8_t extEN=1){
		if(run==5)		  	 {			  	cntPass=1; 	run=2; return run;}	//--Запуск по внешнему условию;
		if(!extEN)    	 	 {agoEN=0;					run=0; return run;}	//--Если extEN=0, выход без запуска;
		if(extEN && !agoEN)	 { agoEN=extEN; cntPass=1; 	run=1; return run;}	//--Запуск по переднему фронту EN;
		if(++cntPass>qntPass){				cntPass=1; 	run=2; return run;}	//--Пропуск по счетчику пропусков;				     
														run=0; return run;	//--Выход без запуска;
	};	
//-------------------------------------------------------------------------------------------------
	void  setQntPass(uint8_t _qntPass){qntPass=_qntPass;};
//-------------------------------------------------------------------------------------------------	
  }; 
//=================================================================================================
//							  	1.2.Q:: Запуск по внешним условиям (для быстрых процессов и для тестирования)
//=================================================================================================
  class RT_HW_DIRECT_TASK_Q{
	public:
	uint8_t  agoEN=0;  							//--Обработка входа EN;  
	uint8_t  run=1;   							//--Флаг управления запуском;        
//-------------------------------------------------------------------------------------------------
	RT_HW_DIRECT_TASK_Q()				 {;};			
//-------------------------------------------------------------------------------------------------
	uint8_t direct(uint8_t extEN=1){
		run=0;
		if(!extEN)    	{agoEN=extEN; run=0; return run;}
		if(agoEN!=extEN){agoEN=extEN; run=1; return run;}	//--Запуск по переднему фронту EN;
									  run=2; return run;	//--Запуск по внешним условиям;
	};	
//-------------------------------------------------------------------------------------------------	
  };
//=================================================================================================
//								1.3.E:: Запуск по фронту EN
//=================================================================================================
  class RT_HW_DIRECT_TASK_E{
	public:
	uint8_t  agoEN=255;  					//--Обработка входа EN;  
	uint8_t  run=1;   						//--Флаг управления запуском;        
//-------------------------------------------------------------------------------------------------
	RT_HW_DIRECT_TASK_E() {;};
//-------------------------------------------------------------------------------------------------		
	uint8_t direct(uint8_t extEN=1){
//		if(agoEN!=extEN) {agoEN=extEN; if(extEN) {run=1; return run;}}	//--Выделение переднего фронта;	
		if(!extEN)    	{agoEN=extEN; run=0; return run;}
		if(agoEN!=extEN){agoEN=extEN; run=1; return run;}	
									  run=0; return run;	
	};		
//-------------------------------------------------------------------------------------------------
  }; //--END class RT_HW_DIRECT_TASK_E;
//=================================================================================================
//								1.4.F:: Запуск одноразовый (при EN=1)
//=================================================================================================
  class RT_HW_DIRECT_TASK_F{
	public:
	uint8_t	agoEN=0;  						//--Обработка входа EN;  
	uint8_t	first=1;						//--Флаг разрешения однократного вызова;
	uint8_t  run=1;   						//--Флаг управления запуском;        
//-------------------------------------------------------------------------------------------------
	RT_HW_DIRECT_TASK_F() {;};
//-------------------------------------------------------------------------------------------------		
	uint8_t direct(uint8_t extEN=1){
		run=0;
		if((extEN) && (first))  {first=0; run=1;}	
		return run;	
	};
  }; //--END class RT_HW_DIRECT_TASK_F; 
//=================================================================================================
//								1.5.R:: Запуск в каждом цикле при EN=1
//=================================================================================================
  class RT_HW_DIRECT_TASK_R{
	public:
	uint8_t  run=0;   						//--Флаг управления запуском;        
//-------------------------------------------------------------------------------------------------
	RT_HW_DIRECT_TASK_R() {;};
//-------------------------------------------------------------------------------------------------		
	uint8_t direct(uint8_t extEN=1){run=extEN;	return run;};
  }; //--END class RT_HW_DIRECT_TASK_R; 
//=================================================================================================
//								1.6.N:: Запуск отключен
//=================================================================================================
  class RT_HW_DIRECT_TASK_N{
	public:
	uint8_t  run=0;   						//--Флаг управления запуском;        
//-------------------------------------------------------------------------------------------------
	RT_HW_DIRECT_TASK_N() {;};
//-------------------------------------------------------------------------------------------------
	uint8_t direct(uint8_t extEN=1){(void)extEN; run=0;	return run;};
  }; //--END class RT_HW_DIRECT_TASK_N; 

//=================================================================================================
//							      2.	УПРАВЛЕНИЕ ЗАПУСКОМ С ОГРАНИЧЕНИЕМ ПЕРИОДОМ ЗАПУСКА(period)
//================================================================================================= 
//=================================================================================================
//								2.1.P:: Запуск периодический с ограничением вызова пропуском событий (qntPass)
//=================================================================================================
  class RT_HW_DIRECT_TASK_P{
	public:
	uint8_t  agoEN=0;  						//--Обработка входа EN;  
	uint8_t  run=1;   						//--Флаг управления запуском;        
	uint8_t  qntPass=5;						//--Кол-во пропусков перед проверкой времени;
	uint8_t  cntPass=0;						//--Счетчик пропусков проверки изменений;
	uint16_t period=500;					//--Период вызова;
	uint32_t timeBegin;						//--Рабочий регистр для отсчета времени;
//-------------------------------------------------------------------------------------------------
	RT_HW_DIRECT_TASK_P() {;};
	RT_HW_DIRECT_TASK_P(uint16_t _period) {period=_period;};	//--Конструктор с установкой периода;	
	RT_HW_DIRECT_TASK_P(uint8_t  _qntPass){qntPass=_qntPass;};	//--Конструктор с установкой кол-ва пропусков;
	RT_HW_DIRECT_TASK_P(uint16_t _period, uint8_t  _qntPass) {period=_period; qntPass=_qntPass;};	//--Конструктор с установкой периода и кол-ва пропусков;	
//-------------------------------------------------------------------------------------------------		
	uint8_t direct(uint8_t extEN=1){
//		if(run==5)		  	 {				timeBegin=millis();	cntPass=1; 	run=1; return run;}	//--Запуск безусловный по внешнему условию;
		run=0;
		if(!extEN)    	 	 {agoEN=0;										run=0; return run;}	//--Если extEN=0, выход без запуска;
		if(extEN && !agoEN)	 {agoEN=extEN; 	timeBegin=millis(); cntPass=1; 	run=1; return run;}	//--Запуск по переднему фронту EN;
		if(++cntPass>qntPass){									cntPass=1; 						//--Фиксация по счетчику пропусков;				     
							  if(RT_HW_Base.getPastMs(timeBegin)>period){
											timeBegin=millis();				run=1; return run;}}//--Запуск безусловный по периоду; 
																			run=0; return run;	//--Выход без запуска;
	};	
//-------------------------------------------------------------------------------------------------
	uint8_t direct(uint16_t _period, uint8_t extEN)	{period=_period; return direct(extEN);};	
//	uint8_t direct(uint16_t _period)				{period=_period; return direct(1);};	
//-------------------------------------------------------------------------------------------------
		void  setQntPass(uint8_t _qntPass){qntPass=_qntPass;};		//--Установка кол-ва пропусков событий;
  }; //--END class RT_HW_DIRECT_TASK_P; 
 //=================================================================================================
//								2.1.PS:: Запуск периодический  в секундах с ограничением вызова пропуском событий (qntPass)
//=================================================================================================
  class RT_HW_DIRECT_TASK_PS{
	public:
	uint8_t  agoEN=0;  						//--Обработка входа EN;  
	uint8_t  run=1;   						//--Флаг управления запуском;        
	uint8_t  qntPass=5;						//--Кол-во пропусков перед проверкой времени;
	uint8_t  cntPass=0;						//--Счетчик пропусков проверки изменений;
	uint32_t period=60;						//--Период вызова ctr;
	uint32_t timeBegin;						//--Рабочий регистр для отсчета времени;
//-------------------------------------------------------------------------------------------------
	RT_HW_DIRECT_TASK_PS() {;};
	RT_HW_DIRECT_TASK_PS(uint32_t _period) {period=_period*1000;};	//--Конструктор с установкой периода;	
	RT_HW_DIRECT_TASK_PS(uint8_t  _qntPass){qntPass=_qntPass;};	//--Конструктор с установкой кол-ва пропусков;
	RT_HW_DIRECT_TASK_PS(uint32_t _period, uint8_t  _qntPass) {period=_period*1000; qntPass=_qntPass;};	//--Конструктор с установкой периода и кол-ва пропусков;	
//-------------------------------------------------------------------------------------------------		
	uint8_t direct(uint8_t extEN=1){
//		if(run==5)		  	 {				timeBegin=millis();	cntPass=1; 	run=1; return run;}	//--Запуск безусловный по внешнему условию;
		run=0;
		if(!extEN)    	 	 {agoEN=0;										run=0; return run;}	//--Если extEN=0, выход без запуска;
		if(extEN && !agoEN)	 {agoEN=extEN; 	timeBegin=millis(); cntPass=1; 	run=1; return run;}	//--Запуск по переднему фронту EN;
		if(++cntPass>qntPass){									cntPass=1; 						//--Фиксация по счетчику пропусков;				     
							  if(RT_HW_Base.getPastMs(timeBegin)>period){
											timeBegin=millis();				run=1; return run;}}//--Запуск безусловный по периоду; 
																			run=0; return run;	//--Выход без запуска;
	};	
//-------------------------------------------------------------------------------------------------
	uint8_t direct(uint32_t _period, uint8_t extEN)	{period=_period; return direct(extEN);};	
//	uint8_t direct(uint16_t _period)				{period=_period; return direct(1);};	
//-------------------------------------------------------------------------------------------------
		void  setQntPass(uint8_t _qntPass){qntPass=_qntPass;};		//--Установка кол-ва пропусков событий;
  }; //--END class RT_HW_DIRECT_TASK_P;  
  
  
//=================================================================================================
//							    2.2.T:: Запуск по внешним условиям с ограничением вызова пропуском событий (qntPass) и периодом  вызова  (period);
//=================================================================================================
  class RT_HW_DIRECT_TASK_T{
	public:
	uint8_t  agoEN=0;  							//--Обработка входа EN;  
	uint8_t  run=1;   							//--Флаг управления запуском;        
	uint8_t  qntPass=5;							//--Кол-во пропусков перед проверкой времени;
	uint8_t  cntPass=0;							//--Счетчик пропусков проверки изменений;
	uint16_t period=0;
	uint32_t timeBegin;
//-------------------------------------------------------------------------------------------------
	RT_HW_DIRECT_TASK_T()				 					{;};
	RT_HW_DIRECT_TASK_T(uint8_t  _qntPass)					{                qntPass=_qntPass;};
	RT_HW_DIRECT_TASK_T(uint16_t _period) 		    		{period=_period;                  };
	RT_HW_DIRECT_TASK_T(uint16_t _period, uint8_t _qntPass) {period=_period; qntPass=_qntPass;};	
//-------------------------------------------------------------------------------------------------
	uint8_t direct(uint8_t extEN=1){
		if(run==5)		  	 {				timeBegin=millis();	cntPass=1; 	run=2; return run;}	//--Запуск проверки изменению во внешней функции;
		run=0;
		if(!extEN)    	 	 {agoEN=0;										run=0; return run;}	//--Если extEN=0, выход без запуска;
		if(extEN && !agoEN)	 {agoEN=extEN; 						cntPass=1; 	run=1; return run;}	//--Запуск по переднему фронту EN;
		if(++cntPass>qntPass){									cntPass=1; 						//--Фиксация по счетчику пропусков;				     
							  if(RT_HW_Base.getPastMs(timeBegin)>period){timeBegin=millis(); run=2;}//--Запуск безусловный по времени;
																				   return run;}
//-------------------------------------------------------------------------------------------------																						
																			run=0; return run;	//--Выход без запуска;											
	};	
//-------------------------------------------------------------------------------------------------
	uint8_t direct(uint16_t _period, uint8_t extEN){period=_period; return direct(extEN);};
//-------------------------------------------------------------------------------------------------
	void  setQntPass(uint8_t _qntPass){qntPass=_qntPass;};
	void  setPriod  (uint8_t _period) {period =_period;};
//-------------------------------------------------------------------------------------------------	
  }; 
//=================================================================================================
//							    2.3.A:: Запуск по внешним условиям с ограничением вызова пропуском событий (qntPass) или по периоду  вызова  (period);
//=================================================================================================
  class RT_HW_DIRECT_TASK_A{
	public:
	uint8_t  agoEN=0;  							//--Обработка входа EN;  
	uint8_t  run=1;   							//--Флаг управления запуском;        
	uint8_t  qntPass=5;							//--Кол-во пропусков перед проверкой времени;
	uint8_t  cntPass=0;							//--Счетчик пропусков проверки изменений;
	uint16_t period=0;
	uint32_t timeBegin;
//-------------------------------------------------------------------------------------------------
	RT_HW_DIRECT_TASK_A()				 					{;};
	RT_HW_DIRECT_TASK_A(uint8_t  _qntPass)					{                qntPass=_qntPass;};
	RT_HW_DIRECT_TASK_A(uint16_t _period) 		    		{period=_period;                  };
	RT_HW_DIRECT_TASK_A(uint16_t _period, uint8_t _qntPass) {period=_period; qntPass=_qntPass;};	
//-------------------------------------------------------------------------------------------------
	uint8_t direct(uint8_t extEN=1){
		if(run==5)		  	 {				timeBegin=millis();	cntPass=1; 	run=2; return run;}	//--Запуск проверки изменению во внешней функции;
		run=0;
		if(!extEN)    	 	 {agoEN=0;										run=0; return run;}	//--Если extEN=0, выход без запуска;
		if(extEN && !agoEN)	 {agoEN=extEN; 						cntPass=1; 	run=1; return run;}	//--Запуск по переднему фронту EN;
		if(++cntPass>qntPass){									cntPass=1; 	run=2;				//--Фиксация по счетчику пропусков и условие проверки изменениям;
		     if(RT_HW_Base.getPastMs(timeBegin)>period){timeBegin=millis(); run=1;}				//--Безусловный периодический запуск;
																				   return run;}	
//------------------------------------------------------------------------------------------------
																			run=0; return run;	//--Выход без запуска;		
	};	
//-------------------------------------------------------------------------------------------------	
	uint8_t direct(uint16_t _period, uint8_t extEN){period=_period; return direct(extEN);};	
//-------------------------------------------------------------------------------------------------
	void  setQntPass(uint8_t _qntPass){qntPass=_qntPass;};
	void  setPriod  (uint8_t _period) {period =_period;};
//-------------------------------------------------------------------------------------------------	
  }; 
//=================================================================================================
#endif
