//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//							1.Контроллер ESP32C3 TTGO
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if	!defined(RT_HW_BOARD_CODE) && defined(RT_HW_CORE_ESP32) && defined(ARDUINO_ESP32C3_TTGO_T_OI_PLUS_EIS)
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_BOARD_CODE     (uint8_t)54 				//--Идентификатор выбора платы;
	#define  RT_HW_CORE_ESP32C3								//--Дополнительный идентификатор для ESP32C3;
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_BOARD_NAME  	 "ESP32C3 TTGO-T-OI-PLUS EIS"		//--Наименование платы;	
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_BOARD_MEMORY   "FLASH=4/32Mb; SRAM=400Kb; ROM=384Kb; RTC SRAM=8Kb;"//--Параметры памяти;
	#define  RT_HW_BOARD_FCPU     (uint16_t)160				//--Частота процессора;	
	#define  RT_HW_BOARD_VCC   	  3300						//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_BOARD_ESP32C3_TTGO_T_OI_PLUS_EIS 		//--Идентификатор типа платы;
//=================================================================================================
//								1.1. Ограничение ресурсов контроллера
//=================================================================================================
	#define RT_HW_SPECIFIC_USING_1  "Download:: D3=1"
//=================================================================================================
//								1.2. Системные пины
//=================================================================================================
	#define  RT_HW_BOARD_PIN_ADC       		2		//--ADC;	
	#define  RT_HW_BOARD_PIN_CS0        	7		//--SPI cs.0;
	#define  RT_HW_BOARD_PIN_CS1        	10		//--SPI cs.0;
	#define  RT_HW_BOARD_PIN_CS2        	11		//--SPI cs.1;		
//==================================================================================================
//								1.3. Тестовые устройства
//==================================================================================================
	#define  RT_HW_BOARD_PIN_DS1820    		10		//--Сенсор DS1820;33, 14,13,
//=================================================================================================
//								1.4. Тестовые UART
//=================================================================================================		
	#define  RT_HW_BOARD_UART_CONSOLE   	0		//--Консоль через UART;	
	#define  RT_HW_BOARD_UART_MODBUS1  		1		//--Номер UART для MODBUS 1;
	#define  RT_HW_BOARD_UART_HMI  	   		0		//--Номер UART для HMI 1;
//==================================================================================================
//								1.5. Коммуникации
//==================================================================================================
// 	#define  RT_HW_PERMIT_USB						//--Разрешение работы с USB;
	#define  RT_HW_PERMIT_UART0						//--Разрешение работы с UART0;
    #define  RT_HW_PERMIT_UART1						//--Разрешение работы с UART1;			
    #define  RT_HW_PERMIT_I2C0						//--Разрешение работы с i2c0; 
    #define  RT_HW_PERMIT_SPI0						//--Разрешение работы с SPI0; 
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART0_RX   				20
    #define  RT_HW_UART0_TX   				21	
    #define  RT_HW_UART1_RX   				 0
    #define  RT_HW_UART1_TX   				 1	 
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C0_SCL  				18	
    #define  RT_HW_I2C0_SDA  				19
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI0_SCK  				 4
    #define  RT_HW_SPI0_MISO 				 5
    #define  RT_HW_SPI0_MOSI 				 6
    #define  RT_HW_SPI0_SS    				 7	
//=================================================================================================
//										1.10. Доступные пины
//=================================================================================================  
    #define RT_HW_PERMIT_PIN_ALL 	(uint8_t)21	
    #define RT_HW_PERMIT_PIN_DOT 	(uint8_t)21	
    #define RT_HW_PERMIT_PIN_PWM	(uint8_t)21	   
    #define RT_HW_PERMIT_PIN_DIN	(uint8_t)21
    #define RT_HW_PERMIT_PIN_ADC	(uint8_t)6				
    #define RT_HW_PERMIT_PIN_INT	(uint8_t)21 
    #define RT_HW_PERMIT_PIN_N5V	(uint8_t)21 
//--------------------------------Доступные пины контроллера---------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_ALL_ID[] ={ 0, 1, 2, 3, 4, 5, 6, 7, 8,9,10,12,14,15,16,17,18,19,20,21, RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_DIN_ID[] ={ 0, 1, 2, 3, 4, 5, 6, 7, 8,9,10,12,14,15,16,17,18,19,20,21, RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_ADC_ID[] ={ 0, 1, 2, 3, 4, 5, 	  		  			          		   RT_HW_PGM_END};	
	const uint8_t PROGMEM RT_HW_PGM_PIN_DOT_ID[] ={ 0, 1, 2, 3, 4, 5, 6, 7, 8,9,10,12,14,15,16,17,18,19,20,21, RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_PWM_ID[] ={ 0, 1, 2, 3, 4, 5, 6, 7, 8,9,10,12,14,15,16,17,18,19,20,21, RT_HW_PGM_END};
	const uint8_t PROGMEM RT_HW_PGM_PIN_INT_ID[] ={ 0, 1, 2, 3, 4, 5, 6, 7, 8,9,10,12,14,15,16,17,18,19,20,21, RT_HW_PGM_END};	
	const uint8_t PROGMEM RT_HW_PGM_PIN_N5V_ID[] ={ 0, 1, 2, 3, 4, 5, 6, 7, 8,9,10,12,14,15,16,17,18,19,20,21, RT_HW_PGM_END};
//-------------------------------------------------------------------------------------------------
#endif
//=================================================================================================

