//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//							 			ARDUINO UNO
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(RT_HW_CORE_AVR) && defined(ARDUINO_AVR_UNO) 		 					  
    #define  RT_HW_BOARD_CODE     (uint8_t)1   						//--Идентификатор выбора платы c кодом платы;
    #define  RT_HW_BOARD_NAME     "Arduino UNO(ATmega328)"			//--Наименование платы;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_MEMORY	  "FLASH=32kB,RAM=2Kb,EEPROM=1Kb"	//--Параметры памяти;
    #define  RT_HW_BOARD_FCPU     (uint16_t)16 		//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      (uint16_t)5000	//--Значение Vсс процессора;
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_AVR_UNO  					//--Идентификатор типа платы;
//=================================================================================================
//										1. Ограничение ресурсов контроллера
//=================================================================================================
    #define  RT_HW_BOARD_COMPACT					//--Разрешение оптимизации используемых ресурсов;
	#define  RT_HW_BOARD_BLOCK_ETH					//--Идентификатор запрета работы с Ethernet;
//=================================================================================================
//										2. Системные пины
//=================================================================================================
	#define  RT_HW_BOARD_PIN_CONTROL   		17		//--Контроль цикла loop();
	#define  RT_HW_BOARD_PIN_LED       		13		//--Led на плате;
	#define  RT_HW_BOARD_PIN_BUTTON     	8		//--Кнопка на плате;
	#define  RT_HW_BOARD_PIN_ADC       		20		//--ADC;
	#define  RT_HW_BOARD_PIN_PWM        	6		//--PWM;	
	#define  RT_HW_BOARD_PIN_CS0       		14		//--SPI cs.0;
	#define  RT_HW_BOARD_PIN_CS1       		15		//--SPI cs.1;	
	#define  RT_HW_BOARD_PIN_CS2       		16		//--SPI cs.2;
	#define  RT_HW_BOARD_PIN_CS3       		17		//--SPI cs.3;		
//=================================================================================================
//										3. Пины тестовых устройств
//=================================================================================================
	#define  RT_HW_BOARD_PIN_DS1820     	4		//--Сенсор DS1820;
	#define  RT_HW_BOARD_PIN_DHT22      	5		//--Сенсор DHT22;		
	#define  RT_HW_BOARD_PIN_SR04       	2		//--Сенсор HC-SR04;
	#define  RT_HW_BOARD_PIN_NST1001		3		//--Сенсор NST1001;	
	#define  RT_HW_BOARD_PIN_TEST       	7		//--Пин тестовый;	
	#define  RT_HW_BOARD_PIN_SERVO0     	9		//--Серво-двигатель;
	#define  RT_HW_BOARD_PIN_SERVO1    		10		//--Серво-двигатель 1;		
//=================================================================================================
//										5. Номера тестовых UART
//=================================================================================================	
	#define  RT_HW_BOARD_UART_CONSOLE   	0		//--Консоль через UART;
	#define  RT_HW_BOARD_UART_MODBUS1  		0		//--Номер UART для MODBUS 1;
//=================================================================================================
//										10. UART:: пины и параметры 
//=================================================================================================
    #define  RT_HW_PERMIT_UART0						//--Разрешение работы с UART0;
    #define  RT_HW_PERMIT_UART100					//--Разрешение работы с UART100 (SoftwareSerial);	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART0_RX   				0
    #define  RT_HW_UART0_TX   				1	
//------------------------------------------------------------------------------------------------
    #define  RT_HW_UART100_RX  				7
    #define  RT_HW_UART100_TX   			8	
//=================================================================================================
//										11. I2C:: пины и параметры 
//=================================================================================================
    #define  RT_HW_PERMIT_I2C0						//--Разрешение работы с i2c0;	
 //-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C0_SCL  				19	
    #define  RT_HW_I2C0_SDA  				18
//=================================================================================================
//										12. SPI::  пины и параметры
//=================================================================================================
	#define  RT_HW_PERMIT_SPI0						//--Разрешение работы с SPI0;  	
 //------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI0_SCK  				13
    #define  RT_HW_SPI0_MISO 				12
    #define  RT_HW_SPI0_MOSI 				11
    #define  RT_HW_SPI0_SS   				10	
//-------------------------------------------------------------------------------------------------
//	#define  RT_HW_SPI0_CS_ETH0   			255	
//	#define  RT_HW_SPI0_CS_ETH1   			255		
//=================================================================================================
//										13. SPN:: пины и параметры
//=================================================================================================
 #define  RT_HW_PERMIT_SPN0							//--Разрешение работы с SPI0;  
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPN0_SCK  				13
    #define  RT_HW_SPN0_MISO 				12
    #define  RT_HW_SPN0_MOSI 				11
    #define  RT_HW_SPN0_CS0   				10	
//=================================================================================================
//										20. Доступные пины
//=================================================================================================  
    #define RT_HW_PERMIT_PIN_ALL 	(uint8_t)20	
    #define RT_HW_PERMIT_PIN_DOT 	(uint8_t)20	
    #define RT_HW_PERMIT_PIN_PWM	(uint8_t)6	   
    #define RT_HW_PERMIT_PIN_DIN	(uint8_t)20
    #define RT_HW_PERMIT_PIN_ADC	(uint8_t)6		
    #define RT_HW_PERMIT_PIN_SRV	(uint8_t)2			
    #define RT_HW_PERMIT_PIN_INT	(uint8_t)2 
//-------------------------------------------------------------------------------------------------
    const uint8_t PROGMEM RT_HW_PGM_PIN_ALL_ID[]	={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,      RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PIN_DOT_ID[]	={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,      RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PIN_PWM_ID[]	={ 3, 5, 6, 9,10,11,												RT_HW_PGM_END};  
    const uint8_t PROGMEM RT_HW_PGM_PIN_DIN_ID[]	={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,      RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PIN_ADC_ID[]	={14,15,16,17,18,19,												RT_HW_PGM_END};		
    const uint8_t PROGMEM RT_HW_PGM_PIN_SRV_ID[]	={ 9,10,															RT_HW_PGM_END};	    
//-------------------------------------------------------------------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_INT_ID[]	={ 2, 3,															RT_HW_PGM_END};		
//================================================================================================= 
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
