//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//							 	1. Контроллер Arduino MEGA2560
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_BOARD_CODE) && defined(RT_HW_CORE_AVR)  && defined(ARDUINO_AVR_MEGA2560)
    #define  RT_HW_BOARD_CODE     5 									//--Идентификатор выбора платы;
    #define  RT_HW_BOARD_NAME  	  "Mega2560"     						//--Наименование платы;
//--------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_MEMORY	  "FLASH=256Kb,RAM=8Kb,EEPROM=4Kb;"		//--Параметры памяти;
    #define  RT_HW_BOARD_FCPU     16 									//--Частота процессора;	
    #define  RT_HW_BOARD_VCC      5000									//--Значение Vсс процессора;
//-----Корректировка для PROGMEM для RAM>64kB;----------------------------------------------------	
    #ifdef  PROGMEM											
    #undef  PROGMEM													
    #endif													
    #define PROGMEM __attribute__(( section(".progmem.data") ))
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_BOARD_AVR_MEGA2560  									//--Идентификатор типа платы;
//==================================================================================================
//											1. Ограничение ресурсов контроллера
//==================================================================================================


//==================================================================================================
//											2. Системные пины
//==================================================================================================
	#define  RT_HW_BOARD_PIN_CONTROL   		42		//--Контроль цикла loop();
	#define  RT_HW_BOARD_PIN_BUTTON     	7		//--Кнопка на плате;
	#define  RT_HW_BOARD_PIN_ADC       		54		//--ADC;
	#define  RT_HW_BOARD_PIN_PWM        	6		//--PWM;	
	#define  RT_HW_BOARD_PIN_CS0       		46		//--SPI cs.0;
	#define  RT_HW_BOARD_PIN_CS1       		47		//--SPI cs.1;	
	#define  RT_HW_BOARD_PIN_CS2       		48		//--SPI cs.2;
	#define  RT_HW_BOARD_PIN_CS3       		49		//--SPI cs.3;	
//==================================================================================================
//											3. Тестовые устройства
//==================================================================================================
	#define  RT_HW_BOARD_PIN_DS1820     	4		//--Сенсор DS1820;
	#define  RT_HW_BOARD_PIN_DHT22      	5		//--Сенсор DHT22;		
	#define  RT_HW_BOARD_PIN_SR04       	2		//--Сенсор HC-SR04;
	#define  RT_HW_BOARD_PIN_NST1001		3		//--Сенсор NST1001;	
	#define  RT_HW_BOARD_PIN_TEST       	43		//--Пин тестовый;	
	#define  RT_HW_BOARD_PIN_SERVO0     	44		//--Серво-двигатель;
	#define  RT_HW_BOARD_PIN_SERVO1    		45		//--Серво-двигатель 1;	
//=================================================================================================
//											4. Тестовые UART
//=================================================================================================	
	#define  RT_HW_BOARD_UART_CONSOLE   	0		//--Консоль через UART;
 	#define  RT_HW_BOARD_UART_MODBUS1   	1		//--Номер UART для MODBUS 1;
	#define  RT_HW_BOARD_UART_MODBUS2   	2		//--Номер UART для MODBUS 2;
	#define  RT_HW_BOARD_UART_HMI1			3		//--Номер UART для панели HMI;	
//==================================================================================================
//								1.5. Коммуникации
//==================================================================================================
    #define  RT_HW_PERMIT_UART0						//--Разрешение работы с UART0; 
    #define  RT_HW_PERMIT_UART1						//--Разрешение работы с UART1; 
    #define  RT_HW_PERMIT_UART2						//--Разрешение работы с UART2; 
    #define  RT_HW_PERMIT_UART3						//--Разрешение работы с UART3; 	
    #define  RT_HW_PERMIT_UART100					//--Разрешение работы с UART100; 	
    #define  RT_HW_PERMIT_I2C0						//--Разрешение работы с i2c0; 
    #define  RT_HW_PERMIT_SPI0						//--Разрешение работы с SPI0; 
    #define  RT_HW_PERMIT_SPN0						//--Разрешение работы с SPN; 	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART0_RX   				0
    #define  RT_HW_UART0_TX   				1	
    #define  RT_HW_UART1_RX  				19
    #define  RT_HW_UART1_TX  				18	
    #define  RT_HW_UART2_RX  				17
    #define  RT_HW_UART2_TX  				16	
    #define  RT_HW_UART3_RX  				15
    #define  RT_HW_UART3_TX  				14	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_UART100_RX  				68
    #define  RT_HW_UART100_TX  				69	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_I2C0_SCL  				21	
    #define  RT_HW_I2C0_SDA  				20
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPI0_SCK  				52
    #define  RT_HW_SPI0_MISO 				50
    #define  RT_HW_SPI0_MOSI 				51
    #define  RT_HW_SPI0_SS   				53	
//-------------------------------------------------------------------------------------------------
    #define  RT_HW_SPN0_SCK   				34
    #define  RT_HW_SPN0_MISO  				35
    #define  RT_HW_SPN0_MOSI  				36
    #define  RT_HW_SPN0_CS0    				37
    #define  RT_HW_SPN0_CS1    				38	
    #define  RT_HW_SPN0_OE    				39		
//==================================================================================================
//								1.10. Доступные пины
//==================================================================================================  
    #define RT_HW_PERMIT_PIN_ALL 	(uint8_t)70	 	//--Доступные пины;
    #define RT_HW_PERMIT_PIN_DOT 	(uint8_t)70		//--Дискретный выход;	
    #define RT_HW_PERMIT_PIN_PWM	(uint8_t)15		//--PWM;   
    #define RT_HW_PERMIT_PIN_DIN	(uint8_t)70		//--Дискретные входы;
    #define RT_HW_PERMIT_PIN_ADC	(uint8_t)16		//--Аналоговые входы;
    #define RT_HW_PERMIT_PIN_SRV	(uint8_t)2		//--Серво дивгатели;
    #define RT_HW_PERMIT_PIN_INT	(uint8_t)6		//--Пины прерывания;
//---------------------------------------------------------------------------------------------------
    const uint8_t PROGMEM RT_HW_PGM_PIN_ALL_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,
												  24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,
												  48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,      	RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PIN_DOT_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,
												  24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,
												  48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,      	RT_HW_PGM_END};	
    const uint8_t PROGMEM RT_HW_PGM_PIN_PWM_ID[]={ 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,44,45,46,	                       		RT_HW_PGM_END}; 
    const uint8_t PROGMEM RT_HW_PGM_PIN_DIN_ID[]={ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,
												  24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,
												  48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69, 		RT_HW_PGM_END}; 
    const uint8_t PROGMEM RT_HW_PGM_PIN_ADC_ID[]={54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,	                   		RT_HW_PGM_END}; 
    const uint8_t PROGMEM RT_HW_PGM_PIN_SRV_ID[]={ 9,10,																	RT_HW_PGM_END};	    
//-------------------------------------------------------------------------------------------------
	const uint8_t PROGMEM RT_HW_PGM_PIN_INT_ID[]={ 2, 3,18,19,20,21,				                                   		RT_HW_PGM_END};	
//-------------------------------------------------------------------------------------------------	
//=================================================================================================
//    RT_HW_STRUCT_SPN_DEV 		RT_HW_spnDevID;


#endif								
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++