//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//							 			PLC FLE4
//	 
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//=================================================================================================

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++					
//									 	PLC FLE4F_32_1 
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#if !defined(RT_HW_PLC_CODE) &&  defined(FLP_BOARD_PLC_FLE4F_32_1)
	#define  RT_HW_PLC_STM32F407VEx 							//--Идентификатор для привязки к базовому MCU;   
	#define  RT_HW_PLC_CODE             (uint16_t)3241			//--Код;	
    #define  RT_HW_PLC_NAME			"FLProg PLC FLE4F-32-1"		//--Наименование;
	#define  RT_HW_PLC_FLE4F_XX 								//--Группа;	
	#define  RT_HW_PLC_FLE4F_32 								//--Идентификатор PLC;
	#define  RT_HW_PLC_MODE8		 							//--Восьмеричный формат (Y00-Y07,Y10-Y17 и т.д.);
//-------------------------------------------------------------------------------------------------
	#define  RT_HW_PLC_UART_CONSOLE   		1			//--Консоль через USB;
	#define  RT_HW_PLC_UART_MODBUS1   		4			//--Номер UART для MODBUS 1;
	#define  RT_HW_PLC_UART_MODBUS2   		5			//--Номер UART для MODBUS 2;
	#define  RT_HW_PLC_UART_HMI1			1			//--Номер UART для панели HMI 1;
//-------------------------------------------------------------------------------------------------
    #define RT_HW_PERMIT_PLC_DOT 	(uint8_t)16			//--Доступные пины DOT;
    #define RT_HW_PERMIT_PLC_DIN	(uint8_t)16			//--Доступные пины DIN;
    #define RT_HW_PERMIT_PLC_ADC	(uint8_t)2			//--Доступные пины ADC; 
    #define RT_HW_PERMIT_PLC_DAC	(uint8_t)2			//--Доступные пины DAC; 	 
//-------------------------------------------------------------------------------------------------
    #define RT_HW_PERMIT_PLC_DOX 	(uint8_t)1			//--Доступные пины DOX;
    #define RT_HW_PERMIT_PLC_DIX	(uint8_t)2			//--Доступные пины DIX;
////-------------------------------------------------------------------------------------------------------------------------------------------------------------
//                                                  00   01   02   03   04   05   06   07   08   09   10   11   12   13   14   15   16   17   18   20
//-------------------------------------------------------------------------------------------------------------------------------------------------------------
    const uint8_t PROGMEM RT_HW_PGM_PLC_DOT_ID[]={PA6, PC6, PC7, PA8, PB7, PB8, PB9, PE0, 255, 255,PE12,PE11,PE10, PE9, PE8, PE7, PC5, PC4,  RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PLC_DIN_ID[]={PA0, PA1, PA12,PA11,PC9, PC8, PD15,PD14,255, 255,PD12,PD11,PD10, PD9,	PD8, PB15,PE15,PE14, RT_HW_PGM_END};	
    const uint8_t PROGMEM RT_HW_PGM_PLC_ADC_ID[]={PA2, PA3, 																				 RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PLC_DAC_ID[]={PA4, PA5,																					 RT_HW_PGM_END};	
//-------------------------------------------------------------------------------------------------------------------------------------------------------------
    const uint8_t PROGMEM RT_HW_PGM_PLC_DOX_ID[]={PB11,PB10,    																			 RT_HW_PGM_END}; 	//--YRUN,YERR;
    const uint8_t PROGMEM RT_HW_PGM_PLC_DIX_ID[]={PE6, PD13,PE13,PB1, PB0, PA7, PC3, PC2, 255, 255, PC1, PC0, PC13, PE5,					 RT_HW_PGM_END};//--XSwitch, XVCC, XSW01-XSW10;	
#endif
//=================================================================================================
