//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//							 			PLC MEGA-2560
//	 
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================						
//									 	1. AVR PLC MEGA_10xx 
//=================================================================================================
#if !defined(RT_HW_PLC_CODE) &&  defined(RT_HW_CORE_AVR) && defined(RT_HW_AVR_PLC_MEGA_16xx)
    #define  RT_HW_PLC_CODE           	112
    #define  RT_HW_PLC_NAME				"MEGA2560-16xx"		//--Идентификатор PLC
	#define  RT_HW_PLC_MEGA_XX 									//--Группа;	
	#define  RT_HW_PLC_MEGA_16Mx 								//--Идентификатор PLC;	
//-------------------------------------------------------------------------------------------------   
	#define  RT_HW_PLC_UART_CONSOLE   		0			//--Консоль через UART 0;
	#define  RT_HW_PLC_UART_MODBUS1   		1			//--Номер UART для MODBUS 1;
	#define  RT_HW_PLC_UART_MODBUS2   		2			//--Номер UART для MODBUS 2;
	#define  RT_HW_PLC_UART_HMI1			3			//--Номер UART для панели HMI 1;
//-------------------------------------------------------------------------------------------------
    #define RT_HW_PERMIT_PLC_DOT 	(uint8_t)8			//--Доступные пины DOT;
    #define RT_HW_PERMIT_PLC_DIN	(uint8_t)13			//--Доступные пины DIN;
    #define RT_HW_PERMIT_PLC_ADC	(uint8_t)4			//--Доступные пины ADC; 	
    #define RT_HW_PERMIT_PLC_PWM	(uint8_t)2			//--Доступные пины PWM; 
//-------------------------------------------------------------------------------------------------
    #define RT_HW_PERMIT_PLC_DOX 	(uint8_t)1			//--Доступные пины DOX;
//-------------------------------------------------------------------------------------------------------------------------------------------------------------
//                                                X00  X01  X02  X03  X04  X05  X06  X07  X08  X09  X10  X11  X12  X13  X14  X15  X16  X17
//-------------------------------------------------------------------------------------------------------------------------------------------------------------
    const uint8_t PROGMEM RT_HW_PGM_PLC_DOT_ID[]={ 22,  23,  24,  25,  26,  27,  28, 29,   			 										RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PLC_DIN_ID[]={ 30,  31,  32,  33,  34,  35,  36, 37,  38,  39,  40,  41,								RT_HW_PGM_END};	
    const uint8_t PROGMEM RT_HW_PGM_PLC_ADC_ID[]={ 54,  55,  56,  57,																		RT_HW_PGM_END};
    const uint8_t PROGMEM RT_HW_PGM_PLC_PWM_ID[]={  9,  10,   																				RT_HW_PGM_END};
//-------------------------------------------------------------------------------------------------------------------------------------------------------------
    const uint8_t PROGMEM RT_HW_PGM_PLC_DOX_ID[]={13,    		RT_HW_PGM_END}; 	//--YRUN;	
#endif
//=================================================================================================						
