//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//						Предложения по изменениям FLProg.
//								00.02.2025г.
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//--1--------------------------------------------------------------------------
	По контроллеру PLC FLE-24MT_D:
	1.1. Сделать доступ к LedRUN  через функции RT_HW_Base.PLC_getPinDOX(0) с обозначением LedRUN; LedRUN;
	1.2. Сделать доступ к Switch,Vcc через функции PLC_getPinDIX(0),PLC_getPinDIX(1);
	1.3. Сделать доступ к Ust1,Ust2 через функции  PLC_getPinADX(0),PLC_getPinADX(1);



//--1--------------------------------------------------------------------------
	По контроллеру PLC STM407-20_D:
	1.1. Изменить название на PLC FLE4-24.1
	1.2. Сделать доступ к выходам через функции RT_HW_Base.PLC_getPinDOT(idx) с обозначением Yxx. (Y00-Y11);
	1.3. Сделать доступ к входам  через функции RT_HW_Base.PLC_getPinDIN(idx) с обозначением Xxx; (X00-X11);
	1.4. Сделать доступ к LedRUN  через функции RT_HW_Base.PLC_getPinDOX(0) с обозначением LedRUN; LedRUN;

//--2--------------------------------------------------------------------------
	По контроллеру PLC STM407-30_D:
	1.1. Изменить название на PLC FLE4-20.1
	1.2. Сделать доступ к выходам через функции RT_HW_Base.PLC_getPinDOT(idx) с обозначением Yxx. (Y00-Y07);
	1.3. Сделать доступ к входам  через функции RT_HW_Base.PLC_getPinDIN(idx) с обозначением Xxx; (X00-X11);
	1.4. Сделать доступ к LedRUN  через функции RT_HW_Base.PLC_getPinDOX(0) с обозначением LedRUN; LedRUN;
	
//--3--------------------------------------------------------------------------
	По контроллеру PLC FLE4S-32.1:
	1.1. Добавить в FLProg - в Arduino есть. Ожидаем поступление 2-х контроллеров (один исследовали и сожгли).
	1.2. Сделать доступ к выходам через функции RT_HW_Base.PLC_getPinDOT(idx) с обозначением Yxx. (Y00-Y07, Y10-Y17);
	1.3. Сделать доступ к входам  через функции RT_HW_Base.PLC_getPinDIN(idx) с обозначением Xxx; (X00-X07, Y10-Y17);
	1.4. Сделать доступ к LedRUN  через функции RT_HW_Base.PLC_getPinDOX(0) с обозначением LedRUN; LedRUN;		
	
//--4--------------------------------------------------------------------------
	По контроллеру PLC FLE4SD-32.1:
	1.1. Добавить в FLProg - в Arduino есть. Ожидаем поступление 2-х контроллеров (один исследовали и сожгли).
	1.2. Сделать доступ к выходам через функции RT_HW_Base.PLC_getPinDOT(idx) с обозначением Yxx. (Y00-Y11);
	1.3. Сделать доступ к входам  через функции RT_HW_Base.PLC_getPinDIN(idx) с обозначением Xxx; (X00-X11);
	1.4. Сделать доступ к входам  через функции RT_HW_Base.PLC_getPinADC(idx) с обозначением ADx; (AD0-AD1);
	1.5. Сделать доступ к входам  через функции RT_HW_Base.PLC_getPinDAC(idx) с обозначением DAx; (DA0-DA1);
	1.6. Сделать доступ к LedRUN  через функции RT_HW_Base.PLC_getPinDOX(0) с обозначением LedRUN; LedRUN;

//--5--------------------------------------------------------------------------
	По контроллеру PLC FLE4SD-40.1:
	1.1. Добавить в FLProg - в Arduino есть. Есть один, не исследовали.
	1.2. Сделать доступ к выходам через функции RT_HW_Base.PLC_getPinDOT(idx) с обозначением Yxx. (Y00-Y19);
	1.3. Сделать доступ к входам  через функции RT_HW_Base.PLC_getPinDIN(idx) с обозначением Xxx; (X00-X19);
	1.4. Сделать доступ к входам  через функции RT_HW_Base.PLC_getPinADC(idx) с обозначением ADx; (AD0-AD1);
	1.5. Сделать доступ к входам  через функции RT_HW_Base.PLC_getPinDAC(idx) с обозначением DAx; (DA0-DA1);
	1.6. Сделать доступ к LedRUN  через функции RT_HW_Base.PLC_getPinDOX(0) с обозначением LedRUN; LedRUN;	
	
//--6--------------------------------------------------------------------------
	По контроллеру PLC FLE4SG-24.1:  Lichuan!!! Их много на складе.
	1.1. Добавить в FLProg - в Arduino есть. Есть один, не исследовали.
	1.2. Сделать доступ к выходам через функции RT_HW_Base.PLC_getPinDOT(idx) с обозначением Yxx. (Y00-Y07);
	1.3. Сделать доступ к входам  через функции RT_HW_Base.PLC_getPinDIN(idx) с обозначением Xxx; (X00-X07, Y10-Y17)
	1.6. Сделать доступ к LedRUN  через функции RT_HW_Base.PLC_getPinDOX(0) с обозначением LedRUN; LedRUN;		
	1.7. Сделать доступ к LedERR  через функции RT_HW_Base.PLC_getPinDOX(1) с обозначением LedERR; LedERR;
	1.8. Сделать доступ к D2      через функции RT_HW_Base.PLC_getPinDOX(2) с обозначением D2;
	1.9. Сделать доступ к D3      через функции RT_HW_Base.PLC_getPinDOX(3) с обозначением D3;	
	
//--7--------------------------------------------------------------------------
	По контроллеру PLC FLE4SG-40.1:  Lichuan!!! Их много на складе.
	1.1. Добавить в FLProg - в Arduino есть. Есть один, не исследовали.
	1.2. Сделать доступ к выходам через функции RT_HW_Base.PLC_getPinDOT(idx) с обозначением Yxx. (Y00-Y07, Y10-Y17);
	1.3. Сделать доступ к входам  через функции RT_HW_Base.PLC_getPinDIN(idx) с обозначением Xxx; (X00-X07, Y10-Y17)
	1.6. Сделать доступ к LedRUN  через функции RT_HW_Base.PLC_getPinDOX(0) с обозначением LedRUN; LedRUN;		
	1.7. Сделать доступ к LedERR  через функции RT_HW_Base.PLC_getPinDOX(1) с обозначением LedERR; LedERR;	
	1.8. Сделать доступ к D2      через функции RT_HW_Base.PLC_getPinDOX(2) с обозначением D2;
	1.9. Сделать доступ к D3      через функции RT_HW_Base.PLC_getPinDOX(3) с обозначением D3;		