////#################################################################################################
//
//                        				API.h для i2c
//ecoins@mail.ru 21.05.2023г.
//=================================================================================================
// AVR     - one  i2c(Wire)  bus, combined master/slave library;
// SAM3X   - one  i2c(Wire)  bus, combined master/slave library;
// ESP8266 - one  i2c(Wire)  bus, combined master/slave library;
// ESP32S  - two  i2c Master bus(Wire1, Wire2) buses,   Wire.h library.
//           two  i2c Slave  bus(WireSlave1,WireSlave2),ESP32_I2C_Slave library.
// Raspberry Pi Pico - two i2c default;
//			 Wire (SDA,SCL) - 0,1; 4,5;  8, 9; 12,13; 16,17; 20,21;
//			 Wire1(SDA,SCL) - 2,3; 6,7; 10,11; 14,15; 18,19; 26,27;
// STM32   - three i2c(Wire) bus, combined master/slave library;
//           Wire is defined by default 
//           Wire1 needs to define TwoWire Wire1(RT_HW_I2C1_SDA, RT_HW_I2C1_SCL),
//           Wire2 needs to define TwoWire Wire2(RT_HW_I2C2_SDA, RT_HW_I2C2_SCL);
// Seeeduino-six bus i2c(Wire,Wire1-5), combined master/slave library;
//=================================================================================================
// code Err0r: 0-ok,1-too much data; 2-Nack on address transfer; 3-Nack on data transfer; 4-another error i2c; 
//             5-time out waitting byte; 
//             50-invalid number bus; 51-invalid address device(>=254), 52-bus i2c no Master;
//			   60,61,62-error number sda,scl;
//			   65-No CORE;
//-------------------------------------------------------------------------------------------------

//=================================================================================================

//=================================================================================================	
//  #define  RT_HW_LINK_I2C			//---FUNCTION CONNECTION DEFINER I2C
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//										0.STRUCTURE FOR I2C
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
struct RT_HW_STRUCT_I2C {
uint8_t  custom=0;				//--1.Setting option;
uint8_t  status=0;				//--2.State bus: no init=0; Master=1; Slave=2;
uint8_t  codeErr=0;				//--3.Code error; 	
uint8_t  busy=0;  				//--4.busy bus;
//-------------------------------------------------------------------------------------------------
uint8_t  sda=255; 				//--2.pin SDA;
uint8_t  scl=255;				//--3.pin SCL;  
uint8_t  adr=0; 				//--4.Adddress Slave: for Master=0;
//uint8_t  cntByte;   			//--5.Received bytes counter;	
//-------------------------------------------------------------------------------------------------
uint8_t  idx=0;					//--9.index;
uint8_t  bf8;   				//--10.Received bytes counter;
uint16_t bf16;					//--11.Buffer for transfer;
//-------------------------------------------------------------------------------------------------
uint32_t speed=RT_HW_I2C_SPEED; //--12.Speed bus;
//uint32_t timeBegin;				//--13.Time Begin for time out;
//uint32_t timeEnd;				//--14.Time End   for time out;
//uint32_t timeOut;   			//--15.Register to timeout when receiving bytes;
};
//=================================================================================================
//									1. CREATE LinkI2Cx
//=================================================================================================

//=================================================================================================
//									1.0. I2C0
//=================================================================================================
#if defined(RT_HW_PERMIT_I2C0)		  
RT_HW_STRUCT_I2C 	LinkI2C0;										
#endif
//=================================================================================================
//									1.1. I2C1
//=================================================================================================
#if defined(RT_HW_PERMIT_I2C1)							
RT_HW_STRUCT_I2C 	LinkI2C1;
#endif
//=================================================================================================
//									1.2. I2C2
//=================================================================================================
#if defined(RT_HW_PERMIT_I2C2)	
RT_HW_STRUCT_I2C 	LinkI2C2;
#endif	
//=================================================================================================
//						1.8.Шина I2CS0 (программная =8)
//=================================================================================================
//-------------------------------------------------------------------------------------------------
//						1.8.1.Создание области данных для работы с шиной i2cS
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
RT_HW_STRUCT_I2C 	LinkI2CS0;
#endif
//=================================================================================================
//						1.9.Шина I2CS1 (программная =9)
//=================================================================================================
//-------------------------------------------------------------------------------------------------
//						1.9.1.Создание области данных для работы с шиной i2cS1
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS1)	
RT_HW_STRUCT_I2C 	LinkI2CS1;										
#endif
//-----------------------------------------------------------------------------------------

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//                          		2. INIT PINS, PARAM
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//							+++++++ 2.1. Set Pins ++++++
//=================================================================================================
void	i2cSetPins(uint8_t sda, uint8_t scl, uint8_t bus){
(void)sda; (void)scl; (void)bus; uint8_t bf; (void)bf;
//=================================================================================================
//									2.1.1. AVR,SAM3X,SAMD21,ANON
//=================================================================================================
#if defined(RT_HW_CORE_AVR) || defined(RT_HW_CORE_SAM3X) || defined(RT_HW_CORE_SAMD21) || defined(RT_HW_CORE_ANON)
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C0)
if(bus==0){return;}										//--Successful Exit bus=0;
#endif
//--------------------------------------------------------------------------------------------------
return;											//--Exit by no bus AVR,SAMX,SAMD21,ANON;
#endif
//=================================================================================================
//									2.1.2. ESP8266
//=================================================================================================
#if defined(RT_HW_CORE_ESP8266)
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0){
if(sda==scl){i2cSetCodeErr(60,bus); return;}	//--Exit by mistake on SDA=SCL;
if(sda>=16) {i2cSetCodeErr(61,bus); return;}	//--Exit by mistake on SDA;
if(sda>=17) {i2cSetCodeErr(62,bus); return;}	//--Exit by mistake on SCL;
LinkI2C0.sda=sda; LinkI2C0.scl=scl;				//--Set pins SDA,SCL bus=0;
return;   }										//--Successful Exit  bus=0;
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1){
if(sda==scl){i2cSetCodeErr(60,bus); return;}	//--Exit by mistake on SDA=SCL;
if(sda>=16) {i2cSetCodeErr(61,bus); return;}	//--Exit by mistake on SDA;
if(sda>=17) {i2cSetCodeErr(62,bus); return;}	//--Exit by mistake on SCL;
LinkI2C1.sda=sda; LinkI2C1.scl=scl;				//--Set pins SDA,SCL bus=1;
return;   }										//--Successful Exit  bus=1;
#endif
//-------------------------------------------------------------------------------------------------
return;											//--Exit by no bus ESP8266;
#endif
//=================================================================================================
//									2.1.3. ESP32
//=================================================================================================
#if defined(RT_HW_CORE_ESP32)
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C0)
if(bus==0){
if(sda==scl){i2cSetCodeErr(60,bus); return;}	//--Exit by mistake on SDA=SCL;
if(sda>=34) {i2cSetCodeErr(61,bus); return;}	//--Exit by mistake on SDA;
if(sda>=34) {i2cSetCodeErr(62,bus); return;}	//--Exit by mistake on SCL;
LinkI2C0.sda=sda; LinkI2C0.scl=scl;				//--Set pins SDA,SCL bus=0;
return;   }										//--Successful Exit  bus=0;
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C1)
if(bus==0){
if(sda==scl){i2cSetCodeErr(60,bus); return;}	//--Exit by mistake on SDA=SCL;
if(sda>=34) {i2cSetCodeErr(61,bus); return;}	//--Exit by mistake on SDA;
if(sda>=34) {i2cSetCodeErr(62,bus); return;}	//--Exit by mistake on SCL;
LinkI2C1.sda=sda; LinkI2C1.scl=scl;				//--Set pins SDA,SCL bus=0;
return;   }										//--Successful Exit  bus=0;
#endif
//-------------------------------------------------------------------------------------------------
return;											//--Exit by no bus ESP32;
#endif
//=================================================================================================
//									2.1.4. RP2040
//=================================================================================================
#if defined(RT_HW_CORE_RP2040)
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C0)	
//----Wire (SDA,SCL): 0,1; 4,5;  8, 9; 12,13; 16,17; 20,21, 28,29;
if(bus==0){
bf=0;
if(!bf){if((sda== 0) && (scl== 1)){bf=1;}}
if(!bf){if((sda== 4) && (scl== 5)){bf=1;}}
if(!bf){if((sda== 8) && (scl== 9)){bf=1;}}
if(!bf){if((sda==12) && (scl==13)){bf=1;}}
if(!bf){if((sda==16) && (scl==17)){bf=1;}}
if(!bf){if((sda==20) && (scl==21)){bf=1;}}
if(!bf){if((sda==28) && (scl==29)){bf=1;}}
if( bf){LinkI2C0.sda=sda; LinkI2C0.scl=scl; return;} 	//--Set pins SDA,SCL bus=0;
return;  }															//--Exit by mistake on SCL,SDA for bus=0;
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C1)
//----Wire1(SDA,SCL): 2,3; 6,7; 10,11; 14,15; 18,19; 26,27;
if(bus==1){
bf=0;
if(!bf){if((sda== 2) && (scl== 3)){bf=1;}}
if(!bf){if((sda== 6) && (scl== 7)){bf=1;}}
if(!bf){if((sda==10) && (scl==11)){bf=1;}}
if(!bf){if((sda==14) && (scl==15)){bf=1;}}
if(!bf){if((sda==18) && (scl==19)){bf=1;}}
if(!bf){if((sda==26) && (scl==27)){bf=1;}}
if( bf){LinkI2C1.sda=sda; LinkI2C1.scl=scl; return;} 	//--Set pins SDA,SCL bus=1;
return;  }															//--Exit by mistake on SCL,SDA for bus=1;
#endif
//-------------------------------------------------------------------------------------------------
return;											//--Exit by no bus RP2040;
#endif
//=================================================================================================
//									2.1.5. STM32
//=================================================================================================
#if defined(RT_HW_CORE_STM32)
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C0)
if(bus==0){
if(sda==scl){i2cSetCodeErr(60,bus); return;}	//--Exit by mistake on SDA=SCL;
LinkI2C0.sda=sda; LinkI2C0.scl=scl; 			//--Set pins SDA,SCL bus=1;
return;   }										//--Successful Exit  bus=1;
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C1)
if(bus==1){
if(sda==scl){i2cSetCodeErr(60,bus); return;}	//--Exit by mistake on SDA=SCL;
LinkI2C1.sda=sda; LinkI2C1.scl=scl;				//--Set pins SDA,SCL bus=1;
return;   }										//--Successful Exit  bus=1;
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C2)
if(bus==2){
if(sda==scl){i2cSetCodeErr(60,bus); return;}	//--Exit by mistake on SDA=SCL;
LinkI2C2.sda=sda; LinkI2C2.scl=scl;				//--Set pins SDA,SCL bus=2;
return;   }										//--Successful Exit  bus=2;
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)
if(bus==8){
if(sda==scl){i2cSetCodeErr(60,bus); return;}	//--Exit by mistake on SDA=SCL;
LinkI2CS0.sda=sda; LinkI2CS0.scl=scl; 			//--Set pins SDA,SCL bus=1;
return;   }										//--Successful Exit  bus=1;
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS1)
if(bus==9){
if(sda==scl){i2cSetCodeErr(60,bus); return;}	//--Exit by mistake on SDA=SCL;
LinkI2CS1.sda=sda; LinkI2CS1.scl=scl;			//--Set pins SDA,SCL bus=1;
return;   }										//--Successful Exit  bus=1;
#endif


//-------------------------------------------------------------------------------------------------
return;											//--Exit by no bus STM32;
#endif
//=================================================================================================
//									2.1.6. No CORE									
//=================================================================================================
i2cSetCodeErr(65,bus);								//--Setting codeErr=No CORE;
return;												//--Exit by no bus;
};

//=================================================================================================
//						    		2.2. Init Param All
//=================================================================================================
void    i2cInitParamAll(){
for(uint8_t i=0; i<=6; i++){i2cInitParam(i);}	
i2cInitParam(8);
i2cInitParam(9);
}; 
//=================================================================================================
// 		    						2.3. Init default parameters
//=================================================================================================
void    i2cInitParam (uint8_t bus){						
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C0)							
if(bus==0) {LinkI2C0.busy=LinkI2C0.status=LinkI2C0.codeErr=0;	//--clear busy,status,codeErr;
			LinkI2C0.sda =readArrPGM(RT_HW_PGM_PIN_I2C_ID,0);	//--set pin SDA; 
			LinkI2C0.scl =readArrPGM(RT_HW_PGM_PIN_I2C_ID,1);	//--set pin SCL;
			LinkI2C0.speed=RT_HW_I2C_SPEED;            	    	//--set speed;
return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C1) 
if(bus==1){LinkI2C1.busy=LinkI2C1.status=LinkI2C1.codeErr=0;	//--clear busy,status,codeErr;
		   LinkI2C1.sda =readArrPGM(RT_HW_PGM_PIN_I2C_ID,2);	//--set pin SDA; 
		   LinkI2C1.scl =readArrPGM(RT_HW_PGM_PIN_I2C_ID,3);	//--set pin SCL;
		   LinkI2C1.speed=RT_HW_I2C_SPEED;            	    	//--set speed;
return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2C2)
if(bus==2){LinkI2C2.busy=LinkI2C2.status=LinkI2C0.codeErr=0;	//--clear busy,status,codeErr;
		   LinkI2C2.sda =readArrPGM(RT_HW_PGM_PIN_I2C_ID,4);	//--set pin SDA; 
		   LinkI2C2.scl =readArrPGM(RT_HW_PGM_PIN_I2C_ID,5);	//--set pin SCL;
		   LinkI2C2.speed=RT_HW_I2C_SPEED;            	    	//--set speed; 	
return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)							
if(bus==8) {LinkI2CS0.busy=LinkI2CS0.status=LinkI2CS0.codeErr=0;//--clear busy,status,codeErr;
			LinkI2CS0.sda =readArrPGM(RT_HW_PGM_PIN_ICS_ID,0);	//--set pin SDA; 
			LinkI2CS0.scl =readArrPGM(RT_HW_PGM_PIN_ICS_ID,1);	//--set pin SCL;
			LinkI2CS0.speed=RT_HW_I2C_SPEED;            	    //--set speed;
return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS1) 
if(bus==9){LinkI2CS1.busy=LinkI2CS1.status=LinkI2CS1.codeErr=0;	//--clear busy,status,codeErr;
		   LinkI2CS1.sda =readArrPGM(RT_HW_PGM_PIN_ICS_ID,2);	//--set pin SDA; 
		   LinkI2CS1.scl =readArrPGM(RT_HW_PGM_PIN_ICS_ID,3);	//--set pin SCL;
		   LinkI2CS1.speed=RT_HW_I2C_SPEED;            	    	//--set speed;
return;}
#endif
//-------------------------------------------------------------------------------------------------
};


//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//                          	3. УТИЛИТЫ ДЛЯ ФУНКЦИЙ РАБОТЫ С УСТРОЙСТВАМИ i2c
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
// 		    						3.1. Установка параметров
//=================================================================================================
uint8_t i2cSetParam(RT_HW_STRUCT_I2C_DEV &id, uint8_t adr, uint8_t bus=0, uint32_t speed=0){
  (void)adr; (void)bus; (void)speed;
  if(id.custom==0){id.link=id.status=id.codeErr=id.err=0; id.adr=adr; id.bus=bus; id.speed=speed; id.custom=1;}
  return id.custom;
};
//=================================================================================================
// 		    		3.2. Начальная   транзакция перед обменом с устройством
//=================================================================================================
void  i2cBeginTransmission(RT_HW_STRUCT_I2C_DEV &id){i2cBeginTransmission(id.adr,id.bus);};
//=================================================================================================
// 		    		3.3. Завершающая транзакция перед обменом с устройством
//=================================================================================================
void  i2cEndTransmission(RT_HW_STRUCT_I2C_DEV &id){id.codeErr=i2cEndTransmission(id.bus);};
//=================================================================================================
// 		    		3.4. Установка расширителя шины i2c если устройство подключено через расширитель
//=================================================================================================
void  i2cSetChannel(RT_HW_STRUCT_I2C_DEV &id){
  if(id.expander){									//--Проверка на наличие расширителя;
	  if((id.channel>0) && (id.channel<=8)){		//--Проверка на допустимость номера канала;
        uint8_t bf=0; bitSet(bf,(id.channel-1));	//--Установка в переменной бита соответствующего номера канала;
        i2cBeginTransmission(id.expander,id.bus);	//--Начальная   транзакция для обмена с расширителем;
        i2cWrite(bf,id.bus);						//--Запись регистра управления каналами;
        i2cEndTransmission(id.bus);					//--Завершающая транзакция для обмена с расширителем;
  }}
};
//=================================================================================================
// 		    		3.5. Сброс расширителя шины i2c если устройство подключено через расширитель
//=================================================================================================
void  i2cClearChannel(RT_HW_STRUCT_I2C_DEV &id){
  if(id.expander){									//--Проверка на наличие расширителя;
        i2cBeginTransmission(id.expander,id.bus);	//--Начальная   транзакция для обмена с расширителем;
        i2cWrite(0,id.bus);							//--Очистка регистра управления каналами;
        i2cEndTransmission(id.bus);					//--Завершающая транзакция для обмена с расширителем;
  }
};
//=================================================================================================
// 		    		3.6. Утилита: начальные действия функции обмена с устройствами i2c (RT_HW_STRUCT_I2C_DEV &id)
//=================================================================================================
bool i2cBeginFunc(RT_HW_STRUCT_I2C_DEV &id){
  id.link=0;											//--Очистка флага link(флаг успешного завершения обмена);
  if(i2cGetStatus(id.bus)!=1) {id.link=1; return 1;}	//--Выход если шина i2c не настроена как Master;
  if(i2cSetBusy  (id.bus)==0) {           return 1;}	//--Захват шины i2c;
  i2cSetClock(id.speed,id.bus);							//--Установка скорости шины для обмена с утройством;
  i2cSetChannel(id);									//--При подключении устройства через расширителя i2c, настройка расширителя;
  return 0;												//--Выход успешный;										
};
//=================================================================================================
// 		    		3.7. Утилита: завершающие действия функции обмена с устройствами i2c
//=================================================================================================
void i2cEndFunc(RT_HW_STRUCT_I2C_DEV &id){
  i2cClearChannel(id);									//--Сброс расширителя ш2с;	
  i2cSetClock(i2cGetSpeed(id.bus),id.bus);				//--Установка значения скорости шины по умолчанию;
  i2cClearBusy(id.bus); 								//--Освобождение шины i2c;	
  id.link=1;											//--Установка флага link (успешное завершение);
};
//=================================================================================================
// 		    		3.8. Утилита: Запрос и чтение в буфер i2c qnt байт c тайм-аутом
//=================================================================================================
void i2cRequestFromFunc(RT_HW_STRUCT_I2C_DEV &id, uint8_t qnt){
  uint8_t cnt=i2cRequestFrom(qnt,id.adr,id.bus,id.stop);//--Запрос qnt bytes;
  if(cnt!=qnt){id.codeErr=5; return;}					//--Ошибка =5, если кол-во возвращаемых байт не равно кол-ву запрошенных байт;
  uint32_t timeBegin=micros();
  uint32_t timeEnd;
  uint16_t time=100*qnt;
  do{													//--Ожидание (в цикле с тайм аутом) прихода в буфер i2c qnt запрощенных байт;
	 cnt=i2cAvailable(id.bus);							//--Ожидание (в цикле с тайм аутом) прихода в буфер i2c qnt запрощенных байт;
     timeEnd=micros();									//--Фиксация текущего времени для контроля тайм-аута;
	 if(cnt>=qnt){break;}								//--Проверка заполнения буфера чтения qnt байтами;
     if(timeEnd>=timeBegin){if((timeEnd   - timeBegin)>time) {id.codeErr=6; return;}}
	 else                  {if((timeBegin - timeEnd)  >time) {id.codeErr=6; return;}}
    }
  while(1);    											//--Ожидание завершения цикла do{};				  
														//--Выход успешный;	
};
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//                          		4. ИНИЦИАЛИЗАЦИЯ ШИНЫ И ПОИСК УСТРОЙСТВА i2c
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
// 		    						4.1. Инициализация устройства 
//=================================================================================================
void  i2cInitDevice(RT_HW_STRUCT_I2C_DEV &id){
  id.link=0;
  if(id.custom==0){id.codeErr=50; id.link=1; return;} 	//--Выход по ошибке =50, если параметры устройство не настроено;
  if(id.status==1){id.codeErr=0;  id.link=1; return;}	//--Успешный выход,	если шина настроена как Master;
  if(id.err==1)   {id.codeErr=51; id.link=1; return;}
  id.status=id.codeErr=0;
//------------------------------------------------------------------------------------------------
  if(!i2cCheckBus(id.bus))	  {id.codeErr=52; id.err=1; id.link=1; return;}	//--Выход по ошибке =52, недопустимый номер шины;
//-------------------------------------------------------------------------------------------------
  if(!i2cBegin(id.bus))		  {				             		   return;} //--Инициализация шины i2c как Master;								  
  if( i2cGetStatus(id.bus)!=1){id.codeErr=53; id.err=1; id.link=1; return;}	//--Выход по ошибке =53, шина не настроена как Maste;
//-------------------------------------------------------------------------------------------------
  if(id.speed==0){id.speed=RT_HW_I2C_SPEED;}			//--Установка значения скорости шины по умолчанию;
  id.status=i2cGetStatus(id.bus); 						//--Установка состояния настройки устройства =Master;		
  id.link=1;											//--Установка флага link (успешное завершение);
};		
//=================================================================================================
// 		    						4.2. Поиск устройства на шине i2c 
//=================================================================================================
void  i2cFindAdr(RT_HW_STRUCT_I2C_DEV &id){ 
  if(i2cBeginFunc(id)){return;}							//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;
//-------------------------------------------------------------------------------------------------
  i2cBeginTransmission(id); 							//--Начальная   транзакция для обмена с устройством;
  i2cEndTransmission(id);								//--Завершающая транзакция для обмена с устройством;
//-------------------------------------------------------------------------------------------------
  i2cEndFunc(id);										//--Освобождение шины i2c, сброс расширителя i2c;
};

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//                          		5. ЗАПИСЬ В УСТРОЙСТВО i2c
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
// 		    						5.1. Запись байта
//=================================================================================================
void i2cWrite      (RT_HW_STRUCT_I2C_DEV &id, uint8_t var){
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;	
//-------------------------------------------------------------------------------------------------
  i2cBeginTransmission(id); 						//--Начальная   транзакция для обмена с устройством;
  i2cWrite(var,id.bus); 							//--Отправка байта;
  i2cEndTransmission(id);							//--Завершающая транзакция для обмена с устройством;
//-------------------------------------------------------------------------------------------------
  i2cEndFunc(id);									//--Освобождение шины i2c, сброс расширителя i2c;
};
//=================================================================================================
// 		    						5.2. Запись двух байт
//=================================================================================================
void i2cWrite2    (RT_HW_STRUCT_I2C_DEV &id, uint8_t var1, uint8_t var2){
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;	
//-------------------------------------------------------------------------------------------------
  i2cBeginTransmission(id); 						//--Начальная   транзакция для обмена с устройством;
  i2cWrite(var1,id.bus); 							//--Отправка 1-го байта;
  i2cWrite(var2,id.bus); 							//--Отправка 2-го байта; 
  i2cEndTransmission(id);							//--Завершающая транзакция для обмена с устройством;
//-------------------------------------------------------------------------------------------------
  i2cEndFunc(id);									//--Освобождение шины i2c, сброс расширителя i2c;
};
//=================================================================================================
// 		    						5.3. Cлова uint16_t
//=================================================================================================
void i2cWriteV16  (RT_HW_STRUCT_I2C_DEV &id, uint16_t var){
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;	
//-------------------------------------------------------------------------------------------------
  i2cBeginTransmission(id); 						//--Начальная   транзакция для обмена с устройством;
  i2cWrite((( uint8_t) var&0xFF),     id.bus); 		//--Отправка младшего байта;
  i2cWrite((((uint8_t)(var>>8))&0xFF),id.bus); 		//--Отправка старшего байта; 
  i2cEndTransmission(id);							//--Завершающая транзакция для обмена с устройством;
//------------------------------------------------------------------------------------------------- 
  i2cEndFunc(id);									//--Освобождение шины i2c, сброс расширителя i2c;
};
//=================================================================================================
// 		    						5.4. Запись в регистр reg одного байта
//=================================================================================================
void i2cWriteReg  (RT_HW_STRUCT_I2C_DEV &id, uint8_t reg, uint8_t var){
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;
//-------------------------------------------------------------------------------------------------
  i2cBeginTransmission(id); 						//--Начальная   транзакция для обмена с устройством;
  i2cWrite(reg,id.bus); 							//--Отправка регистра;
  i2cWrite(var,id.bus); 							//--Отправка байта;
  i2cEndTransmission(id);							//--Завершающая транзакция для обмена с устройством;
//-------------------------------------------------------------------------------------------------
  i2cEndFunc(id);									//--Освобождение шины i2c, сброс расширителя i2c;
};
//=================================================================================================
// 		    						5.5. Запись с регистр reg  двух байт
//=================================================================================================
void i2cWriteReg2(RT_HW_STRUCT_I2C_DEV &id, uint8_t reg, uint8_t var1, uint8_t var2){
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;
//-------------------------------------------------------------------------------------------------
  i2cBeginTransmission(id); 						//--Начальная   транзакция для обмена с устройством;
  i2cWrite(reg,id.bus); 							//--Отправка регистра;
  i2cWrite(var1,id.bus); 							//--Отправка 1-го байта;
  i2cWrite(var2,id.bus); 							//--Отправка 2-го байта;
  i2cEndTransmission(id);							//--Завершающая транзакция для обмена с устройством;
//-------------------------------------------------------------------------------------------------
  i2cEndFunc(id);									//--Освобождение шины i2c, сброс расширителя i2c;
};

//=================================================================================================
// 		    						5.6. Запись в регистр reg  слова uint16_t
//=================================================================================================
void i2cWriteRegV16(RT_HW_STRUCT_I2C_DEV &id, uint8_t reg, uint16_t var){
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;
//-------------------------------------------------------------------------------------------------
  i2cBeginTransmission(id); 						//--Начальная   транзакция для обмена с устройством;
  i2cWrite(reg,id.bus); 							//--Отправка регистра;
  i2cWrite((( uint8_t) var&0xFF),     id.bus); 		//--Отправка младшего байта;
  i2cWrite((((uint8_t)(var>>8))&0xFF),id.bus); 		//--Отправка старшего байта;  
  i2cEndTransmission(id);							//--Завершающая транзакция для обмена с устройством;
//-------------------------------------------------------------------------------------------------
  i2cEndFunc(id);									//--Освобождение шины i2c, сброс расширителя i2c;
};
//=================================================================================================
// 		    						5.7. Запись массива из qnt байт
//=================================================================================================
void i2cWriteArr(RT_HW_STRUCT_I2C_DEV &id, uint8_t *arr, uint8_t qnt){
  if(qnt>32) {qnt=32;};								//--Нормализация параметра qnt;
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;
//-------------------------------------------------------------------------------------------------
  i2cBeginTransmission(id); 						//--Начальная   транзакция для обмена с устройством;
  for(uint8_t i=0; i<qnt; i++){i2cWrite(arr[i],id.bus);} //--Отправка qnt байтoв;
  i2cEndTransmission(id);							//--Завершающая транзакция для обмена с устройством;
//-------------------------------------------------------------------------------------------------
  i2cEndFunc(id);									//--Освобождение шины i2c, сброс расширителя i2c;
};
//=================================================================================================
// 		    						5.8. Запись с регистра reg массива из qnt байт
//=================================================================================================
void i2cWriteRegArr(RT_HW_STRUCT_I2C_DEV &id, uint8_t reg, uint8_t *arr, uint8_t qnt){
  if(qnt>32) {qnt=32;};								//--Нормализация параметра qnt;
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;
//-------------------------------------------------------------------------------------------------
  i2cBeginTransmission(id); 						//--Начальная   транзакция для обмена с устройством;
  i2cWrite(reg,id.bus); 							//--Отправка регистра;
  for(uint8_t i=0; i<qnt; i++){i2cWrite(arr[i],id.bus);} //--Отправка qnt байтoв;
  i2cEndTransmission(id);							//--Завершающая транзакция для обмена с устройством;
//-------------------------------------------------------------------------------------------------
  i2cEndFunc(id);									//--Освобождение шины i2c, сброс расширителя i2c;
};

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//                          		5. ЧТЕНИЕ ИЗ УСТРОЙСТВА i2c
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
// 		    						5.1. Чтение байта в id.bf8
//=================================================================================================
void i2cRead(RT_HW_STRUCT_I2C_DEV &id){ 
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;
//-------------------------------------------------------------------------------------------------
  i2cRequestFromFunc(id, 1);						//--Запрос и прием в буфер qnt байтов;
  if(id.codeErr==0){id.bf8=i2cRead(id.bus);}		//--Чтение qnt байт в массив arr из буфера i2c;	
//-------------------------------------------------------------------------------------------------
  i2cEndFunc(id);									//--Освобождение шины i2c, сброс расширителя i2c;
};
//=================================================================================================
// 		    						4.4. Чтение qnt байт в массив arr
//=================================================================================================
void i2cReadArr(RT_HW_STRUCT_I2C_DEV &id, uint8_t *arr, uint8_t qnt){ 
  if(qnt>32) {qnt=32;};								//--Нормализация параметра qnt;
//-------------------------------------------------------------------------------------------------
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;
//-------------------------------------------------------------------------------------------------
  i2cRequestFromFunc(id, qnt);						//--Запрос и прием в буфер qnt байтов;
  if(id.codeErr==0){for(uint8_t i=0; i<qnt; i++){arr[i]=i2cRead(id.bus);}}//--Чтение qnt байт в массив arr из буфера i2c;	
//-------------------------------------------------------------------------------------------------
  i2cEndFunc(id);									//--Освобождение шины i2c, сброс расширителя i2c;
};
//=================================================================================================
// 		    						4.5. Чтение из регистра reg байта в id.bf8
//=================================================================================================
void i2cReadRegVar(RT_HW_STRUCT_I2C_DEV &id, uint8_t reg){
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;
//-------------------------------------------------------------------------------------------------
  i2cBeginTransmission(id); 						//--Начальная   транзакция для обмена с устройством;	
  i2cWrite(reg,id.bus); 							//--Отправка регистра;
  i2cEndTransmission(id);							//--Завершающая транзакция для обмена с устройством;
//------------------------------------------------------------------------------------------------  
  if(id.codeErr==0){i2cRequestFromFunc(id,1);}		//--Запрос и прием в буфер qnt байтов;
  if(id.codeErr==0){id.bf8=i2cRead(id.bus);}		//--Чтение qnt байт в массив arr из буфера i2c;	
//------------------------------------------------------------------------------------------------
  i2cEndFunc(id);									//--Освобождение шины i2c, сброс расширителя i2c;		
};
//=================================================================================================
// 		    						4.5.1 Чтение из регистра reg байта в id.bf8 (для совместимости со старыми программами)
//=================================================================================================
void i2cREAD(RT_HW_STRUCT_I2C_DEV &id, uint8_t reg){i2cReadRegVar(id,reg);};

//=================================================================================================
// 		    						4.6. Чтение начиная с регистра reg  qnt байт в массив arr
//=================================================================================================
void i2cReadRegArr(RT_HW_STRUCT_I2C_DEV &id, uint8_t reg, uint8_t *arr, uint8_t qnt){
  if(qnt>32) {qnt=32;};								//--Нормализация параметра qnt;
//-------------------------------------------------------------------------------------------------
  if(i2cBeginFunc(id)){return;}						//--Проверка готовности, настройка и захват шины, настройка расширителя i2c;
//-------------------------------------------------------------------------------------------------
  i2cBeginTransmission(id); 						//--Начальная   транзакция для обмена с устройством;	
  i2cWrite(reg,id.bus); 							//--Отправка регистра;
  i2cEndTransmission(id);							//--Завершающая транзакция для обмена с устройством;
//------------------------------------------------------------------------------------------------  
  if(id.codeErr==0){i2cRequestFromFunc(id, qnt);}	//--Запрос и прием в буфер qnt байтов;
  if(id.codeErr==0){for(uint8_t i=0; i<qnt; i++){arr[i]=i2cRead(id.bus);}}//--Чтение qnt байт в массив arr из буфера i2c;	
//-------------------------------------------------------------------------------------------------
  i2cEndFunc(id);		
};
//=================================================================================================
// 		    						4.5.1 Чтение из регистра reg байта в id.bf8 (для совместимости со старыми программами)
//=================================================================================================
void i2cREADArr(RT_HW_STRUCT_I2C_DEV &id, uint8_t reg, uint8_t *arr, uint8_t qnt){i2cReadRegArr(id,reg,arr,qnt);};



//=================================================================================================

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//									10.Exchange functions
// codeErr: 0-ok, 1-too much data; 2-Nack to transfer the address; 3-Nack on data transmission; 4-other i2c error;
// 5 - invalid controller; 6-invalid tire; 7 - invalid address (>=254), 8 - bus not configured as master, 8 other reasons; 
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
void     i2cSetClock (uint32_t speed,uint8_t bus);		//--Speed setting (hardware);
void     i2cBeginTransmission(uint8_t adr, uint8_t bus);//--Start of a hardware transaction;
uint8_t  i2cEndTransmission  (uint8_t bus);				//--End   of a hardware transaction;
uint8_t  i2cFlush            (uint8_t bus);				//--Flush();
uint8_t  i2cAvailable        (uint8_t bus);				//--Checking the number of received bytes in the i2c buffer;
uint8_t  i2cRead             (uint8_t bus);				//--Reading a byte from an i2c buffer;
void     i2cWrite(uint8_t var,uint8_t bus);				//--Write a byte;
void     i2cWrite(const uint8_t *arr, uint8_t qnt, uint8_t bus);//--Writing qnt bytes;
void     i2cWrite(const char    *arr, uint8_t qnt, uint8_t bus);//--Writing qnt char;
uint8_t  i2cRequestFrom(uint8_t qnt,  uint8_t adr, uint8_t bus, uint8_t sendStop=1);//--Reading qnt bytes from the specified register(reg);
//=================================================================================================
uint8_t  i2cBegin(uint8_t bus);							//--init i2c as Master;
uint8_t  i2cBegin(uint8_t adr, uint8_t bus);			//--init i2c as Slave;
void     i2cEnd(uint8_t bus);

//#################################################################################################
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//
//									1.Utilities for Internal Functions 
//
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=================================================================================================
//									1.1. Check bus
//=================================================================================================
uint8_t  i2cCheckBus(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {return 1;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {return 1;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {return 1;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {return 1;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {return 1;}
#endif
//-------------------------------------------------------------------------------------------------
return 0;};
//=================================================================================================
// 									1.2.1. Get address
//=================================================================================================
uint8_t  i2cGetAdr(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {return LinkI2C0.adr;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {return LinkI2C1.adr;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {return LinkI2C2.adr;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {return LinkI2CS0.adr;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {return LinkI2CS1.adr;}
#endif
//-------------------------------------------------------------------------------------------------
return 255;};
//=================================================================================================
// 									1.2.2. Set address
//=================================================================================================
void     i2cSetAdr(uint8_t adr,	uint8_t bus){
(void)adr; (void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.adr=adr;  return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.adr=adr;  return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.adr=adr;  return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.adr=adr; return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.adr=adr; return;}
#endif
//-------------------------------------------------------------------------------------------------
};
//=================================================================================================
// 									1.3.1. Get status
//=================================================================================================
uint8_t  i2cGetStatus(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {return LinkI2C0.status;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {return LinkI2C1.status;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {return LinkI2C2.status;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {return LinkI2CS0.status;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {return LinkI2CS1.status;}
#endif
//-------------------------------------------------------------------------------------------------
return 0;};
//=================================================================================================
// 									1.3.2. Set status
//=================================================================================================
void     i2cSetStatus(uint8_t var, uint8_t bus){
(void)var; (void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.status=var; return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.status=var; return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.status=var; return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.status=var; return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.status=var; return;}
#endif
//-------------------------------------------------------------------------------------------------
};
//=================================================================================================
// 									1.4.1. Get code error
//=================================================================================================
uint8_t  i2cGetCodeErr(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {return LinkI2C0.codeErr;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {return LinkI2C1.codeErr;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {return LinkI2C2.codeErr;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {return LinkI2CS0.codeErr;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {return LinkI2CS1.codeErr;}
#endif
//-------------------------------------------------------------------------------------------------
return 0;};
//=================================================================================================
// 									1.4.2. Set code error
//=================================================================================================
void 	 i2cSetCodeErr(uint8_t var, uint8_t bus){
(void)var; (void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.codeErr=var;  return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.codeErr=var;  return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.codeErr=var;  return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.codeErr=var; return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.codeErr=var; return;}
#endif
//-------------------------------------------------------------------------------------------------
};
//=================================================================================================
// 									1.4.3. Clear code error
//=================================================================================================
void 	 i2cClearCodeErr(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.codeErr=0;  return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.codeErr=0;  return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.codeErr=0;  return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.codeErr=0; return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.codeErr=0; return;}
#endif
//-------------------------------------------------------------------------------------------------
};
//=================================================================================================
//									1.5.1. Check busy
//=================================================================================================
uint8_t  i2cCheckBusy (uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {if(LinkI2C0.busy){return 1;} 	return 0;} 
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {if(LinkI2C1.busy){return 1;} 	return 0;} 
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {if(LinkI2C2.busy){return 1;} 	return 0;} 
#endif
//------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {if(LinkI2CS0.busy){return 1;} 	return 0;} 
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {if(LinkI2CS1.busy){return 1;} 	return 0;} 
#endif
//-------------------------------------------------------------------------------------------------
return 0;};
//=================================================================================================
//									1.5.2. Capture bus
//=================================================================================================
uint8_t  i2cSetBusy(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {if(LinkI2C0.busy==0){LinkI2C0.busy=1;}    if(LinkI2C0.busy==0) {LinkI2C0.busy=1;}; 	return LinkI2C0.busy;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {if(LinkI2C1.busy==0){LinkI2C1.busy=1;}    if(LinkI2C1.busy==0) {LinkI2C1.busy=1;}; 	return LinkI2C1.busy;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {if(LinkI2C2.busy==0){LinkI2C2.busy=1;}    if(LinkI2C2.busy==0) {LinkI2C2.busy=1;}; 	return LinkI2C2.busy;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {if(LinkI2CS0.busy==0){LinkI2CS0.busy=1;}  if(LinkI2CS0.busy==0){LinkI2CS0.busy=1;}; return LinkI2CS0.busy;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {if(LinkI2CS1.busy==0){LinkI2CS1.busy=1;}  if(LinkI2CS1.busy==0){LinkI2CS1.busy=1;}; return LinkI2CS1.busy;}
#endif
//-------------------------------------
return 0;};
//=================================================================================================
//									1.5.3. Release bus
//=================================================================================================
void     i2cClearBusy(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.busy=0; return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.busy=0; return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.busy=0; return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.busy=0; return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.busy=0; return;}
#endif
//-------------------------------------------------------------------------------------------------
return;};

/*
//=================================================================================================
//									===1.6.1. Get index
//=================================================================================================
uint8_t  i2cIdxGet(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {return LinkI2C0.idx;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {return LinkI2C1.idx;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {return LinkI2C2.idx;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {return LinkI2CS0.idx;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {return LinkI2CS1.idx;}
#endif
//-------------------------------------------------------------------------------------------------
return 0;}
//=================================================================================================
//									===1.6.2. Clear index
//=================================================================================================
void    i2cIdxClear(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.idx=0; return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.idx=0; return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.idx=0; return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.idx=0; return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.idx=0; return;}
#endif
//-------------------------------------------------------------------------------------------------
};
//=================================================================================================
//									===1.6.3. Increment index
//=================================================================================================
void    i2cIdxInc(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.idx++;  return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.idx++;  return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.idx++;  return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.idx++; return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.idx++; return;}
#endif
//-------------------------------------------------------------------------------------------------
};
//=================================================================================================
//								 	===1.6.4. Set index
//=================================================================================================
void    i2cIdxSet(uint8_t var, uint8_t bus){
(void)var; (void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.idx=var; return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.idx=var; return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.idx=var; return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.idx=var; return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.idx=var; return;}
#endif
//-------------------------------------------------------------------------------------------------
};
//=================================================================================================
//									===1.7.1. Get Buff
//=================================================================================================
uint8_t  i2cGetBuff(uint8_t bus){
	(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {return LinkI2C0.bf8;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {return LinkI2C1.bf8;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {return LinkI2C2.bf8;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {return LinkI2CS0.bf8;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {return LinkI2CS1.bf8;}
#endif
//-------------------------------------------------------------------------------------------------
return 0;}
//=================================================================================================
//								 	===1.7.2. Set buff
//=================================================================================================
void    i2cSetBuff(uint8_t var, uint8_t bus){
(void)var; (void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.bf8=var; 	return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.bf8=var; 	return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.bf8=var; 	return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.bf8=var; 	return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.bf8=var; 	return;}
#endif
//-------------------------------------------------------------------------------------------------
};
*/
//=================================================================================================
// 									1.8.1. Get speed
//=================================================================================================
uint32_t i2cGetSpeed (uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {return LinkI2C0.speed;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {return LinkI2C1.speed;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {return LinkI2C2.speed;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {return LinkI2CS0.speed;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {return LinkI2CS1.speed;}
#endif
//-------------------------------------------------------------------------------------------------
return RT_HW_I2C_SPEED;};
//=================================================================================================
// 									1.8.2. Set speed
//=================================================================================================
void     i2cSetSpeed (uint8_t bus, uint32_t speed=0){
(void)speed; (void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {if(speed>0){LinkI2C0.speed=speed;  return;}}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {if(speed>0){LinkI2C1.speed=speed;  return;}}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {if(speed>0){LinkI2C2.speed=speed;  return;}}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {if(speed>0){LinkI2CS0.speed=speed;  return;}}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {if(speed>0){LinkI2CS1.speed=speed;  return;}}
#endif
//-------------------------------------------------------------------------------------------------
};

/*
//=================================================================================================
// 									====1.9.1. Set TimeOut
//=================================================================================================
void     i2cSetTimeOut(uint32_t vTm, uint8_t bus){
(void)vTm; (void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.timeOut=vTm; 	return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.timeOut=vTm; 	return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.timеOut=vTm; 	return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.timeOut=vTm; 	return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.timeOut=vTm;	return;}
#endif
//-------------------------------------------------------------------------------------------------
};
//=================================================================================================
// 									===1.9.2. Get TimeOut
//=================================================================================================
uint32_t i2cGetTimeOut(uint8_t bus){
	(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {return LinkI2C0.timeOut;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {return LinkI2C1.timeOut;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {return LinkI2C2.timeOut;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {return LinkI2CS0.timeOut;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {return LinkI2CS1.timeOut;}
#endif
//-------------------------------------------------------------------------------------------------
return 0;};

//=================================================================================================
// 									1.9.3. Init time out
//=================================================================================================
void i2cInitTimeOut(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.timeBegin=micros();	return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.timeBegin=micros();	return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.timeBegin=micros();	return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.timeBegin=micros(); 	return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.timeBegin=micros(); 	return;}
#endif
//-------------------------------------------------------------------------------------------------
};

//=================================================================================================
// 									1.9.4. Get past time out
//=================================================================================================
uint32_t i2cGetPastTime(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.timeEnd=micros(); 
if(LinkI2C0.timeEnd>=LinkI2C0.timeBegin)  {return (LinkI2C0.timeEnd-LinkI2C0.timeBegin);}   else {return(0xFFFFFFFF-LinkI2C0.timeBegin+LinkI2C0.timeEnd);}}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.timeEnd=micros(); 
if(LinkI2C1.timeEnd>=LinkI2C1.timeBegin)  {return (LinkI2C1.timeEnd-LinkI2C1.timeBegin);}   else {return(0xFFFFFFFF-LinkI2C1.timeBegin+LinkI2C1.timeEnd);}}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==0) {LinkI2C2.timeEnd=micros(); 
if(LinkI2C2.timeEnd>=LinkI2C2.timeBegin)  {return (LinkI2C2.timeEnd-LinkI2C2.timeBegin);}   else {return(0xFFFFFFFF-LinkI2C2.timeBegin+LinkI2C2.timeEnd);}}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.timeEnd=micros(); 
if(LinkI2CS0.timeEnd>=LinkI2CS0.timeBegin){return (LinkI2CS0.timeEnd-LinkI2CS0.timeBegin);} else {return(0xFFFFFFFF-LinkI2CS0.timeBegin+LinkI2CS0.timeEnd);}}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.timeEnd=micros(); 
if(LinkI2CS1.timeEnd>=LinkI2CS1.timeBegin){return (LinkI2CS1.timeEnd-LinkI2CS1.timeBegin);} else {return(0xFFFFFFFF-LinkI2CS1.timeBegin+LinkI2CS1.timeEnd);}}
#endif
//-------------------------------------
return 0;};

//=================================================================================================
// 									===1.10.1. Set counter byte
//=================================================================================================
void     i2cSetCntByte(uint8_t  cnt, uint8_t bus){
(void)cnt; (void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {LinkI2C0.cntByte=cnt; 	return;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {LinkI2C1.cntByte=cnt; 	return;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {LinkI2C2.cntByte=cnt; 	return;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {LinkI2CS0.cntByte=cnt; 	return;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {LinkI2CS1.cntByte=cnt;	return;}
#endif
//-------------------------------------------------------------------------------------------------
};
//=================================================================================================
// 									===1.10.2. Set counter byte
//=================================================================================================
uint8_t  i2cGetCntByte(       		uint8_t bus){
(void)bus;	
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {return LinkI2C0.cntByte;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {return LinkI2C1.cntByte;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {return LinkI2C2.cntByte;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {return LinkI2CS0.cntByte;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {return LinkI2CS1.cntByte;}
#endif
//-------------------------------------------------------------------------------------------------
return 0;};
*/

//=================================================================================================
// 									1.11.1. Get pin SCL
//=================================================================================================
uint8_t  i2cGetPinSCL(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {return LinkI2C0.scl;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {return LinkI2C1.scl;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {return LinkI2C2.scl;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {return LinkI2CS0.scl;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {return LinkI2CS1.scl;}
#endif
//-------------------------------------------------------------------------------------------------
return 255;};
//=================================================================================================
// 									1.11.2. Get pin SDA
//=================================================================================================
uint8_t  i2cGetPinSDA(uint8_t bus){
(void)bus;
#if defined(RT_HW_PERMIT_I2C0)	
if(bus==0) {return LinkI2C0.sda;}
#endif
#if defined(RT_HW_PERMIT_I2C1)	
if(bus==1) {return LinkI2C1.sda;}
#endif
#if defined(RT_HW_PERMIT_I2C2)	
if(bus==2) {return LinkI2C2.sda;}
#endif
//-------------------------------------------------------------------------------------------------
#if defined(RT_HW_PERMIT_I2CS0)	
if(bus==8) {return LinkI2CS0.sda;}
#endif
#if defined(RT_HW_PERMIT_I2CS1)	
if(bus==9) {return LinkI2CS1.sda;}
#endif
//-------------------------------------------------------------------------------------------------
return 255;};	

//#################################################################################################
/*
id.link=0; 					//--Clearing link, Limiting the number of bytes sent;
//-------------------------------------------------------------------------------------------------
if(i2cGetStatus(id.bus)!=1) {id.link=1; return;}	//--Exit if i2c is not Master;
if(i2cSetBusy  (id.bus)==0) {		    return;}; 	//--i2c bus capture;
i2cSetClock(id.speed,id.bus);						//--Setting speed for device;
i2cSetChannel(id);									//--Installing i2c expander channel;
//-------------------------------------------------------------------------------------------------
id.codeErr=0;										//--Cleanig code error;

id.cnt=i2cRequestFrom(qnt,id.adr,id.bus,id.stop);	//--Requestting qnt bytes;
if(id.cnt!=qnt){id.codeErr=5;}						//--if the number of received bytes does not match the requested;
//-------------------------------------------------------------------------------------------------
if(id.codeErr==0){									//--Checking code error;
 i2cInitTimeOut(id.bus);							//--Setting start time out;
 id.bf8=100;										//--Setting size  time out;
 do{id.cnt=i2cAvailable(id.bus);					//--Сhecking the receive buffer i2c;
    if(id.cnt>=qnt){break;}							//--Checking buffer completion;
    if(i2cGetPastTime(id.bus)>(id.bf8*qnt)){id.codeErr=6;}	//--Checking time out;
   }while(1);    }									//--Waitting for the DO loop;				  
//-------------------------------------------------------------------------------------------------
if(i2cGetCodeErr(id.bus)==0){for(id.idx=0; id.idx<qnt; id.idx++){arr[id.idx]=i2cRead(id.bus);}}//--Reading qnt bytes from the i2c buffer;					
//-------------------------------------------------------------------------------------------------
i2cClearChannel(id);								//--Reset i2c expander channel;	
i2cSetClock(i2cGetSpeed(id.bus),id.bus);	 		//--Setting speed default;
i2cClearBusy(id.bus); 								//--i2c bus release;
id.link=1;};										//--Setting link and EXIT;
*/



/*
  if(cnt!=qnt){id.codeErr=5;}						//--Ошибка =5, если кол-во возвращаемых байт не равно кол-ву запрошенных байт;
  if(id.codeErr==0){								//--Чтение если запрос без ошибок;
   i2cInitTimeOut(id.bus);							//--Setting start time out;
   uint8_t bf=100;									//--Setting size  time out;
    do{cnt=i2cAvailable(id.bus);					//--Ожидание (в цикле с тайм аутом) прихода в буфер i2c qnt запрощенных байт;
      if(cnt>=qnt){break;}							//--Checking buffer completion;
      if(i2cGetPastTime(id.bus)>(bf*qnt)){id.codeErr=6;}	//--Checking time out;
     }
    while(1);    								//--Waitting for the DO loop;				  
  }
//-------------------------------------------------------------------------------------------------
  if(i2cGetCodeErr(id.bus)==0){for(id.idx=0; id.idx<qnt; id.idx++){arr[id.idx]=i2cRead(id.bus);}}//--Reading qnt bytes from the i2c buffer;
*/ 
/*
id.link=0; if(qnt>32) {qnt=32;};					//--Clearing link, Limiting the number of bytes sent;
if(i2cGetStatus(id.bus)!=1) {id.link=1; return;}	//--Exit if i2c is not Master;
if(i2cSetBusy  (id.bus)==0) {		    return;}; 	//--i2c bus capture;
i2cSetClock(id.speed,id.bus);						//--Setting speed for device;
i2cSetChannel(id);									//--Installing i2c expander channel;
//-------------------------------------------------------------------------------------------------
i2cBeginTransmission(id); 							//--Begin of transaction;;	
for(id.idx=0; id.idx<qnt; id.idx++){i2cWrite(arr[id.idx],id.bus);} //--Send qnt bytes;
id.codeErr=i2cEndTransmission(id.bus);				//--End   of transaction;
//-------------------------------------------------------------------------------------------------
i2cClearChannel(id);								//--Reset i2c expander channel;	
i2cSetClock(i2cGetSpeed(id.bus),id.bus);			//--Setting speed default;
i2cClearBusy(id.bus); 								//--i2c bus release;	
id.link=1;};										//--Setting link and EXIT;
*/

//id.link=0;											//--Clearing link;
//-------------------------------------------------------------------------------------------------
//if(i2cGetStatus(id.bus)!=1) {id.link=1; return;}	//--Exit if i2c is not Master;
//if(i2cSetBusy  (id.bus)==0) {		    return;}; 	//--i2c bus capture;
//i2cSetClock(id.speed,id.bus);						//--Setting speed for device;
//i2cSetChannel(id);									//--Installing i2c expander channel;

//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
/*
id.codeErr=0;										//--Cleanig code error;
id.cnt=i2cRequestFrom(1,id.adr,id.bus,id.stop);		//--Requestting byte;
if(id.cnt!=1){id.codeErr=5;}						//--if the number of received bytes does not match the requested;
//-------------------------------------------------------------------------------------------------
if(id.codeErr==0){									//--Checking code error;
 i2cInitTimeOut(id.bus);							//--Setting start time out;
 id.bf8=100;										//--Setting size  time out;
 do{id.cnt=i2cAvailable(id.bus);					//--Сhecking the receive buffer i2c;
    if(id.cnt>=1){break;}							//--Checking buffer completion;
    if(i2cGetPastTime(id.bus)>(id.bf8)){id.codeErr=6;}	//--Checking time out;
   }while(1);    }									//--Waitting for the DO loop;
//-------------------------------------------------------------------------------------------------
id.bf8=0; if(id.codeErr==0){id.bf8=i2cRead(id.bus);}//--Reading a byte from the i2c buffer;
//-------------------------------------------------------------------------------------------------
i2cClearChannel(id);								//--Reset i2c expander channel;	
i2cSetClock(i2cGetSpeed(id.bus),id.bus);	 		//--Setting speed default;
i2cClearBusy(id.bus); 								//--i2c bus release;
id.link=1;};										//--Setting link and EXIT;	
*/

//-------------------------------------------------------------------------------------------------
/*
void i2cREAD(RT_HW_STRUCT_I2C_DEV &id, uint8_t reg){
id.link=0;											//--Clearing link;
//-------------------------------------------------------------------------------------------------
if(i2cGetStatus(id.bus)!=1) {id.link=1; return;}	//--Exit if i2c is not Master;
if(i2cSetBusy  (id.bus)==0) {		    return;}; 	//--i2c bus capture;
i2cSetClock(id.speed,id.bus);						//--Setting speed for device;
i2cSetChannel(id);									//--Installing i2c expander channel;
//-------------------------------------------------------------------------------------------------
i2cBeginTransmission(id); 							//--Begin of transaction;	
i2cWrite(reg,id.bus); 								//--Sending byte;
i2cEndTransmission(id);								//--End   of transaction;
//------------------------------------------------------------------------------------------------
if(id.codeErr==0){									//--Checking code error;
id.cnt=i2cRequestFrom(1,id.adr,id.bus,id.stop);		//--Requestting byte;
if(id.cnt!=1){id.codeErr=5;}}						//--if the number of received bytes does not match the requested;
//-------------------------------------------------------------------------------------------------
if(id.codeErr==0){									//--Checking code error;
 i2cInitTimeOut(id.bus);							//--Setting start time out;
 id.bf8=100;										//--Setting size  time out;
 do{id.cnt=i2cAvailable(id.bus);					//--Сhecking the receive buffer i2c;
    if(id.cnt>=1){break;}							//--Checking buffer completion;
    if(i2cGetPastTime(id.bus)>(id.bf8)){id.codeErr=6;}//Checking time out;
   }while(1);    }									//--Waitting for the DO loop;
//-------------------------------------------------------------------------------------------------   
id.bf8=0; if(id.codeErr==0){id.bf8=i2cRead(id.bus);}//--Reading a byte from the i2c buffer;
//-------------------------------------------------------------------------------------------------
i2cClearChannel(id);								//--Reset i2c expander channel;	
i2cSetClock(i2cGetSpeed(id.bus),id.bus);	 		//--Setting speed default;
i2cClearBusy(id.bus); 								//--i2c bus release;
id.link=1;};										//--Setting link and EXIT;	
*/

/*
//-------------------------------------------------------------------------------------------------
void i2cREADArr(RT_HW_STRUCT_I2C_DEV &id, uint8_t reg, uint8_t *arr, uint8_t qnt){
id.link=0;
//-------------------------------------------------------------------------------------------------
if(i2cGetStatus(id.bus)!=1) {id.link=1; return;}	//--Exit if i2c is not Master;
if(i2cSetBusy  (id.bus)==0) {		    return;}; 	//--i2c bus capture;
i2cSetClock(id.speed,id.bus);						//--Setting speed for device;
i2cSetChannel(id);									//--Installing i2c expander channel;
id.codeErr=0;										//--Cleanig code error;
if(qnt>32){qnt=32;}									//--Limiting the number of requested bytes;
//-------------------------------------------------------------------------------------------------
i2cBeginTransmission(id); 							//--Begin of transaction;	
i2cWrite(reg,id.bus); 								//--Sending byte;
i2cEndTransmission(id);								//--End   of transaction;
//------------------------------------------------------------------------------------------------
if(i2cGetCodeErr(id.bus)==0){						//--Checking code error;
 i2cSetCntByte(i2cRequestFrom(qnt,id.adr,id.bus,id.stop),id.bus); //--Request a byte;									
 if(i2cGetCntByte(id.bus)!=qnt){i2cSetCodeErr(5,id.bus);}//-if the number of received bytes does not match the requested;
}
//-------------------------------------------------------------------------------------------------
if(id.codeErr==0){									//--Checking code error;
 i2cInitTimeOut(id.bus);							//--Setting start time out;
 id.bf8=100;										//--Setting size  time out;
 do{id.cnt=i2cAvailable(id.bus);					//--Сhecking the receive buffer i2c;
    if(id.cnt>=qnt){break;}							//--Checking buffer completion;
    if(i2cGetPastTime(id.bus)>(id.bf8)){id.codeErr=6;}	//--Checking time out;
   }while(1);										//--Waitting for the DO loop;
} 
id.bf8=0;
//-------------------------------------------------------------------------------------------------   
if(i2cGetCodeErr(id.bus)==0){for(id.idx=0; id.idx<qnt; id.idx++){arr[id.idx]=i2cRead(id.bus);}}//--Reading qnt bytes from the i2c buffer;	
//-------------------------------------------------------------------------------------------------
i2cClearChannel(id);								//--Reset i2c expander channel;	
i2cSetClock(i2cGetSpeed(id.bus),id.bus);	 		//--Setting speed default;
i2cClearBusy(id.bus); 								//--i2c bus release;
id.link=1;};										//--Setting link and EXIT;	
*/